madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
/*
 * SPDX-FileCopyrightText: 2022-2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stdio.h>
#include <inttypes.h>
#include <stdint.h>
#include <string.h>
#include <time.h>
#include <sys/time.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/ringbuf.h"
#include "esp_bit_defs.h"
#include "esp_heap_caps.h"
#include "esp_err.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "hcd.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
#include "hal/usb_dwc_ll.h"
#endif
#include "usb/usb_types_stack.h"
#include "usb/usb_types_ch9.h"
#include "usb/usb_helpers.h"
#include "usb_private.h"
#include "usb_stream_descriptor.h"
#include "usb_host_helpers.h"
#include "include/usb_stream.h"
#include "usb_stream_sysview.h"

static const char *TAG = "USB_STREAM";

#define USB_CONFIG_NUM                       1                                           //Default configuration number
#define USB_DEVICE_ADDR                      1                                           //Default UVC device address
#define USB_ENUM_SHORT_DESC_REQ_LEN          8                                           //Number of bytes to request when getting a short descriptor (just enough to get bMaxPacketSize0 or wTotalLength)
#define USB_EP0_FS_DEFAULT_MPS               64                                          //Default MPS(max payload size) of Endpoint 0 for full speed device
#define USB_EP0_LS_DEFAULT_MPS               8                                           //Default MPS(max payload size) of Endpoint 0 for low speed device
#define USB_SHORT_DESC_REQ_LEN               8                                           //Number of bytes to request when getting a short descriptor (just enough to get bMaxPacketSize0 or wTotalLength)
#define USB_EP_ISOC_IN_MAX_MPS               384                                         //Max MPS for the custom RX FIFO split used on Arduino-ESP32 3.3.x
#define USB_EP_BULK_FS_MPS                   64                                          //Default MPS of full speed bulk transfer
#define USB_EP_BULK_HS_MPS                   512                                         //Default MPS of high speed bulk transfer
#define USB_EP_DIR_MASK                      0x80                                        //Mask for endpoint direction
#define USB_EVENT_QUEUE_LEN                  8                                           //USB event queue length
#define USB_STREAM_EVENT_QUEUE_LEN           32                                          //Stream event queue length
#define FRAME_MAX_INTERVAL                   2000000                                     //Specified in 100 ns units, General max frame interval (5 FPS)
#define FRAME_MIN_INTERVAL                   166666                                      //General min frame interval (60 FPS)
#define TIMEOUT_USB_CTRL_XFER_MS             CONFIG_USB_CTRL_XFER_TIMEOUT_MS             //Timeout for USB control transfer
#define WAITING_CTRL_XFER_MUTEX_MS           (TIMEOUT_USB_CTRL_XFER_MS + 100)            //Timeout for USER COMMAND control transfer
#define WAITING_TASK_RESOURCE_RELEASE_MS     50                                          //Additional waiting time for task resource release
#define WAITING_DEVICE_CONTROL_APPLY_MS      50                                          //Delay to avoid device control too frequently
#define TIMEOUT_USB_STREAM_DEINIT_MS         (TIMEOUT_USB_CTRL_XFER_MS + 100)            //Timeout for usb stream deinit
#define TIMEOUT_USB_STREAM_DISCONNECT_MS     (TIMEOUT_USB_CTRL_XFER_MS + 100)            //Timeout for usb stream disconnect
#define TIMEOUT_USER_COMMAND_MS              (TIMEOUT_USB_CTRL_XFER_MS + 200)            //Timeout for USER COMMAND control transfer
#define ACTIVE_DEBOUNCE_TIME_MS              100                                         //Debounce time for active state
#define CTRL_TRANSFER_DATA_MAX_BYTES         CONFIG_CTRL_TRANSFER_DATA_MAX_BYTES         //Max data length assumed in control transfer
#define NUM_BULK_STREAM_URBS                 CONFIG_NUM_BULK_STREAM_URBS                 //Number of bulk stream URBS created for continuous enqueue
#define NUM_BULK_BYTES_PER_URB               CONFIG_NUM_BULK_BYTES_PER_URB               //Required transfer bytes of each URB, check
#define NUM_ISOC_UVC_URBS                    CONFIG_NUM_ISOC_UVC_URBS                    //Number of isochronous stream URBS created for continuous enqueue
#define NUM_PACKETS_PER_URB                  CONFIG_NUM_PACKETS_PER_URB                  //Number of packets in each isochronous stream URB
#define WAITING_USB_AFTER_CONNECTION_MS      CONFIG_USB_WAITING_AFTER_CONN_MS            //Waiting n ms for usb device ready after connection
#define NUM_ISOC_SPK_URBS                    CONFIG_NUM_ISOC_SPK_URBS                    //Number of isochronous stream URBS created for continuous enqueue
#define NUM_ISOC_MIC_URBS                    CONFIG_NUM_ISOC_MIC_URBS                    //Number of isochronous stream URBS created for continuous enqueue
#define UAC_MIC_CB_MIN_MS_DEFAULT            CONFIG_UAC_MIC_CB_MIN_MS_DEFAULT            //Default min ms for mic callback
#define UAC_SPK_ST_MAX_MS_DEFAULT            CONFIG_UAC_SPK_ST_MAX_MS_DEFAULT            //Default max ms for speaker stream
#define UAC_MIC_PACKET_COMPENSATION          CONFIG_UAC_MIC_PACKET_COMPENSATION          //padding data if mic packet loss
#define UAC_SPK_PACKET_COMPENSATION          CONFIG_UAC_SPK_PACKET_COMPENSATION          //padding zero if speaker buffer empty
#define UAC_SPK_PACKET_COMPENSATION_SIZE_MS    CONFIG_UAC_SPK_PACKET_COMPENSATION_SIZE_MS    //padding n MS zero if speaker buffer empty
#define UAC_SPK_PACKET_COMPENSATION_TIMEOUT_MS CONFIG_UAC_SPK_PACKET_COMPENSATION_TIMEOUT_MS //padding n MS after wait timeout
#define UAC_SPK_PACKET_COMPENSATION_CONTINUOUS CONFIG_UAC_SPK_PACKET_COMPENSATION_CONTINUOUS //continuous padding zero at timeout interval
#define USB_PRE_ALLOC_CTRL_TRANSFER_URB        CONFIG_USB_PRE_ALLOC_CTRL_TRANSFER_URB        //Pre-allocate URB for control transfer

/**
 * @brief Task for USB I/O request and control transfer processing,
 * can not be blocked, higher task priority is suggested.
 *
 */
#define USB_PROC_TASK_NAME "usb_proc"
#define USB_PROC_TASK_PRIORITY (CONFIG_USB_PROC_TASK_PRIORITY+1)
#define USB_PROC_TASK_STACK_SIZE CONFIG_USB_PROC_TASK_STACK_SIZE
#define USB_PROC_TASK_CORE CONFIG_USB_PROC_TASK_CORE

/**
 * @brief Task for video/audio usb stream payload processing, polling and send data from ring buffer
 *
 */
#define USB_STREAM_NAME             "usb_stream_proc"
#define USB_STREAM_PRIORITY         CONFIG_USB_PROC_TASK_PRIORITY
#define USB_STREAM_STACK_SIZE       CONFIG_USB_PROC_TASK_STACK_SIZE
#define USB_STREAM_CORE             CONFIG_USB_PROC_TASK_CORE

/**
 * @brief Task for uvc sample processing, run user callback when new frame ready.
 *
 */
#define SAMPLE_PROC_TASK_NAME "sample_proc"
#define SAMPLE_PROC_TASK_PRIORITY CONFIG_SAMPLE_PROC_TASK_PRIORITY
#define SAMPLE_PROC_TASK_STACK_SIZE CONFIG_SAMPLE_PROC_TASK_STACK_SIZE
#if (CONFIG_SAMPLE_PROC_TASK_CORE == -1)
#define SAMPLE_PROC_TASK_CORE tskNO_AFFINITY
#else
#define SAMPLE_PROC_TASK_CORE CONFIG_SAMPLE_PROC_TASK_CORE
#endif

/**
 * @brief Events bit map
 *
 */
#define USB_HOST_INIT_DONE               BIT1         //set if uvc stream initted
#define USB_HOST_TASK_KILL_BIT           BIT2         //event bit to kill usb task
#define USB_UVC_STREAM_RUNNING           BIT3         //set if uvc streaming
#define UAC_SPK_STREAM_RUNNING           BIT4         //set if speaker streaming
#define UAC_MIC_STREAM_RUNNING           BIT5         //set if mic streaming
#define USB_CTRL_PROC_SUCCEED            BIT6         //set if control successfully operate
#define USB_CTRL_PROC_FAILED             BIT7         //set if control failed operate
#define UVC_SAMPLE_PROC_STOP_DONE        BIT8         //set if sample processing successfully stop
#define USB_STREAM_TASK_KILL_BIT         BIT9         //event bit to kill stream task
#define USB_STREAM_TASK_RECOVER_BIT      BIT10        //event bit to recover stream task
#define USB_STREAM_TASK_PROC_SUCCEED     BIT11        //set if stream task successfully operate
#define USB_STREAM_TASK_PROC_FAILED      BIT12        //set if stream task failed operate
#define USB_STREAM_DEVICE_READY_BIT      BIT13        //set if uvc device ready

/**
 * @brief Actions bit map
 *
 */
#define ACTION_PORT_RECOVER             BIT1          //recover port from error state
#define ACTION_PORT_DISABLE             BIT2          //disable port if user stop streaming
#define ACTION_DEVICE_CONNECT           BIT3          //find the connected device
#define ACTION_DEVICE_DISCONNECT        BIT4          //lost the connected device
#define ACTION_DEVICE_ENUM_RECOVER      BIT9          //recover enum the connected device
#define ACTION_DEVICE_ENUM              BIT10         //enum the connected device
#define ACTION_PIPE_DFLT_RECOVER        BIT11         //recover pipe from error state
#define ACTION_PIPE_DFLT_CLEAR          BIT12         //Clear pipe from error state
#define ACTION_PIPE_DFLT_DISABLE        BIT13         //disable pipe from error state
#define ACTION_PIPE_XFER_DONE           BIT14         //handle pipe transfer event
#define ACTION_PIPE_XFER_FAIL           BIT15         //handle pipe transfer event

/********************************************** Helper Functions **********************************************/
#define USB_CTRL_UVC_COMMIT_REQ(ctrl_req_ptr, itf) ({  \
        (ctrl_req_ptr)->bmRequestType = 0x21;   \
        (ctrl_req_ptr)->bRequest = UVC_SET_CUR;    \
        (ctrl_req_ptr)->wValue = (UVC_VS_COMMIT_CONTROL << 8); \
        (ctrl_req_ptr)->wIndex = (itf);    \
        (ctrl_req_ptr)->wLength = 26;   \
    })

#define USB_CTRL_UVC_PROBE_SET_REQ(ctrl_req_ptr, itf) ({  \
        (ctrl_req_ptr)->bmRequestType = 0x21;   \
        (ctrl_req_ptr)->bRequest = UVC_SET_CUR;    \
        (ctrl_req_ptr)->wValue = (UVC_VS_PROBE_CONTROL << 8); \
        (ctrl_req_ptr)->wIndex = (itf);    \
        (ctrl_req_ptr)->wLength = 26;   \
    })

#define USB_CTRL_UVC_PROBE_GET_REQ(ctrl_req_ptr, itf) ({  \
        (ctrl_req_ptr)->bmRequestType = 0xA1;   \
        (ctrl_req_ptr)->bRequest = UVC_GET_CUR;    \
        (ctrl_req_ptr)->wValue = (UVC_VS_PROBE_CONTROL << 8); \
        (ctrl_req_ptr)->wIndex = (itf);    \
        (ctrl_req_ptr)->wLength = 26;   \
    })

#define USB_CTRL_UVC_PROBE_GET_GENERAL_REQ(ctrl_req_ptr, req, itf) ({  \
        (ctrl_req_ptr)->bmRequestType = 0xA1;   \
        (ctrl_req_ptr)->bRequest = req;    \
        (ctrl_req_ptr)->wValue = (UVC_VS_PROBE_CONTROL << 8); \
        (ctrl_req_ptr)->wIndex = (itf);    \
        (ctrl_req_ptr)->wLength = 26;   \
    })

