madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
typedef enum {
    ENUM_STAGE_NONE = 0,                        /*!< There is no device awaiting enumeration. Start requires device connection and first reset. */
    ENUM_STAGE_START = 1,                       /*!< A device has connected and has already been reset once. Allocate a device object in USBH */
    //Basic device enumeration
    ENUM_STAGE_GET_SHORT_DEV_DESC = 2,          /*!< Getting short dev desc (wLength is ENUM_SHORT_DESC_REQ_LEN) */
    ENUM_STAGE_CHECK_SHORT_DEV_DESC = 3,        /*!< Save bMaxPacketSize0 from the short dev desc. Update the MPS of the enum pipe */
    ENUM_STAGE_SET_ADDR = 4,                    /*!< Send SET_ADDRESS request */
    ENUM_STAGE_CHECK_ADDR = 5,                  /*!< Update the enum pipe's target address */
    ENUM_STAGE_GET_FULL_DEV_DESC = 6,           /*!< Get the full dev desc */
    ENUM_STAGE_CHECK_FULL_DEV_DESC = 7,         /*!< Check the full dev desc, fill it into the device object in USBH. Save the string descriptor indexes*/
    ENUM_STAGE_GET_SHORT_CONFIG_DESC = 8,       /*!< Getting a short config desc (wLength is ENUM_SHORT_DESC_REQ_LEN) */
    ENUM_STAGE_CHECK_SHORT_CONFIG_DESC = 9,     /*!< Save wTotalLength of the short config desc */
    ENUM_STAGE_GET_FULL_CONFIG_DESC = 10,       /*!< Get the full config desc (wLength is the saved wTotalLength) */
    ENUM_STAGE_CHECK_FULL_CONFIG_DESC = 11,     /*!< Check the full config desc, fill it into the device object in USBH */
    ENUM_STAGE_SET_CONFIG = 12,                 /*!< Send SET_CONFIGURATION request */
    ENUM_STAGE_CHECK_CONFIG = 13,               /*!< Check that SET_CONFIGURATION request was successful */
    ENUM_STAGE_FAILED = 14,                     /*!< Failed enum */
} _enum_stage_t;

const char *const STAGE_STR[] = {
    "NONE",
    "START",
    "GET_SHORT_DEV_DESC",
    "CHECK_SHORT_DEV_DESC",
    "SET_ADDR",
    "CHECK_ADDR",
    "GET_FULL_DEV_DESC",
    "CHECK_FULL_DEV_DESC",
    "GET_SHORT_CONFIG_DESC",
    "CHECK_SHORT_CONFIG_DESC",
    "GET_FULL_CONFIG_DESC",
    "CHECK_FULL_CONFIG_DESC",
    "SET_CONFIG",
    "CHECK_CONFIG",
    "FAILED",
};

typedef struct {
    // dynamic values should be protect
    bool     suspended;
    uint16_t interface;
    uint16_t interface_alt;
    uint8_t ep_addr;
    // dynamic values, but using in single thread
    bool not_found;
    uvc_xfer_t xfer_type;
    usb_stream_t type;
    uint32_t ep_mps;
    const char *name;
    uint32_t evt_bit;
    urb_t **urb_list;
    uint32_t urb_num;
    uint32_t packets_per_urb;
    uint32_t bytes_per_packet;
    hcd_pipe_handle_t pipe_handle;
} _stream_ifc_t;

typedef struct {
    /** if true, stream is running (streaming video to host) */
    uvc_device_handle_t devh;
    uint8_t running;
    /** Current control block */
    struct uvc_stream_ctrl cur_ctrl;
    uint8_t fid;
    uint8_t reassemble_flag;
    uint8_t reassembling;
    uint32_t seq, hold_seq;
    uint32_t pts, hold_pts;
    uint32_t last_scr, hold_last_scr;
    size_t got_bytes, hold_bytes;
    uint8_t *outbuf, *holdbuf;
    uvc_frame_callback_t user_cb;
    void *user_ptr;
    SemaphoreHandle_t cb_mutex;
    TaskHandle_t taskh;
    struct uvc_frame frame;
    enum uvc_frame_format frame_format;
    struct timespec capture_time_finished;
} _uvc_stream_handle_t;

typedef struct {
    _stream_ifc_t *vs_ifc;
    _uvc_stream_handle_t *uvc_stream_hdl;
    enum uvc_frame_format frame_format;
    uint8_t format_index;
    // dynamic values should be protect
    uvc_frame_size_t *frame_size;
    uint8_t frame_num;
    uint8_t frame_index;
    uint16_t frame_width;
    uint16_t frame_height;
    uint32_t frame_interval;
} _uvc_device_t;

typedef enum {
    UAC_SPK,
    UAC_MIC,
    UAC_MAX,
} _uac_internal_stream_t;

typedef struct {
    // dynamic values, but using in single thread
    _stream_ifc_t *as_ifc[UAC_MAX];
    RingbufHandle_t ringbuf_hdl[UAC_MAX];
    // dynamic values should be protect
    // index 0: speaker, index 1: mic
    uint16_t ac_interface;
    uint8_t *mic_frame_buf;
    uint32_t mic_frame_buf_size;
    uint32_t mic_ms_bytes;
    uint32_t spk_ms_bytes;
    uint32_t spk_max_xfer_size;
    uac_frame_size_t *frame_size[UAC_MAX];
    uint8_t frame_num[UAC_MAX];
    uint8_t frame_index[UAC_MAX];
    uint8_t ch_num[UAC_MAX];
    uint16_t bit_resolution[UAC_MAX];
    uint32_t samples_frequence[UAC_MAX];
    bool     freq_ctrl_support[UAC_MAX];
    uint8_t  fu_id[UAC_MAX];
    uint8_t  mute_ch[UAC_MAX];
    uint8_t  volume_ch[UAC_MAX];
    bool     mute[UAC_MAX];
    uint32_t volume[UAC_MAX];
} _uac_device_t;

typedef struct {
    int in_mps;
    int non_periodic_out_mps;
    int periodic_out_mps;
} fifo_mps_limits_t;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)

#ifndef USB_DWC_FIFO_RX_LINES_DEFAULT
#define USB_DWC_FIFO_RX_LINES_DEFAULT 104
#endif

#ifndef USB_DWC_FIFO_NPTX_LINES_DEFAULT
#define USB_DWC_FIFO_NPTX_LINES_DEFAULT 48
#endif

#ifndef USB_DWC_FIFO_PTX_LINES_DEFAULT
#define USB_DWC_FIFO_PTX_LINES_DEFAULT 48
#endif

#ifndef USB_DWC_FIFO_RX_LINES_BIASRX
#define USB_DWC_FIFO_RX_LINES_BIASRX 152
#endif

#ifndef USB_DWC_FIFO_NPTX_LINES_BIASRX
#define USB_DWC_FIFO_NPTX_LINES_BIASRX 16
#endif

#ifndef USB_DWC_FIFO_PTX_LINES_BIASRX
#define USB_DWC_FIFO_PTX_LINES_BIASRX 32
#endif

const fifo_mps_limits_t s_mps_limits_default = {
    .in_mps = (USB_DWC_FIFO_RX_LINES_DEFAULT - 2) * 4,
    .non_periodic_out_mps = USB_DWC_FIFO_NPTX_LINES_DEFAULT * 4,
    .periodic_out_mps = USB_DWC_FIFO_PTX_LINES_DEFAULT * 4,
};
const fifo_mps_limits_t s_mps_limits_bias_rx = {
    .in_mps = (USB_DWC_FIFO_RX_LINES_BIASRX - 2) * 4,
    .non_periodic_out_mps = USB_DWC_FIFO_NPTX_LINES_BIASRX * 4,
    .periodic_out_mps = USB_DWC_FIFO_PTX_LINES_BIASRX * 4,
};
#else
extern const fifo_mps_limits_t mps_limits_default;
extern const fifo_mps_limits_t mps_limits_bias_rx;
#define s_mps_limits_default mps_limits_default
#define s_mps_limits_bias_rx mps_limits_bias_rx
#endif

typedef struct {
    // const user config values
    uac_config_t uac_cfg;
    uvc_config_t uvc_cfg;
    // const values after usb stream start
    bool enabled[STREAM_MAX];
    hcd_port_handle_t port_hdl;
    hcd_port_fifo_bias_t fifo_bias;
    const fifo_mps_limits_t *mps_limits;
    uint16_t configuration;
    uint8_t dev_addr;
    QueueHandle_t queue_hdl;
    QueueHandle_t stream_queue_hdl;
    TaskHandle_t stream_task_hdl;
    EventGroupHandle_t event_group_hdl;
    SemaphoreHandle_t xfer_mutex_hdl;
    SemaphoreHandle_t ctrl_smp_hdl;
    urb_t *ctrl_urb;
    // const values after usb enum
    hcd_pipe_handle_t dflt_pipe_hdl;
    usb_speed_t dev_speed;
    uint8_t ep_mps;
    _uac_device_t *uac;
    _uvc_device_t *uvc;
    _stream_ifc_t *ifc[STREAM_MAX];
    // only operate in single thread
    _enum_stage_t enum_stage;
    // dynamic values should be protect
    _device_state_t state;
    state_callback_t state_cb;
    void *state_cb_arg;
    uint32_t flags;
} _usb_device_t;

/**
 * @brief Singleton Pattern, Only one device supported
 *
 */
static _usb_device_t s_usb_dev = {0};
static portMUX_TYPE s_uvc_lock = portMUX_INITIALIZER_UNLOCKED;
#define UVC_ENTER_CRITICAL()           portENTER_CRITICAL(&s_uvc_lock)
#define UVC_EXIT_CRITICAL()            portEXIT_CRITICAL(&s_uvc_lock)

