madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
typedef enum {
    USER_EVENT,
    PORT_EVENT,
    PIPE_EVENT,
} _event_type_t;

typedef enum {
    //accept by usb stream task
    STREAM_SUSPEND,
    STREAM_RESUME,
    //accept by usb task
    USB_RECOVER,
    PIPE_RECOVER,
} _user_cmd_t;

typedef struct {
    _event_type_t _type;
    union {
        void *user_hdl;
        hcd_port_handle_t port_hdl;
        hcd_pipe_handle_t pipe_handle;
    } _handle;
    union {
        _user_cmd_t user_cmd;
        hcd_port_event_t port_event;
        hcd_pipe_event_t pipe_event;
    } _event;
    void *_event_data;
} _event_msg_t;

IRAM_ATTR static _device_state_t _usb_device_get_state()
{
    UVC_ENTER_CRITICAL();
    _device_state_t state = s_usb_dev.state;
    UVC_EXIT_CRITICAL();
    return state;
}

IRAM_ATTR static bool _usb_port_callback(hcd_port_handle_t port_hdl, hcd_port_event_t port_event, void *user_arg, bool in_isr)
{
    QueueHandle_t usb_event_queue = (QueueHandle_t)user_arg;
    assert(in_isr);    //Current HCD implementation should never call a port callback in a task context
    _event_msg_t event_msg = {
        ._type = PORT_EVENT,
        ._handle.port_hdl = port_hdl,
        ._event.port_event = port_event,
    };
    BaseType_t xTaskWoken = pdFALSE;
    xQueueSendFromISR(usb_event_queue, &event_msg, &xTaskWoken);
    return (xTaskWoken == pdTRUE);
}

IRAM_ATTR static bool _usb_pipe_callback(hcd_pipe_handle_t pipe_handle, hcd_pipe_event_t pipe_event, void *user_arg, bool in_isr)
{
    QueueHandle_t usb_event_queue = (QueueHandle_t)user_arg;
    _event_msg_t event_msg = {
        ._type = PIPE_EVENT,
        ._handle.pipe_handle = pipe_handle,
        ._event.pipe_event = pipe_event,
    };

    if (in_isr) {
        BaseType_t xTaskWoken = pdFALSE;
        xQueueSendFromISR(usb_event_queue, &event_msg, &xTaskWoken);
        return (xTaskWoken == pdTRUE);
    } else {
        xQueueSend(usb_event_queue, &event_msg, portMAX_DELAY);
        return false;
    }
}

static void _uvc_process_payload(_uvc_stream_handle_t *strmh, size_t req_len, uint8_t *payload, size_t payload_len);

IRAM_ATTR static void _processing_uvc_pipe(_uvc_stream_handle_t *strmh, hcd_pipe_handle_t pipe_handle, bool if_enqueue)
{
    UVC_CHECK_RETURN_VOID(pipe_handle != NULL, "pipe handle can not be NULL");
    static uint32_t stats_last_ms = 0;
    static uint32_t stats_urbs = 0;
    static uint32_t stats_urb_errors = 0;
    static uint32_t stats_bulk_urbs = 0;
    static uint32_t stats_isoc_packets = 0;
    static uint32_t stats_isoc_bad = 0;
    static uint32_t stats_zero_packets = 0;
    static uint32_t stats_nonzero_packets = 0;
    static uint32_t stats_nonzero_bytes = 0;
    static uint32_t stats_status_counts[USB_TRANSFER_STATUS_NO_DEVICE + 1] = {0};
    static uint32_t stats_first_bad_status = 0;
    static uint32_t stats_first_bad_actual = 0;
    static uint32_t stats_first_bad_requested = 0;
    const bool packet_stats_enabled = s_usb_dev.flags & FLAG_UVC_PACKET_STATS;

    urb_t *urb_done = hcd_urb_dequeue(pipe_handle);

    if (urb_done == NULL) {
        ESP_LOGV(TAG, "uvc pipe dequeue failed");
        return;
    }

    if (packet_stats_enabled) {
        stats_urbs++;
        if (urb_done->transfer.status != USB_TRANSFER_STATUS_COMPLETED) {
            stats_urb_errors++;
        }
    }

    if (urb_done->transfer.num_isoc_packets == 0) { // Bulk transfer
        if (packet_stats_enabled) {
            stats_bulk_urbs++;
            if (urb_done->transfer.actual_num_bytes > 0) {
                stats_nonzero_packets++;
                stats_nonzero_bytes += urb_done->transfer.actual_num_bytes;
            } else {
                stats_zero_packets++;
            }
        }
        if (urb_done->transfer.actual_num_bytes > 0) {
            _uvc_process_payload(strmh, urb_done->transfer.num_bytes, urb_done->transfer.data_buffer, urb_done->transfer.actual_num_bytes);
        }
    } else { // isoc transfer
        for (size_t i = 0; i < urb_done->transfer.num_isoc_packets; i++) {
            if (packet_stats_enabled) {
                stats_isoc_packets++;
            }
            if (urb_done->transfer.isoc_packet_desc[i].status != USB_TRANSFER_STATUS_COMPLETED) {
                if (packet_stats_enabled) {
                    stats_isoc_bad++;
                    const usb_transfer_status_t status = urb_done->transfer.isoc_packet_desc[i].status;
                    if (status <= USB_TRANSFER_STATUS_NO_DEVICE) {
                        stats_status_counts[status]++;
                    }
                    if (stats_first_bad_status == 0) {
                        stats_first_bad_status = status;
                        stats_first_bad_actual = urb_done->transfer.isoc_packet_desc[i].actual_num_bytes;
                        stats_first_bad_requested = urb_done->transfer.isoc_packet_desc[i].num_bytes;
                    }
                }
                ESP_LOGV(TAG, "uvc isoc packet=%u status=%d actual=%u",
                         (unsigned)i,
                         urb_done->transfer.isoc_packet_desc[i].status,
                         (unsigned)urb_done->transfer.isoc_packet_desc[i].actual_num_bytes);
                continue;
            }

            uint8_t *simplebuffer = urb_done->transfer.data_buffer + (i * s_usb_dev.uvc->vs_ifc->ep_mps);
            if (packet_stats_enabled) {
                if (urb_done->transfer.isoc_packet_desc[i].actual_num_bytes > 0) {
                    stats_nonzero_packets++;
                    stats_nonzero_bytes += urb_done->transfer.isoc_packet_desc[i].actual_num_bytes;
                } else {
                    stats_zero_packets++;
                }
            }
            _uvc_process_payload(strmh, (urb_done->transfer.isoc_packet_desc[i].num_bytes), simplebuffer, (urb_done->transfer.isoc_packet_desc[i].actual_num_bytes));
        }
    }

    if (packet_stats_enabled) {
        const uint32_t now_ms = xTaskGetTickCount() * portTICK_PERIOD_MS;
        if (stats_last_ms == 0) {
            stats_last_ms = now_ms;
        } else if ((uint32_t)(now_ms - stats_last_ms) >= 1000) {
            printf("UVC stats urbs=%"PRIu32" urbErr=%"PRIu32" bulk=%"PRIu32" isocPkts=%"PRIu32" bad=%"PRIu32" zero=%"PRIu32" nonzero=%"PRIu32" bytes=%"PRIu32"\n",
                   stats_urbs,
                   stats_urb_errors,
                   stats_bulk_urbs,
                   stats_isoc_packets,
                   stats_isoc_bad,
                   stats_zero_packets,
                   stats_nonzero_packets,
                   stats_nonzero_bytes);
            printf("UVC status counts ok=%"PRIu32" err=%"PRIu32" timeout=%"PRIu32" cancel=%"PRIu32" stall=%"PRIu32" overflow=%"PRIu32" skipped=%"PRIu32" noDev=%"PRIu32" firstBad=%"PRIu32" actual=%"PRIu32" requested=%"PRIu32"\n",
                   stats_status_counts[USB_TRANSFER_STATUS_COMPLETED],
                   stats_status_counts[USB_TRANSFER_STATUS_ERROR],
                   stats_status_counts[USB_TRANSFER_STATUS_TIMED_OUT],
                   stats_status_counts[USB_TRANSFER_STATUS_CANCELED],
                   stats_status_counts[USB_TRANSFER_STATUS_STALL],
                   stats_status_counts[USB_TRANSFER_STATUS_OVERFLOW],
                   stats_status_counts[USB_TRANSFER_STATUS_SKIPPED],
                   stats_status_counts[USB_TRANSFER_STATUS_NO_DEVICE],
                   stats_first_bad_status,
                   stats_first_bad_actual,
                   stats_first_bad_requested);
            stats_last_ms = now_ms;
        }
    }

    if (if_enqueue) {
        esp_err_t ret = hcd_urb_enqueue(pipe_handle, urb_done);
        if (ret != ESP_OK) {
            // We not handle the error because the usb stream task will handle it
            ESP_LOGE(TAG, "UVC urb enqueue failed %s", esp_err_to_name(ret));
        }

