madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
    }

}

/*------------------------------------------------ USB Control Process Code ----------------------------------------------------*/
static esp_err_t _apply_pipe_config(usb_stream_t stream)
{
    _usb_device_t *usb_dev = &s_usb_dev;
    /* If users skipped the get descriptors process for quick start, use user-mandated configs */
    if (stream == STREAM_UVC && usb_dev->enabled[STREAM_UVC] && !usb_dev->ifc[STREAM_UVC]->not_found) {
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        usb_dev->ifc[STREAM_UVC]->interface = usb_dev->uvc_cfg.interface;
        usb_dev->ifc[STREAM_UVC]->interface_alt = usb_dev->uvc_cfg.interface_alt;
        usb_dev->ifc[STREAM_UVC]->ep_addr = usb_dev->uvc_cfg.ep_addr;
        usb_dev->ifc[STREAM_UVC]->ep_mps = usb_dev->uvc_cfg.ep_mps;
        usb_dev->ifc[STREAM_UVC]->xfer_type = usb_dev->uvc_cfg.xfer_type;
#endif
        if (usb_dev->ifc[STREAM_UVC]->ep_mps > USB_EP_ISOC_IN_MAX_MPS) {
            usb_dev->ifc[STREAM_UVC]->ep_mps = USB_EP_ISOC_IN_MAX_MPS;
        }
    }
    if (stream == STREAM_UAC_MIC && usb_dev->enabled[STREAM_UAC_MIC] && !usb_dev->ifc[STREAM_UAC_MIC]->not_found) {
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        usb_dev->ifc[STREAM_UAC_MIC]->interface = usb_dev->uac_cfg.mic_interface;
        usb_dev->ifc[STREAM_UAC_MIC]->interface_alt = 1;
        usb_dev->ifc[STREAM_UAC_MIC]->ep_addr = usb_dev->uac_cfg.mic_ep_addr;
        usb_dev->ifc[STREAM_UAC_MIC]->ep_mps = usb_dev->uac_cfg.mic_ep_mps;
        usb_dev->uac->ac_interface = usb_dev->uac_cfg.ac_interface;
        usb_dev->uac->fu_id[UAC_MIC] = usb_dev->uac_cfg.mic_fu_id;
        usb_dev->uac->mute_ch[UAC_MIC] = 1 << 0;
        usb_dev->uac->volume_ch[UAC_MIC] = 1 << 1;
#endif
        usb_dev->ifc[STREAM_UAC_MIC]->xfer_type = UVC_XFER_ISOC;
        usb_dev->uac->volume[UAC_MIC] = 80;
        usb_dev->uac->mute[UAC_MIC] = 0;
        if (usb_dev->ifc[STREAM_UAC_MIC]->ep_mps > usb_dev->mps_limits->in_mps) {
            usb_dev->ifc[STREAM_UAC_MIC]->ep_mps = usb_dev->mps_limits->in_mps;
        }
    }
    if (stream == STREAM_UAC_SPK && usb_dev->enabled[STREAM_UAC_SPK] && !usb_dev->ifc[STREAM_UAC_SPK]->not_found) {
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        usb_dev->ifc[STREAM_UAC_SPK]->interface = usb_dev->uac_cfg.spk_interface;
        usb_dev->ifc[STREAM_UAC_SPK]->interface_alt = 1;
        usb_dev->ifc[STREAM_UAC_SPK]->ep_addr = usb_dev->uac_cfg.spk_ep_addr;
        usb_dev->ifc[STREAM_UAC_SPK]->ep_mps = usb_dev->uac_cfg.spk_ep_mps;
        usb_dev->uac->ac_interface = usb_dev->uac_cfg.ac_interface;
        usb_dev->uac->fu_id[UAC_SPK] = usb_dev->uac_cfg.spk_fu_id;
        usb_dev->uac->mute_ch[UAC_SPK] = 1 << 0;
        usb_dev->uac->volume_ch[UAC_SPK] = 1 << 1;
#endif
        usb_dev->ifc[STREAM_UAC_SPK]->xfer_type = UVC_XFER_ISOC;
        usb_dev->uac->volume[UAC_SPK] = 80;
        usb_dev->uac->mute[UAC_SPK] = 0;
        if (usb_dev->ifc[STREAM_UAC_SPK]->ep_mps > usb_dev->mps_limits->periodic_out_mps) {
            usb_dev->ifc[STREAM_UAC_SPK]->ep_mps = usb_dev->mps_limits->periodic_out_mps;
        }
    }
    return ESP_OK;
}

static esp_err_t _apply_stream_config(usb_stream_t stream)
{
    ESP_LOGD(TAG, "apply stream config");
    _usb_device_t *usb_dev = &s_usb_dev;
    if (stream == STREAM_UVC && usb_dev->enabled[STREAM_UVC] && !usb_dev->ifc[STREAM_UVC]->not_found) {
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        static uvc_frame_size_t frame_size = {0};
        frame_size.width = usb_dev->uvc_cfg.frame_width;
        frame_size.height = usb_dev->uvc_cfg.frame_height;
        frame_size.interval_max = usb_dev->uvc_cfg.frame_interval;
        frame_size.interval_min = usb_dev->uvc_cfg.frame_interval;
        frame_size.interval = usb_dev->uvc_cfg.frame_interval;
        usb_dev->uvc->format_index = usb_dev->uvc_cfg.format_index;
        usb_dev->uvc->frame_index = usb_dev->uvc_cfg.frame_index;
        usb_dev->uvc->frame_height = usb_dev->uvc_cfg.frame_height;
        usb_dev->uvc->frame_width = usb_dev->uvc_cfg.frame_width;
        usb_dev->uvc->frame_num = 1;
        usb_dev->uvc->frame_size = &frame_size;
        usb_dev->uvc->frame_interval = usb_dev->uvc_cfg.frame_interval;
#else
        UVC_CHECK((usb_dev->uvc->frame_index <= usb_dev->uvc->frame_num), "invalid frame index", ESP_ERR_INVALID_STATE);
        if (usb_dev->uvc->frame_index == 0) {
            ESP_LOGD(TAG, "Expected uvc resolution not found, frame_index=%d", usb_dev->uvc->frame_index);
            return ESP_ERR_NOT_FOUND;
        }
        UVC_CHECK(usb_dev->uvc->format_index != 0, "invalid format index", ESP_ERR_INVALID_STATE);
        usb_dev->uvc->frame_width = usb_dev->uvc->frame_size[usb_dev->uvc->frame_index - 1].width;
        usb_dev->uvc->frame_height = usb_dev->uvc->frame_size[usb_dev->uvc->frame_index - 1].height;
        usb_dev->uvc->frame_interval = usb_dev->uvc->frame_size[usb_dev->uvc->frame_index - 1].interval;
#endif
        if (usb_dev->ifc[STREAM_UVC]->xfer_type == UVC_XFER_BULK) {
            usb_dev->ifc[STREAM_UVC]->urb_num = NUM_BULK_STREAM_URBS;
            usb_dev->ifc[STREAM_UVC]->packets_per_urb = 1;
            usb_dev->ifc[STREAM_UVC]->bytes_per_packet = NUM_BULK_BYTES_PER_URB;
        } else {
            usb_dev->ifc[STREAM_UVC]->urb_num = NUM_ISOC_UVC_URBS;
            usb_dev->ifc[STREAM_UVC]->packets_per_urb = NUM_PACKETS_PER_URB;
            usb_dev->ifc[STREAM_UVC]->bytes_per_packet = usb_dev->ifc[STREAM_UVC]->ep_mps;
        }
        ESP_LOGD(TAG, "UVC format_index=%"PRIu8", frame_index=%"PRIu8", frame_width=%"PRIu16", frame_height=%"PRIu16", frame_interval=%"PRIu32,
                 usb_dev->uvc->format_index, usb_dev->uvc->frame_index, usb_dev->uvc->frame_width, usb_dev->uvc->frame_height, usb_dev->uvc->frame_interval);
    }
    if (stream == STREAM_UAC_MIC && usb_dev->enabled[STREAM_UAC_MIC] && !usb_dev->ifc[STREAM_UAC_MIC]->not_found) {
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        static uac_frame_size_t frame_size = {0};
        frame_size.ch_num = (usb_dev->uac_cfg.mic_ch_num == 0) ? 1 : usb_dev->uac_cfg.mic_ch_num;
        frame_size.bit_resolution = usb_dev->uac_cfg.mic_bit_resolution;
        frame_size.samples_frequence = usb_dev->uac_cfg.mic_samples_frequence;
        usb_dev->uac->frame_index[UAC_MIC] = 1;
        usb_dev->uac->frame_num[UAC_MIC] = 1;
        usb_dev->uac->frame_size[UAC_MIC] = &frame_size;
        usb_dev->uac->ch_num[UAC_MIC] = (usb_dev->uac_cfg.mic_ch_num == 0) ? 1 : usb_dev->uac_cfg.mic_ch_num;
        usb_dev->uac->bit_resolution[UAC_MIC] = usb_dev->uac_cfg.mic_bit_resolution;
        usb_dev->uac->samples_frequence[UAC_MIC] = usb_dev->uac_cfg.mic_samples_frequence;
        usb_dev->uac->freq_ctrl_support[UAC_MIC] = true;
#else
        UVC_CHECK((usb_dev->uac->frame_index[UAC_MIC] <= usb_dev->uac->frame_num[UAC_MIC]), "invalid frame index", ESP_ERR_INVALID_STATE);
        if (usb_dev->uac->frame_index[UAC_MIC] == 0) {
            ESP_LOGD(TAG, "Expected uac channel/frequency/bits not found, frame_index=%d", usb_dev->uac->frame_index[UAC_MIC]);
            return ESP_ERR_NOT_FOUND;
        }
        usb_dev->uac->ch_num[UAC_MIC] = usb_dev->uac->frame_size[UAC_MIC][usb_dev->uac->frame_index[UAC_MIC] - 1].ch_num;
        usb_dev->uac->bit_resolution[UAC_MIC] = usb_dev->uac->frame_size[UAC_MIC][usb_dev->uac->frame_index[UAC_MIC] - 1].bit_resolution;
        usb_dev->uac->samples_frequence[UAC_MIC] = usb_dev->uac->frame_size[UAC_MIC][usb_dev->uac->frame_index[UAC_MIC] - 1].samples_frequence;
#endif
        usb_dev->ifc[STREAM_UAC_MIC]->urb_num = NUM_ISOC_MIC_URBS;
        usb_dev->ifc[STREAM_UAC_MIC]->packets_per_urb = UAC_MIC_CB_MIN_MS_DEFAULT;
        usb_dev->ifc[STREAM_UAC_MIC]->bytes_per_packet = usb_dev->ifc[STREAM_UAC_MIC]->ep_mps;
        usb_dev->uac->mic_ms_bytes = usb_dev->uac->ch_num[UAC_MIC] * usb_dev->uac->samples_frequence[UAC_MIC] / 1000 * usb_dev->uac->bit_resolution[UAC_MIC] / 8;
        uint32_t mic_min_bytes = usb_dev->uac->mic_ms_bytes * UAC_MIC_CB_MIN_MS_DEFAULT;
        ESP_LOGD(TAG, "min_bytes in mic callback = %"PRIu32, mic_min_bytes);
        if (usb_dev->uac_cfg.mic_buf_size && (usb_dev->uac_cfg.mic_buf_size < mic_min_bytes)) {
            ESP_LOGE(TAG, "mic_buf_size=%"PRIu32" must >= mic_min_bytes %"PRIu32, usb_dev->uac_cfg.mic_buf_size, mic_min_bytes);
            assert(0);
        }
        usb_dev->uac->mic_frame_buf = heap_caps_realloc(usb_dev->uac->mic_frame_buf, mic_min_bytes, MALLOC_CAP_INTERNAL);
        UVC_CHECK(usb_dev->uac->mic_frame_buf, "alloc mic frame buf failed", ESP_ERR_NO_MEM);
        usb_dev->uac->mic_frame_buf_size = mic_min_bytes;
        ESP_LOGD(TAG, "MIC ch_num=%"PRIu8", bit_resolution=%"PRIu16", samples_frequence=%"PRIu32", bytes_per_packet=%"PRIu32,
                 usb_dev->uac->ch_num[UAC_MIC], usb_dev->uac->bit_resolution[UAC_MIC], usb_dev->uac->samples_frequence[UAC_MIC], usb_dev->ifc[STREAM_UAC_MIC]->bytes_per_packet);
    }
    if (stream == STREAM_UAC_SPK && usb_dev->enabled[STREAM_UAC_SPK] && !usb_dev->ifc[STREAM_UAC_SPK]->not_found) {
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        static uac_frame_size_t frame_size = {0};
        frame_size.ch_num = (usb_dev->uac_cfg.spk_ch_num == 0) ? 1 : usb_dev->uac_cfg.spk_ch_num;
        frame_size.bit_resolution = usb_dev->uac_cfg.spk_bit_resolution;
        frame_size.samples_frequence = usb_dev->uac_cfg.spk_samples_frequence;
        usb_dev->uac->frame_index[UAC_SPK] = 1;
        usb_dev->uac->frame_num[UAC_SPK] = 1;
        usb_dev->uac->frame_size[UAC_SPK] = &frame_size;
        usb_dev->uac->ch_num[UAC_SPK] = (usb_dev->uac_cfg.spk_ch_num == 0) ? 1 : usb_dev->uac_cfg.spk_ch_num;
        usb_dev->uac->bit_resolution[UAC_SPK] = usb_dev->uac_cfg.spk_bit_resolution;
        usb_dev->uac->samples_frequence[UAC_SPK] = usb_dev->uac_cfg.spk_samples_frequence;
        usb_dev->uac->freq_ctrl_support[UAC_SPK] = true;
#else
        UVC_CHECK((usb_dev->uac->frame_index[UAC_SPK] <= usb_dev->uac->frame_num[UAC_SPK]), "invalid frame index", ESP_ERR_INVALID_STATE);
        if (usb_dev->uac->frame_index[UAC_SPK] == 0) {
            ESP_LOGD(TAG, "Expected uac channel/frequency/bits not found, frame_index=%d", usb_dev->uac->frame_index[UAC_SPK]);
            return ESP_ERR_NOT_FOUND;
        }
        usb_dev->uac->ch_num[UAC_SPK] = usb_dev->uac->frame_size[UAC_SPK][usb_dev->uac->frame_index[UAC_SPK] - 1].ch_num;
        usb_dev->uac->bit_resolution[UAC_SPK] = usb_dev->uac->frame_size[UAC_SPK][usb_dev->uac->frame_index[UAC_SPK] - 1].bit_resolution;
        usb_dev->uac->samples_frequence[UAC_SPK] = usb_dev->uac->frame_size[UAC_SPK][usb_dev->uac->frame_index[UAC_SPK] - 1].samples_frequence;
#endif
        usb_dev->ifc[STREAM_UAC_SPK]->urb_num = NUM_ISOC_SPK_URBS;
        usb_dev->ifc[STREAM_UAC_SPK]->packets_per_urb = UAC_SPK_ST_MAX_MS_DEFAULT;
        usb_dev->ifc[STREAM_UAC_SPK]->bytes_per_packet = usb_dev->uac->ch_num[UAC_SPK] * usb_dev->uac->samples_frequence[UAC_SPK] / 1000 * usb_dev->uac->bit_resolution[UAC_SPK] / 8;
        //TODO: Reset mps size to bytes_per_packet. to save tx fifo space
        //usb_dev->ifc[STREAM_UAC_SPK]->ep_mps = usb_dev->ifc[STREAM_UAC_SPK]->bytes_per_packet;
        usb_dev->uac->spk_max_xfer_size = usb_dev->ifc[STREAM_UAC_SPK]->packets_per_urb * usb_dev->ifc[STREAM_UAC_SPK]->bytes_per_packet;
        ESP_LOGD(TAG, "SPK ch_num=%"PRIu8", bit_resolution=%"PRIu16", samples_frequence=%"PRIu32", bytes_per_packet=%"PRIu32,
                 usb_dev->uac->ch_num[UAC_SPK], usb_dev->uac->bit_resolution[UAC_SPK], usb_dev->uac->samples_frequence[UAC_SPK], usb_dev->ifc[STREAM_UAC_SPK]->bytes_per_packet);
    }
    return ESP_OK;
}

