madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
static esp_err_t _update_config_from_descriptor(const usb_config_desc_t *cfg_desc)
{
    if (cfg_desc == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    _uac_device_t *uac_dev = s_usb_dev.uac;
    _uvc_device_t *uvc_dev = s_usb_dev.uvc;
    _usb_device_t *usb_dev = &s_usb_dev;
    int offset = 0;
    bool already_next = false;
    uint16_t wTotalLength = cfg_desc->wTotalLength;
    /* flags indicate if required setting format and frame found */
    bool format_set_found = false;
    uint8_t format_idx = 0;
    uint8_t frame_num = 0;
    enum uvc_frame_format format = UVC_FRAME_FORMAT_UNKNOWN;
    /* flags user defined frame found */
    bool user_frame_found = false;
    uint8_t user_frame_idx = 0;
    /* flags indicate if suitable audio stream interface found */
    uint16_t uac_ver_found = 0;
    bool uac_format_others_found = 0;
    bool ac_intf_found = false;
    uint8_t ac_intf_idx = 0;
    bool as_mic_intf_found = false;
    uint8_t as_mic_feature_unit_idx = 0;
    uint8_t as_mic_intf_idx = 0;
    uint8_t as_mic_intf_ep_attr = 0;
    uint16_t as_mic_intf_ep_mps = 0;
    uint8_t as_mic_intf_ep_addr = 0;
    uint8_t as_mic_volume_ch = __UINT8_MAX__;
    uint8_t as_mic_mute_ch = __UINT8_MAX__;
    uint8_t as_mic_next_unit_idx = 0;
    uint8_t as_mic_output_terminal = 0;
    bool as_spk_intf_found = false;
    bool as_spk_freq_found = false;
    bool as_mic_freq_found = false;
    bool as_spk_bit_res_found = false;
    bool as_mic_bit_res_found = false;
    bool as_mic_freq_ctrl_found = false;
    bool as_spk_freq_ctrl_found = false;
    uint8_t as_spk_input_terminal = 0;
    uint8_t as_mic_input_terminal = 0;
    uint8_t as_spk_feature_unit_idx = 0;
    uint8_t as_spk_next_unit_idx = 0;
    uint8_t as_spk_volume_ch = __UINT8_MAX__;
    uint8_t as_spk_mute_ch = __UINT8_MAX__;
    uint8_t as_spk_intf_idx = 0;
    uint8_t as_spk_intf_ep_attr = 0;
    uint16_t as_spk_intf_ep_mps = 0;
    uint8_t as_spk_intf_ep_addr = 0;
    bool as_spk_ch_num_found = false;
    bool as_mic_ch_num_found = false;
    /* flags indicate if suitable video stream interface found */
    bool vs_intf_found = false;
    uint8_t vs_intf_idx = 0;
    uint8_t vs_intf_alt_idx = 0;
    uint8_t vs_intf_ep_attr = 0;
    uint16_t vs_intf_ep_mps = 0;
    uint8_t vs_intf_ep_addr = 0;
    uint8_t vs_intf1_idx = 0;
    uint8_t vs_intf1_alt_idx = 0;
    uint8_t vs_intf1_ep_attr = 0;
    uint16_t vs_intf1_ep_mps = 0;
    uint8_t vs_intf1_ep_addr = 0;
    /* flags indicate if suitable video stream interface found */
    uint8_t context_class = 0;
    uint8_t context_subclass = 0;
    uint8_t context_intf = 0;
    uint8_t context_intf_alt = 0;
    uint8_t context_connected_terminal = 0;
    const usb_standard_desc_t *next_desc = (const usb_standard_desc_t *)cfg_desc;

    do {
        already_next = false;
        switch (next_desc->bDescriptorType) {
        case USB_B_DESCRIPTOR_TYPE_INTERFACE_ASSOCIATION: {
            const ifc_assoc_desc_t *assoc_desc = (const ifc_assoc_desc_t *)next_desc;
            if (assoc_desc->bFunctionClass == USB_CLASS_VIDEO) {
                ESP_LOGD(TAG, "-------------------- Video Descriptor Start ----------------------");
            } else if (assoc_desc->bFunctionClass == USB_CLASS_AUDIO) {
                ESP_LOGD(TAG, "-------------------- Audio Descriptor Start ----------------------");
            } else {
                print_assoc_desc((const uint8_t *)assoc_desc);
                break;
            }
            print_assoc_desc((const uint8_t *)assoc_desc);
        }
        break;
        case USB_B_DESCRIPTOR_TYPE_CONFIGURATION:
            print_cfg_desc((const uint8_t *)next_desc);
            break;
        case USB_B_DESCRIPTOR_TYPE_INTERFACE: {
            const usb_intf_desc_t *_intf_desc = (const usb_intf_desc_t *)next_desc;
            context_intf = _intf_desc->bInterfaceNumber;
            context_intf_alt = _intf_desc->bAlternateSetting;
            context_class = _intf_desc->bInterfaceClass;
            context_subclass = _intf_desc->bInterfaceSubClass;
            if (context_class == USB_CLASS_VIDEO && context_subclass == VIDEO_SUBCLASS_CONTROL) {
                ESP_LOGD(TAG, "Found Video Control interface");
            }
            if (context_class == USB_CLASS_VIDEO && context_subclass == VIDEO_SUBCLASS_STREAMING) {
                ESP_LOGD(TAG, "Found Video Stream interface, %d-%d", context_intf, context_intf_alt);
            }
            if (context_class == USB_CLASS_AUDIO && context_subclass == AUDIO_SUBCLASS_CONTROL) {
                ESP_LOGD(TAG, "Found Audio Control interface");
            }
            if (context_class == USB_CLASS_AUDIO && context_subclass == AUDIO_SUBCLASS_STREAMING) {
                ESP_LOGD(TAG, "Found Audio Stream interface, %d-%d", context_intf, context_intf_alt);
            }
            print_intf_desc((const uint8_t *)_intf_desc);
        }
        break;
        case USB_B_DESCRIPTOR_TYPE_ENDPOINT:
            print_ep_desc((const uint8_t *)next_desc);
            if (context_class == USB_CLASS_VIDEO && context_subclass == VIDEO_SUBCLASS_STREAMING) {
                uint16_t ep_mps = 0;
                uint8_t ep_attr = 0;
                uint8_t ep_addr = 0;
                parse_ep_desc((const uint8_t *)next_desc, &ep_mps, &ep_addr, &ep_attr);
                if (ep_mps <= USB_EP_ISOC_IN_MAX_MPS && ep_mps > vs_intf_ep_mps) {
                    vs_intf_found = true;
                    vs_intf_ep_mps = ep_mps;
                    vs_intf_ep_attr = ep_attr;
                    vs_intf_ep_addr = ep_addr;
                    vs_intf_idx = context_intf;
                    vs_intf_alt_idx = context_intf_alt;
                }
                if (context_intf_alt == 1) {
                    //workaround for some camera with error desc
                    vs_intf1_ep_mps = ep_mps;
                    vs_intf1_ep_attr = ep_attr;
                    vs_intf1_ep_addr = ep_addr;
                    vs_intf1_idx = context_intf;
                    vs_intf1_alt_idx = context_intf_alt;
                }
            } else if (context_class == USB_CLASS_AUDIO && context_subclass == AUDIO_SUBCLASS_STREAMING) {
                if (context_intf_alt > 1) {
                    ESP_LOGD(TAG, "Found Audio Stream interface %d-%d, skip", context_intf, context_intf_alt);
                    break;
                }
                uint16_t ep_mps = 0;
                uint8_t ep_attr = 0;
                uint8_t ep_addr = 0;
                parse_ep_desc((const uint8_t *)next_desc, &ep_mps, &ep_addr, &ep_attr);
                if (ep_addr & 0x80) {
                    as_mic_intf_found = true;
                    as_mic_intf_ep_mps = ep_mps;
                    as_mic_intf_ep_attr = ep_attr;
                    as_mic_intf_ep_addr = ep_addr;
                    as_mic_intf_idx = context_intf;
                } else {
                    as_spk_intf_found = true;
                    as_spk_intf_ep_mps = ep_mps;
                    as_spk_intf_ep_attr = ep_attr;
                    as_spk_intf_ep_addr = ep_addr;
                    as_spk_intf_idx = context_intf;
                }
            }
            ESP_LOGV(TAG, "descriptor parsed %d/%d, vs interface %d-%d", offset, wTotalLength, context_intf, context_intf_alt);
            break;
        case CS_INTERFACE_DESC:
            if (context_class == USB_CLASS_VIDEO && context_subclass == VIDEO_SUBCLASS_CONTROL) {
                const desc_header_t *header = (const desc_header_t *)next_desc;
                switch (header->bDescriptorSubtype) {
                default:
                    ESP_LOGD(TAG, "Found video control entity, skip");
                    break;
                }
            } else if (context_class == USB_CLASS_VIDEO && context_subclass == VIDEO_SUBCLASS_STREAMING) {
                if (context_intf_alt == 0) {
                    //this is format related desc
                    uint16_t _frame_width = 0;
                    uint16_t _frame_heigh = 0;
                    uint8_t _frame_idx = 0;
                    const desc_header_t *header = (const desc_header_t *)next_desc;
                    switch (header->bDescriptorSubtype) {
                    case VIDEO_CS_ITF_VS_INPUT_HEADER:
                        print_uvc_header_desc((const uint8_t *)next_desc, VIDEO_SUBCLASS_STREAMING);
                        break;
                    case VIDEO_CS_ITF_VS_FORMAT_MJPEG:
                        if (usb_dev->uvc_cfg.format != UVC_FORMAT_MJPEG) {
                            break;
                        }
                        parse_vs_format_mjpeg_desc((const uint8_t *)next_desc, &format_idx, &frame_num, &format);
                        if (uvc_dev) {
                            uvc_frame_size_t *frame_size = uvc_dev->frame_size;
                            frame_size = (uvc_frame_size_t *)heap_caps_realloc(frame_size, frame_num * sizeof(uvc_frame_size_t), MALLOC_CAP_DEFAULT);
                            UVC_CHECK(frame_size, "alloc uvc frame size failed", ESP_ERR_NO_MEM);
                            UVC_ENTER_CRITICAL();
                            uvc_dev->frame_num = frame_num;
                            uvc_dev->frame_size = frame_size;
                            uvc_dev->frame_format = format;
                            UVC_EXIT_CRITICAL();
                        }
                        format_set_found = true;
                        break;
                    case VIDEO_CS_ITF_VS_FRAME_MJPEG: {
                        if (usb_dev->uvc_cfg.format != UVC_FORMAT_MJPEG) {
                            break;
                        }
                        uint8_t interval_type = 0;
                        const uint32_t *pp_interval = NULL;
                        uint32_t dflt_interval = 0;
                        uint32_t max_interval = 0;
                        uint32_t min_interval = 0;
                        uint32_t step_interval = 0;
                        uint32_t final_interval = 0;
                        parse_vs_frame_mjpeg_desc((const uint8_t *)next_desc, &_frame_idx, &_frame_width, &_frame_heigh, &interval_type, &pp_interval, &dflt_interval);
                        if (interval_type) {
                            min_interval = pp_interval[0];
                            for (size_t i = 0; i < interval_type; i++) {
                                if (usb_dev->uvc_cfg.frame_interval == pp_interval[i]) {
                                    final_interval = pp_interval[i];
                                }
                                if (pp_interval[i] > max_interval) {
                                    max_interval = pp_interval[i];
                                }
                                if (pp_interval[i] < min_interval) {
                                    min_interval = pp_interval[i];
                                }
                            }
                        } else {
                            min_interval = pp_interval[0];
                            max_interval = pp_interval[1];
                            step_interval = pp_interval[2];
                            if (usb_dev->uvc_cfg.frame_interval >= min_interval && usb_dev->uvc_cfg.frame_interval <= max_interval) {
                                for (uint32_t i = min_interval; i < max_interval; i += step_interval) {
                                    if (usb_dev->uvc_cfg.frame_interval >= i && usb_dev->uvc_cfg.frame_interval < (i + step_interval)) {
                                        final_interval = i;
                                    }
                                }
                            }
                        }
                        if (final_interval == 0) {
                            final_interval = dflt_interval;
                            ESP_LOGD(TAG, "UVC frame interval %" PRIu32 " not found, using default = %" PRIu32, usb_dev->uvc_cfg.frame_interval, final_interval);
                        } else {
                            ESP_LOGD(TAG, "UVC frame interval %" PRIu32 " found = %" PRIu32, usb_dev->uvc_cfg.frame_interval, final_interval);
                        }
                        if (uvc_dev) {
                            assert((_frame_idx - 1) < uvc_dev->frame_num); //should not happen
                            UVC_ENTER_CRITICAL();
                            uvc_dev->frame_size[_frame_idx - 1].width = _frame_width;
                            uvc_dev->frame_size[_frame_idx - 1].height = _frame_heigh;
                            uvc_dev->frame_size[_frame_idx - 1].interval = final_interval;
                            uvc_dev->frame_size[_frame_idx - 1].interval_min = min_interval;
                            uvc_dev->frame_size[_frame_idx - 1].interval_max = max_interval;
                            uvc_dev->frame_size[_frame_idx - 1].interval_step = step_interval;
                            UVC_EXIT_CRITICAL();
                        }
                        if (user_frame_found == true) {
                            break;
                        }
                        if (((_frame_width == usb_dev->uvc_cfg.frame_width) || (FRAME_RESOLUTION_ANY == usb_dev->uvc_cfg.frame_width))
                                && ((_frame_heigh == usb_dev->uvc_cfg.frame_height) || (FRAME_RESOLUTION_ANY == usb_dev->uvc_cfg.frame_height))) {
                            user_frame_found = true;
                            user_frame_idx = _frame_idx;
                        } else if ((_frame_width == usb_dev->uvc_cfg.frame_height) && (_frame_heigh == usb_dev->uvc_cfg.frame_width)) {
                            ESP_LOGW(TAG, "found width*height %u * %u , orientation swap?", _frame_heigh, _frame_width);
                        }
                        break;
                    }
                    case VIDEO_CS_ITF_VS_FORMAT_FRAME_BASED:
                        if (usb_dev->uvc_cfg.format != UVC_FORMAT_FRAME_BASED) {
                            break;
                        }
                        parse_vs_format_frame_based_desc((const uint8_t *)next_desc, &format_idx, &frame_num, &format);
                        if (uvc_dev) {
                            uvc_frame_size_t *frame_size = uvc_dev->frame_size;
                            frame_size = (uvc_frame_size_t *)heap_caps_realloc(frame_size, frame_num * sizeof(uvc_frame_size_t), MALLOC_CAP_DEFAULT);
                            UVC_CHECK(frame_size, "alloc uvc frame size failed", ESP_ERR_NO_MEM);
                            UVC_ENTER_CRITICAL();
                            uvc_dev->frame_num = frame_num;
                            uvc_dev->frame_size = frame_size;
                            uvc_dev->frame_format = format;
                            UVC_EXIT_CRITICAL();
                        }
                        format_set_found = true;
                        break;
                    case VIDEO_CS_ITF_VS_FRAME_FRAME_BASED: {
                        if (usb_dev->uvc_cfg.format != UVC_FORMAT_FRAME_BASED) {
                            break;
                        }
                        uint8_t interval_type = 0;
                        const uint32_t *pp_interval = NULL;
                        uint32_t dflt_interval = 0;
                        uint32_t max_interval = 0;
                        uint32_t min_interval = 0;
                        uint32_t step_interval = 0;
                        uint32_t final_interval = 0;
                        parse_vs_frame_frame_based_desc((const uint8_t *)next_desc, &_frame_idx, &_frame_width, &_frame_heigh, &interval_type, &pp_interval, &dflt_interval);
                        if (interval_type) {
                            min_interval = pp_interval[0];
                            for (size_t i = 0; i < interval_type; i++) {
                                if (usb_dev->uvc_cfg.frame_interval == pp_interval[i]) {
                                    final_interval = pp_interval[i];
                                }
                                if (pp_interval[i] > max_interval) {
                                    max_interval = pp_interval[i];
                                }
                                if (pp_interval[i] < min_interval) {
                                    min_interval = pp_interval[i];
                                }
                            }
                        } else {
                            min_interval = pp_interval[0];
                            max_interval = pp_interval[1];
                            step_interval = pp_interval[2];
                            if (usb_dev->uvc_cfg.frame_interval >= min_interval && usb_dev->uvc_cfg.frame_interval <= max_interval) {
                                for (uint32_t i = min_interval; i < max_interval; i += step_interval) {
                                    if (usb_dev->uvc_cfg.frame_interval >= i && usb_dev->uvc_cfg.frame_interval < (i + step_interval)) {
                                        final_interval = i;
                                    }
                                }
                            }
                        }
                        if (final_interval == 0) {
                            final_interval = dflt_interval;
                            ESP_LOGD(TAG, "UVC frame interval %" PRIu32 " not found, using default = %" PRIu32, usb_dev->uvc_cfg.frame_interval, final_interval);
                        } else {
                            ESP_LOGD(TAG, "UVC frame interval %" PRIu32 " found = %" PRIu32, usb_dev->uvc_cfg.frame_interval, final_interval);
                        }
                        if (uvc_dev) {
                            assert((_frame_idx - 1) < uvc_dev->frame_num); //should not happen
                            UVC_ENTER_CRITICAL();
                            uvc_dev->frame_size[_frame_idx - 1].width = _frame_width;
                            uvc_dev->frame_size[_frame_idx - 1].height = _frame_heigh;
                            uvc_dev->frame_size[_frame_idx - 1].interval = final_interval;
                            uvc_dev->frame_size[_frame_idx - 1].interval_min = min_interval;
                            uvc_dev->frame_size[_frame_idx - 1].interval_max = max_interval;
                            uvc_dev->frame_size[_frame_idx - 1].interval_step = step_interval;
                            UVC_EXIT_CRITICAL();
                        }
                        if (user_frame_found == true) {
                            break;
                        }
                        if (((_frame_width == usb_dev->uvc_cfg.frame_width) || (FRAME_RESOLUTION_ANY == usb_dev->uvc_cfg.frame_width))
                                && ((_frame_heigh == usb_dev->uvc_cfg.frame_height) || (FRAME_RESOLUTION_ANY == usb_dev->uvc_cfg.frame_height))) {
                            user_frame_found = true;
                            user_frame_idx = _frame_idx;
                        } else if ((_frame_width == usb_dev->uvc_cfg.frame_height) && (_frame_heigh == usb_dev->uvc_cfg.frame_width)) {
                            ESP_LOGW(TAG, "found width*height %u * %u , orientation swap?", _frame_heigh, _frame_width);
                        }
                        break;
                    }
                    default:
                        break;
                    }
                }
            } else if (context_class == USB_CLASS_AUDIO && context_subclass == AUDIO_SUBCLASS_CONTROL) {
                const desc_header_t *header = (const desc_header_t *)next_desc;
                switch (header->bDescriptorSubtype) {
                case AUDIO_CS_AC_INTERFACE_HEADER:
                    parse_ac_header_desc((const uint8_t *)next_desc, &uac_ver_found, NULL);
                    if (uac_ver_found != UAC_VERSION_1) {
                        ESP_LOGW(TAG, "UAC version 0x%04x Not supported", uac_ver_found);
                    }
                    break;
                case AUDIO_CS_AC_INTERFACE_INPUT_TERMINAL: {
                    uint8_t terminal_idx = 0;
                    uint16_t terminal_type = 0;
                    parse_ac_input_desc((const uint8_t *)next_desc, &terminal_idx, &terminal_type);
                    if (terminal_type == AUDIO_TERM_TYPE_USB_STREAMING) {
                        as_spk_input_terminal = terminal_idx;
                        as_spk_next_unit_idx = terminal_idx;
                    } else if (terminal_type == AUDIO_TERM_TYPE_IN_GENERIC_MIC || terminal_type == AUDIO_TERM_TYPE_HEADSET) {
                        as_mic_input_terminal = terminal_idx;
                        as_mic_next_unit_idx = terminal_idx;
                    } else {
                        ESP_LOGW(TAG, "Input terminal type 0x%04x Not supported", terminal_type);
                    }
                }
                break;
                case AUDIO_CS_AC_INTERFACE_FEATURE_UNIT: {
                    ac_intf_found = true;
                    ac_intf_idx = context_intf;
                    uint8_t source_idx = 0;
                    uint8_t volume_ch = 0;
                    uint8_t mute_ch = 0;
                    uint8_t feature_unit_idx = 0;
                    // Note: we prefer using master channel for feature control
                    parse_ac_feature_desc((const uint8_t *)next_desc, &source_idx, &feature_unit_idx, &volume_ch, &mute_ch);
                    // We just assume the next unit of input terminal is feature unit
                    if (source_idx == as_spk_next_unit_idx || source_idx == as_spk_input_terminal) {
                        as_spk_next_unit_idx = feature_unit_idx;
                        as_spk_feature_unit_idx = feature_unit_idx;
                        as_spk_mute_ch = mute_ch;
                        as_spk_volume_ch = volume_ch;
                    } else if (source_idx == as_mic_next_unit_idx || source_idx == as_mic_input_terminal) {
                        as_mic_next_unit_idx = feature_unit_idx;
                        as_mic_feature_unit_idx = feature_unit_idx;
                        as_mic_mute_ch = mute_ch;
                        as_mic_volume_ch = volume_ch;
                    }
                }
                break;
                case AUDIO_CS_AC_INTERFACE_OUTPUT_TERMINAL: {
                    uint8_t terminal_idx = 0;
                    uint16_t terminal_type = 0;
                    parse_ac_output_desc((const uint8_t *)next_desc, &terminal_idx, &terminal_type);
                    if (terminal_type == AUDIO_TERM_TYPE_USB_STREAMING) {
                        as_mic_output_terminal = terminal_idx;
                        as_spk_next_unit_idx = terminal_idx;
                    } else if (terminal_type == AUDIO_TERM_TYPE_OUT_GENERIC_SPEAKER || terminal_type == AUDIO_TERM_TYPE_HEADSET) {
                        as_mic_next_unit_idx = terminal_idx;
                    } else {
                        ESP_LOGW(TAG, "Output terminal type 0x%04x Not supported", terminal_type);
                    }
                }
                break;
                default:
                    break;
                }
            } else if (context_class == USB_CLASS_AUDIO && context_subclass == AUDIO_SUBCLASS_STREAMING) {
                const desc_header_t *header = (const desc_header_t *)next_desc;
                if (context_intf_alt > 1) {
                    ESP_LOGD(TAG, "Found audio interface sub-desc:%d of %d-%d, skip", header->bDescriptorSubtype, context_intf, context_intf_alt);
                    break;
                }
                switch (header->bDescriptorSubtype) {
                case AUDIO_CS_AS_INTERFACE_AS_GENERAL: {
                    uint16_t format_tag = 0;
                    uint8_t source_idx = 0;
                    parse_as_general_desc((const uint8_t *)next_desc, &source_idx, &format_tag);
                    context_connected_terminal = source_idx;
                    //we only support TYPEI
