madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
                    if (format_tag != UAC_FORMAT_TYPEI) {
                        uac_format_others_found = true;
                        ESP_LOGW(TAG, "Audio format type 0x%04x Not supported", format_tag);
                    }
                }
                break;
                case AUDIO_CS_AS_INTERFACE_FORMAT_TYPE: {
                    uint8_t channel_num = 0;
                    uint8_t bit_resolution = 0;
                    uint8_t freq_type = 0;
                    const uint8_t *p_samfreq = NULL;
                    parse_as_type_desc((const uint8_t *)next_desc, &channel_num, &bit_resolution, &freq_type, &p_samfreq);
                    if (context_connected_terminal == as_mic_output_terminal) {
                        if (usb_dev->enabled[STREAM_UAC_MIC]) {
                            uint8_t frame_num = freq_type == 0 ? 1 : freq_type;
                            uac_frame_size_t *frame_size = uac_dev->frame_size[UAC_MIC];
                            frame_size = (uac_frame_size_t *)heap_caps_realloc(frame_size, frame_num * sizeof(uac_frame_size_t), MALLOC_CAP_DEFAULT);
                            UVC_CHECK(frame_size, "alloc mic frame size failed", ESP_ERR_NO_MEM);
                            UVC_ENTER_CRITICAL();
                            uac_dev->frame_num[UAC_MIC] = frame_num;
                            uac_dev->frame_size[UAC_MIC] = frame_size;
                            UVC_EXIT_CRITICAL();
                        }
                        if (channel_num == usb_dev->uac_cfg.mic_ch_num || usb_dev->uac_cfg.mic_ch_num == UAC_CH_ANY) {
                            as_mic_ch_num_found = true;
                        }

                        if (bit_resolution == usb_dev->uac_cfg.mic_bit_resolution || usb_dev->uac_cfg.mic_bit_resolution == UAC_BITS_ANY) {
                            as_mic_bit_res_found = true;
                        }
                        if (freq_type == 0) {
                            uint32_t min_samfreq = (p_samfreq[2] << 16) + (p_samfreq[1] << 8) + p_samfreq[0];
                            uint32_t max_samfreq = (p_samfreq[5] << 16) + (p_samfreq[4] << 8) + p_samfreq[3];
                            uint32_t mic_frame_frequence = 0;
                            uint8_t mic_frame_index = 0;
                            if (usb_dev->uac_cfg.mic_samples_frequence <= max_samfreq && usb_dev->uac_cfg.mic_samples_frequence >= min_samfreq) {
                                as_mic_freq_found = true;
                                mic_frame_index = 1;
                                mic_frame_frequence = usb_dev->uac_cfg.mic_samples_frequence;
                            } else if (usb_dev->uac_cfg.mic_samples_frequence == UAC_FREQUENCY_ANY) {
                                as_mic_freq_found = true;
                                mic_frame_index = 1;
                                mic_frame_frequence = min_samfreq;
                            }
                            if (usb_dev->enabled[STREAM_UAC_MIC]) {
                                UVC_ENTER_CRITICAL();
                                uac_dev->frame_size[UAC_MIC][0].ch_num = channel_num;
                                uac_dev->frame_size[UAC_MIC][0].bit_resolution = bit_resolution;
                                uac_dev->frame_size[UAC_MIC][0].samples_frequence = mic_frame_frequence;
                                uac_dev->frame_size[UAC_MIC][0].samples_frequence_min = min_samfreq;
                                uac_dev->frame_size[UAC_MIC][0].samples_frequence_max = max_samfreq;
                                uac_dev->frame_index[UAC_MIC] = mic_frame_index;
                                UVC_EXIT_CRITICAL();
                            }
                        } else {
                            uint8_t mic_frame_index = 0;
                            for (int i = 0; i < freq_type; ++i) {
                                if (usb_dev->uac_cfg.mic_samples_frequence == UAC_FREQUENCY_ANY) {
                                    as_mic_freq_found = true;
                                    mic_frame_index = 1;
                                } else if (((p_samfreq[3 * i + 2] << 16) + (p_samfreq[3 * i + 1] << 8) + p_samfreq[3 * i]) == usb_dev->uac_cfg.mic_samples_frequence) {
                                    as_mic_freq_found = true;
                                    mic_frame_index = i + 1;
                                }
                                if (usb_dev->enabled[STREAM_UAC_MIC]) {
                                    UVC_ENTER_CRITICAL();
                                    uac_dev->frame_size[UAC_MIC][i].ch_num = channel_num;
                                    uac_dev->frame_size[UAC_MIC][i].bit_resolution = bit_resolution;
                                    uac_dev->frame_size[UAC_MIC][i].samples_frequence = ((p_samfreq[3 * i + 2] << 16) + (p_samfreq[3 * i + 1] << 8) + p_samfreq[3 * i]);
                                    uac_dev->frame_size[UAC_MIC][i].samples_frequence_min = 0;
                                    uac_dev->frame_size[UAC_MIC][i].samples_frequence_max = 0;
                                    uac_dev->frame_index[UAC_MIC] = mic_frame_index;
                                    UVC_EXIT_CRITICAL();
                                }
                            }
                        }

                    } else if (context_connected_terminal == as_spk_input_terminal) {
                        if (usb_dev->enabled[STREAM_UAC_SPK]) {
                            uint8_t frame_num = freq_type == 0 ? 1 : freq_type;
                            uac_frame_size_t *frame_size = uac_dev->frame_size[UAC_SPK];
                            frame_size = (uac_frame_size_t *)heap_caps_realloc(frame_size, frame_num * sizeof(uac_frame_size_t), MALLOC_CAP_DEFAULT);
                            UVC_CHECK(frame_size, "alloc spk frame size failed", ESP_ERR_NO_MEM);
                            UVC_ENTER_CRITICAL();
                            uac_dev->frame_num[UAC_SPK] = frame_num;
                            uac_dev->frame_size[UAC_SPK] = frame_size;
                            UVC_EXIT_CRITICAL();
                        }
                        if (channel_num == usb_dev->uac_cfg.spk_ch_num || usb_dev->uac_cfg.spk_ch_num == UAC_CH_ANY) {
                            as_spk_ch_num_found = true;
                        }
                        if (bit_resolution == usb_dev->uac_cfg.spk_bit_resolution || usb_dev->uac_cfg.spk_bit_resolution == UAC_BITS_ANY) {
                            as_spk_bit_res_found = true;
                        }
                        if (freq_type == 0) {
                            uint32_t min_samfreq = (p_samfreq[2] << 16) + (p_samfreq[1] << 8) + p_samfreq[0];
                            uint32_t max_samfreq = (p_samfreq[5] << 16) + (p_samfreq[4] << 8) + p_samfreq[3];
                            uint32_t spk_frame_frequence = 0;
                            uint8_t spk_frame_index = 0;
                            if (usb_dev->uac_cfg.spk_samples_frequence <= max_samfreq && usb_dev->uac_cfg.spk_samples_frequence >= min_samfreq) {
                                as_spk_freq_found = true;
                                spk_frame_index = 1;
                                spk_frame_frequence = usb_dev->uac_cfg.spk_samples_frequence;
                            } else if (usb_dev->uac_cfg.spk_samples_frequence == UAC_FREQUENCY_ANY) {
                                as_spk_freq_found = true;
                                spk_frame_index = 1;
                                spk_frame_frequence = min_samfreq;
                            }
                            if (usb_dev->enabled[STREAM_UAC_SPK]) {
                                UVC_ENTER_CRITICAL();
                                uac_dev->frame_size[UAC_SPK][0].ch_num = channel_num;
                                uac_dev->frame_size[UAC_SPK][0].bit_resolution = bit_resolution;
                                uac_dev->frame_size[UAC_SPK][0].samples_frequence = spk_frame_frequence;
                                uac_dev->frame_size[UAC_SPK][0].samples_frequence_min = min_samfreq;
                                uac_dev->frame_size[UAC_SPK][0].samples_frequence_max = max_samfreq;
                                uac_dev->frame_index[UAC_SPK] = spk_frame_index;
                                UVC_EXIT_CRITICAL();
                            }
                        } else {
                            uint8_t spk_frame_index = 0;
                            for (int i = 0; i < freq_type; ++i) {
                                if (usb_dev->uac_cfg.spk_samples_frequence == UAC_FREQUENCY_ANY) {
                                    as_spk_freq_found = true;
                                    spk_frame_index = 1;
                                } else if (((p_samfreq[3 * i + 2] << 16) + (p_samfreq[3 * i + 1] << 8) + p_samfreq[3 * i]) == usb_dev->uac_cfg.spk_samples_frequence) {
                                    as_spk_freq_found = true;
                                    spk_frame_index = i + 1;
                                }
                                if (usb_dev->enabled[STREAM_UAC_SPK]) {
                                    UVC_ENTER_CRITICAL();
                                    uac_dev->frame_size[UAC_SPK][i].ch_num = channel_num;
                                    uac_dev->frame_size[UAC_SPK][i].bit_resolution = bit_resolution;
                                    uac_dev->frame_size[UAC_SPK][i].samples_frequence = ((p_samfreq[3 * i + 2] << 16) + (p_samfreq[3 * i + 1] << 8) + p_samfreq[3 * i]);
                                    uac_dev->frame_size[UAC_SPK][i].samples_frequence_min = 0;
                                    uac_dev->frame_size[UAC_SPK][i].samples_frequence_max = 0;
                                    uac_dev->frame_index[UAC_SPK] = spk_frame_index;
                                    UVC_EXIT_CRITICAL();
                                }
                            }
                        }
                    }
                }
                break;
                default:
                    break;
                }
            }
            ESP_LOGV(TAG, "descriptor parsed %d/%d, vs interface %d-%d", offset, wTotalLength, context_intf, context_intf_alt);
            break;
        case CS_ENDPOINT_DESC:
            if (context_class == USB_CLASS_AUDIO && context_subclass == AUDIO_SUBCLASS_STREAMING) {
                if (context_intf_alt > 1) {
                    ESP_LOGD(TAG, "Found audio endpoint desc of interface %d-%d, skip", context_intf, context_intf_alt);
                    break;
                }
                as_cs_ep_desc_t *desc = (as_cs_ep_desc_t *)next_desc;
                if (context_connected_terminal == as_spk_input_terminal) {
                    as_spk_freq_ctrl_found = AUDIO_EP_CONTROL_SAMPLING_FEQ & desc->bmAttributes;
                } else if (context_connected_terminal == as_mic_output_terminal) {
                    as_mic_freq_ctrl_found = AUDIO_EP_CONTROL_SAMPLING_FEQ & desc->bmAttributes;
                }
            }
            break;
        default:
            break;
        }
        if (!already_next && next_desc) {
            next_desc = usb_parse_next_descriptor(next_desc, wTotalLength, &offset);
        }
        ESP_LOGV(TAG, "descriptor parsed %d/%d", offset, wTotalLength);
    } while (next_desc != NULL);

