madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
    // check all params we get
    if (usb_dev->enabled[STREAM_UVC]) {
        const bool force_uvc_config = (usb_dev->flags & FLAG_UVC_FORCE_STREAM_CONFIG) && usb_dev->uvc_cfg.interface;
        if (force_uvc_config) {
            ESP_LOGW(TAG, "Force UVC stream config from user settings");
            UVC_ENTER_CRITICAL();
            uvc_dev->vs_ifc->interface = usb_dev->uvc_cfg.interface;
            uvc_dev->vs_ifc->interface_alt = usb_dev->uvc_cfg.interface_alt;
            uvc_dev->vs_ifc->ep_addr = usb_dev->uvc_cfg.ep_addr;
            UVC_EXIT_CRITICAL();
            uvc_dev->vs_ifc->ep_mps = usb_dev->uvc_cfg.ep_mps;
            uvc_dev->vs_ifc->xfer_type = usb_dev->uvc_cfg.xfer_type;
            vs_intf_found = true;
        } else if (vs_intf_found) {
            //Re-config uvc device
            UVC_ENTER_CRITICAL();
            uvc_dev->vs_ifc->interface = vs_intf_idx;
            uvc_dev->vs_ifc->interface_alt = vs_intf_alt_idx;
            uvc_dev->vs_ifc->ep_addr = vs_intf_ep_addr;
            UVC_EXIT_CRITICAL();
            uvc_dev->vs_ifc->ep_mps = vs_intf_ep_mps;
            uvc_dev->vs_ifc->xfer_type = (vs_intf_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_ISOC ? UVC_XFER_ISOC
                                         : ((vs_intf_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_BULK ? UVC_XFER_BULK : UVC_XFER_UNKNOWN);
            ESP_LOGI(TAG, "Actual VS Interface(MPS <= %d) found, interface = %u, alt = %u", USB_EP_ISOC_IN_MAX_MPS, vs_intf_idx, vs_intf_alt_idx);
            ESP_LOGI(TAG, "\tEndpoint(%s) Addr = 0x%x, MPS = %u", uvc_dev->vs_ifc->xfer_type == UVC_XFER_ISOC ? "ISOC"
                     : (uvc_dev->vs_ifc->xfer_type == UVC_XFER_BULK ? "BULK" : "Unknown"), vs_intf_ep_addr, vs_intf_ep_mps);
        } else if (usb_dev->uvc_cfg.interface) {
            //Try with user's config
            ESP_LOGW(TAG, "VS Interface(MPS <= %d) NOT found", USB_EP_ISOC_IN_MAX_MPS);
            ESP_LOGW(TAG, "Try with user's config");
            UVC_ENTER_CRITICAL();
            uvc_dev->vs_ifc->interface = usb_dev->uvc_cfg.interface;
            uvc_dev->vs_ifc->interface_alt = usb_dev->uvc_cfg.interface_alt;
            uvc_dev->vs_ifc->ep_addr = usb_dev->uvc_cfg.ep_addr;
            UVC_EXIT_CRITICAL();
            uvc_dev->vs_ifc->ep_mps = usb_dev->uvc_cfg.ep_mps;
            uvc_dev->vs_ifc->xfer_type = usb_dev->uvc_cfg.xfer_type;
            vs_intf_found = true;
        } else {
            //Try with first interface
            UVC_ENTER_CRITICAL();
            uvc_dev->vs_ifc->interface = vs_intf1_idx;
            uvc_dev->vs_ifc->interface_alt = vs_intf1_alt_idx;
            uvc_dev->vs_ifc->ep_addr = vs_intf1_ep_addr;
            UVC_EXIT_CRITICAL();
            uvc_dev->vs_ifc->ep_mps = vs_intf1_ep_mps;
            uvc_dev->vs_ifc->xfer_type = (vs_intf1_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_ISOC ? UVC_XFER_ISOC
                                         : ((vs_intf1_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_BULK ? UVC_XFER_BULK : UVC_XFER_UNKNOWN);
            vs_intf_found = true;
            ESP_LOGW(TAG, "VS Interface(MPS <= %d) NOT found", USB_EP_ISOC_IN_MAX_MPS);
            ESP_LOGW(TAG, "Try with first alt-interface config");
        }
        if ((usb_dev->flags & FLAG_UVC_FORCE_STREAM_CONFIG) && usb_dev->uvc_cfg.format_index) {
            ESP_LOGW(TAG, "Force UVC format index = %u", usb_dev->uvc_cfg.format_index);
            uvc_dev->format_index = usb_dev->uvc_cfg.format_index;
        } else if (format_set_found) {
            ESP_LOGI(TAG, "Actual %s format index, format index = %u, contains %u frames", usb_dev->uvc_cfg.format == UVC_FORMAT_FRAME_BASED ? "Frame Based" : "MJPEG", format_idx, frame_num);
            uvc_dev->format_index = format_idx;
        } else if (usb_dev->uvc_cfg.format_index) {
            ESP_LOGW(TAG, "Setting format: %d NOT found", usb_dev->uvc_cfg.format);
            ESP_LOGW(TAG, "Try with user's config");
            uvc_dev->format_index = usb_dev->uvc_cfg.format_index;
        } else {
            ESP_LOGE(TAG, "Setting format: %d NOT found", usb_dev->uvc_cfg.format);
            // We treat MJPEG format as mandatory
            vs_intf_found = false;
        }
        if ((usb_dev->flags & FLAG_UVC_FORCE_STREAM_CONFIG) && usb_dev->uvc_cfg.frame_index) {
            ESP_LOGW(TAG, "Force UVC frame index = %u", usb_dev->uvc_cfg.frame_index);
            UVC_ENTER_CRITICAL();
            uvc_dev->frame_index = usb_dev->uvc_cfg.frame_index;
            uvc_dev->frame_height = usb_dev->uvc_cfg.frame_height;
            uvc_dev->frame_width = usb_dev->uvc_cfg.frame_width;
            UVC_EXIT_CRITICAL();
        } else if (user_frame_found) {
            UVC_ENTER_CRITICAL();
            uvc_dev->frame_index = user_frame_idx;
            UVC_EXIT_CRITICAL();
            ESP_LOGI(TAG, "Actual Frame: %d, width*height: %u*%u, frame index = %u", uvc_dev->frame_format, usb_dev->uvc_cfg.frame_width, usb_dev->uvc_cfg.frame_height, user_frame_idx);
        } else if (usb_dev->uvc_cfg.frame_index) {
            ESP_LOGW(TAG, "Frame: %d, width*height: %u*%u, NOT found", uvc_dev->frame_format, usb_dev->uvc_cfg.frame_width, usb_dev->uvc_cfg.frame_height);
            ESP_LOGW(TAG, "Try with user's config");
            UVC_ENTER_CRITICAL();
            uvc_dev->frame_index = usb_dev->uvc_cfg.frame_index;
            uvc_dev->frame_height = usb_dev->uvc_cfg.frame_height;
            uvc_dev->frame_width = usb_dev->uvc_cfg.frame_width;
            UVC_EXIT_CRITICAL();
        } else {
            // No suitable frame found, we need suspend UVC interface during start
            ESP_LOGW(TAG, "Frame: %d, width*height: %u*%u, NOT found", uvc_dev->frame_format, usb_dev->uvc_cfg.frame_width, usb_dev->uvc_cfg.frame_height);
            vs_intf_found = false;
        }
    }

    if (usb_dev->enabled[STREAM_UAC_MIC] || usb_dev->enabled[STREAM_UAC_SPK]) {
        if (ac_intf_found) {
            ESP_LOGI(TAG, "Audio control interface = %d", ac_intf_idx);
            if (as_spk_feature_unit_idx) {
                ESP_LOGI(TAG, "Speaker feature unit = %d", as_spk_feature_unit_idx);
            } else if (usb_dev->uac_cfg.spk_fu_id) {
                as_spk_feature_unit_idx = usb_dev->uac_cfg.spk_fu_id;
                ESP_LOGW(TAG, "Speaker feature unit NOT found, try with user's config");
            }
            if (as_spk_volume_ch != __UINT8_MAX__) {
                ESP_LOGI(TAG, "\tSupport volume control, ch = %d", as_spk_volume_ch);
            } else {
                as_spk_volume_ch = 0;
            }
            if (as_spk_mute_ch != __UINT8_MAX__) {
                ESP_LOGI(TAG, "\tSupport mute control, ch = %d", as_spk_mute_ch);
            } else {
                as_spk_mute_ch = 0;
            }
            if (as_mic_feature_unit_idx) {
                ESP_LOGI(TAG, "Mic feature unit = %d", as_mic_feature_unit_idx);
            } else if (usb_dev->uac_cfg.mic_fu_id) {
                as_mic_feature_unit_idx = usb_dev->uac_cfg.mic_fu_id;
                ESP_LOGW(TAG, "Mic feature unit NOT found, try with user's config");
            }
            if (as_mic_volume_ch != __UINT8_MAX__) {
                ESP_LOGI(TAG, "\tSupport volume control, ch = %d", as_mic_volume_ch);
            } else {
                as_mic_volume_ch = 0;
            }
            if (as_mic_mute_ch != __UINT8_MAX__) {
                ESP_LOGI(TAG, "\tSupport mute control, ch = %d", as_mic_mute_ch);
            } else {
                as_mic_mute_ch = 0;
            }
        } else if (usb_dev->uac_cfg.mic_fu_id || usb_dev->uac_cfg.spk_fu_id) {
            ac_intf_idx = usb_dev->uac_cfg.ac_interface;
            as_mic_feature_unit_idx = usb_dev->uac_cfg.mic_fu_id;
            as_spk_feature_unit_idx = usb_dev->uac_cfg.spk_fu_id;
            as_spk_volume_ch = 0;
            as_spk_mute_ch = 0;
            as_mic_volume_ch = 0;
            as_mic_mute_ch = 0;
            ESP_LOGW(TAG, "Audio control interface NOT found");
            ESP_LOGW(TAG, "Try with user's config");
        } else {
            ESP_LOGW(TAG, "Audio control interface NOT found");
        }
        UVC_ENTER_CRITICAL();
        uac_dev->ac_interface = ac_intf_idx;
        uac_dev->fu_id[UAC_SPK] = as_spk_feature_unit_idx;
        uac_dev->volume_ch[UAC_SPK] = as_spk_volume_ch;
        uac_dev->mute_ch[UAC_SPK] = as_spk_mute_ch;
        uac_dev->fu_id[UAC_MIC] = as_mic_feature_unit_idx;
        uac_dev->volume_ch[UAC_MIC] = as_mic_volume_ch;
        uac_dev->mute_ch[UAC_MIC] = as_mic_mute_ch;
        UVC_EXIT_CRITICAL();
    }

    if (usb_dev->enabled[STREAM_UAC_SPK] && as_spk_intf_found && uac_ver_found == UAC_VERSION_1 && !uac_format_others_found) {
        UVC_ENTER_CRITICAL();
        uac_dev->as_ifc[UAC_SPK]->interface = as_spk_intf_idx;
        uac_dev->as_ifc[UAC_SPK]->interface_alt = 1;
        uac_dev->as_ifc[UAC_SPK]->ep_addr = as_spk_intf_ep_addr;
        UVC_EXIT_CRITICAL();
        uac_dev->as_ifc[UAC_SPK]->ep_mps = as_spk_intf_ep_mps;
        ESP_LOGI(TAG, "Speaker Interface found, interface = %u", as_spk_intf_idx);
        ESP_LOGI(TAG, "\tEndpoint(%s) Addr = 0x%x, MPS = %u", (as_spk_intf_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_ISOC ? "ISOC"
                 : ((as_spk_intf_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_BULK ? "BULK" : "Unknown"), as_spk_intf_ep_addr, as_spk_intf_ep_mps);
        if (!as_spk_ch_num_found) {
            ESP_LOGW(TAG, "\tSpeaker channel num %d Not supported", usb_dev->uac_cfg.spk_ch_num);
        }
        if (!as_spk_bit_res_found) {
            ESP_LOGW(TAG, "\tSpeaker bit resolution %d Not supported", usb_dev->uac_cfg.spk_bit_resolution);
        }
        if (!as_spk_freq_found) {
            ESP_LOGW(TAG, "\tSpeaker frequency %"PRIu32" Not supported", usb_dev->uac_cfg.spk_samples_frequence);
        } else  {
            uac_dev->freq_ctrl_support[UAC_SPK] = as_spk_freq_ctrl_found;
            ESP_LOGI(TAG, "\tSpeaker frequency control %s Support", as_spk_freq_ctrl_found ? "" : "Not");
        }
    } else if (usb_dev->enabled[STREAM_UAC_SPK] && usb_dev->uac_cfg.spk_interface) {
        UVC_ENTER_CRITICAL();
        uac_dev->as_ifc[UAC_SPK]->interface = usb_dev->uac_cfg.spk_interface;
        uac_dev->as_ifc[UAC_SPK]->interface_alt = 1;
        uac_dev->as_ifc[UAC_SPK]->ep_addr = usb_dev->uac_cfg.spk_ep_addr;
        UVC_EXIT_CRITICAL();
        uac_dev->as_ifc[UAC_SPK]->ep_mps = usb_dev->uac_cfg.spk_ep_mps;
        ESP_LOGW(TAG, "Speaker Interface NOT found");
        ESP_LOGW(TAG, "Try with user's config");
        as_spk_intf_found = true;
    } else {
        as_spk_intf_found = false;
    }

    if (usb_dev->enabled[STREAM_UAC_MIC] && as_mic_intf_found && uac_ver_found == UAC_VERSION_1 && !uac_format_others_found) {
        UVC_ENTER_CRITICAL();
        uac_dev->as_ifc[UAC_MIC]->interface = as_mic_intf_idx;
        uac_dev->as_ifc[UAC_MIC]->interface_alt = 1;
        uac_dev->as_ifc[UAC_MIC]->ep_addr = as_mic_intf_ep_addr;
        UVC_EXIT_CRITICAL();
        uac_dev->as_ifc[UAC_MIC]->ep_mps = as_mic_intf_ep_mps;
        ESP_LOGI(TAG, "Mic Interface found interface = %u", as_mic_intf_idx);
        ESP_LOGI(TAG, "\tEndpoint(%s) Addr = 0x%x, MPS = %u", (as_mic_intf_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_ISOC ? "ISOC"
                 : ((as_mic_intf_ep_attr & USB_BM_ATTRIBUTES_XFERTYPE_MASK) == USB_BM_ATTRIBUTES_XFER_BULK ? "BULK" : "Unknown"), as_mic_intf_ep_addr, as_mic_intf_ep_mps);
        if (!as_mic_ch_num_found) {
            ESP_LOGW(TAG, "\tMic channel num %d Not supported", usb_dev->uac_cfg.mic_ch_num);
        }
        if (!as_mic_bit_res_found) {
            ESP_LOGW(TAG, "\tMic bit resolution %d Not supported", usb_dev->uac_cfg.mic_bit_resolution);
        }
        if (!as_mic_freq_found) {
            ESP_LOGW(TAG, "\tMic frequency %"PRIu32" Not supported", usb_dev->uac_cfg.mic_samples_frequence);
        } else {
            uac_dev->freq_ctrl_support[UAC_MIC] = as_mic_freq_ctrl_found;
            ESP_LOGI(TAG, "\tMic frequency control %s Support", as_mic_freq_ctrl_found ? "" : "Not");
        }
    } else if (usb_dev->enabled[STREAM_UAC_MIC] && usb_dev->uac_cfg.mic_interface) {
        UVC_ENTER_CRITICAL();
        uac_dev->as_ifc[UAC_MIC]->interface = usb_dev->uac_cfg.mic_interface;
        uac_dev->as_ifc[UAC_MIC]->interface_alt = 1;
        uac_dev->as_ifc[UAC_MIC]->ep_addr = usb_dev->uac_cfg.mic_ep_addr;
        UVC_EXIT_CRITICAL();
        uac_dev->as_ifc[UAC_MIC]->ep_mps = usb_dev->uac_cfg.mic_ep_mps;
        ESP_LOGW(TAG, "Mic interface NOT found");
        ESP_LOGW(TAG, "Try with user's config");
        as_mic_intf_found = true;
    } else {
        as_mic_intf_found = false;
    }

