madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
    if (usb_dev->enabled[STREAM_UAC_MIC]) {
        uac_dev->as_ifc[UAC_MIC]->not_found = !as_mic_intf_found;
    }
    if (usb_dev->enabled[STREAM_UAC_SPK]) {
        uac_dev->as_ifc[UAC_SPK]->not_found = !as_spk_intf_found;
    }
    if (usb_dev->enabled[STREAM_UVC]) {
        uvc_dev->vs_ifc->not_found = !vs_intf_found;
    }

    if (!(as_mic_intf_found || as_spk_intf_found || vs_intf_found)) {
        return ESP_ERR_NOT_FOUND;
    }
    return ESP_OK;
}

static esp_err_t _usb_ctrl_xfer(urb_t *urb, TickType_t xTicksToWait)
{
    UVC_CHECK(_usb_device_get_state() > STATE_DEVICE_INSTALLED, "USB Device not active", ESP_ERR_INVALID_STATE);
    UVC_CHECK(_usb_device_get_state() != STATE_DEVICE_RECOVER, "USB Device not active", ESP_ERR_INVALID_STATE);
    UVC_CHECK(urb != NULL, "invalid args", ESP_ERR_INVALID_ARG);
    // Dequeue the previous timeout urb
    ESP_LOGD(TAG, "Control Transfer Start");
    hcd_urb_dequeue(s_usb_dev.dflt_pipe_hdl);
    xEventGroupClearBits(s_usb_dev.event_group_hdl, USB_CTRL_PROC_SUCCEED | USB_CTRL_PROC_FAILED);
    SYSVIEW_DFLT_PIPE_XFER_START();
    esp_err_t ret = hcd_urb_enqueue(s_usb_dev.dflt_pipe_hdl, urb);
    UVC_CHECK(ESP_OK == ret, "urb enqueue failed", ESP_FAIL);
    EventBits_t uxBits = xEventGroupWaitBits(s_usb_dev.event_group_hdl, USB_CTRL_PROC_SUCCEED | USB_CTRL_PROC_FAILED, pdTRUE, pdFALSE, xTicksToWait);
    SYSVIEW_DFLT_PIPE_XFER_STOP();
    if (uxBits & USB_CTRL_PROC_SUCCEED) {
        // If not failed, handle the result of the transfer.
        ESP_LOGD(TAG, "Control Transfer Done");
    } else if (uxBits & USB_CTRL_PROC_FAILED) {
        // If failed, the internal error handler will handle the urb.
        ESP_LOGE(TAG, "Control Transfer Failed");
        return ESP_FAIL;
    } else {
        // If timeout, dequeue the urb before next transfer.
        ESP_LOGE(TAG, "Control Transfer Timeout");
        // Notify the usb task to halt the transfer.
        _event_msg_t evt_msg = {
            ._type = USER_EVENT,
            ._event.user_cmd = PIPE_RECOVER
        };
        xQueueSend(s_usb_dev.queue_hdl, &evt_msg, xTicksToWait);
        // wait for recover done
        vTaskDelay(pdMS_TO_TICKS(50));
        ESP_LOGD(TAG, "Control Transfer Recover");
        return ESP_ERR_TIMEOUT;
    }
    urb_t *urb_done = hcd_urb_dequeue(s_usb_dev.dflt_pipe_hdl);
    UVC_CHECK(urb_done == urb, "urb status: not same", ESP_FAIL);
    UVC_CHECK(USB_TRANSFER_STATUS_COMPLETED == urb_done->transfer.status, "urb status: not complete", ESP_FAIL);
    return ESP_OK;
}

static esp_err_t _usb_set_device_interface(uint16_t interface, uint16_t interface_alt)
{
    UVC_CHECK(interface != 0, "interface can't be 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    urb_t *urb_ctrl = s_usb_dev.ctrl_urb;
    bool need_free = false;

    if (urb_ctrl == NULL) {
        urb_ctrl = _usb_urb_alloc(0, sizeof(usb_setup_packet_t), NULL);
        UVC_CHECK(urb_ctrl != NULL, "alloc urb failed", ESP_ERR_NO_MEM);
        need_free = true;
    }
    xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
    USB_SETUP_PACKET_INIT_SET_INTERFACE((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer, interface, interface_alt);
    urb_ctrl->transfer.num_bytes = sizeof(usb_setup_packet_t);
    ESP_LOGI(TAG, "Set Device Interface = %u, Alt = %u", interface, interface_alt);
    esp_err_t ret = _usb_ctrl_xfer(urb_ctrl, pdMS_TO_TICKS(TIMEOUT_USB_CTRL_XFER_MS));
    xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
    if (ESP_OK == ret) {
        ESP_LOGD(TAG, "Set Device Interface Done");
    } else {
        ESP_LOGE(TAG, "Set Device Interface Failed");
    }

    if (need_free) {
        _usb_urb_free(urb_ctrl);
    }
    return ret;
}

static esp_err_t _uvc_vs_commit_control(uvc_stream_ctrl_t *ctrl_set, uvc_stream_ctrl_t *ctrl_probed)
{
    UVC_CHECK(ctrl_set != NULL && ctrl_probed != NULL, "pointer can not be NULL", ESP_ERR_INVALID_ARG);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    urb_t *urb_ctrl = s_usb_dev.ctrl_urb;
    bool need_free = false;
    if (urb_ctrl == NULL) {
        urb_ctrl = _usb_urb_alloc(0, sizeof(usb_setup_packet_t) + 128, NULL);
        UVC_CHECK(urb_ctrl != NULL, "alloc urb failed", ESP_ERR_NO_MEM);
        need_free = true;
    }
    const uint16_t uvc_vs_interface = s_usb_dev.uvc && s_usb_dev.uvc->vs_ifc
                                      ? s_usb_dev.uvc->vs_ifc->interface
                                      : 1;
    ESP_LOGD(TAG, "UVC control wIndex interface=%u", uvc_vs_interface);
    const bool print_uvc_diagnostics = s_usb_dev.flags & FLAG_UVC_PACKET_STATS;
    if (print_uvc_diagnostics) {
        _uvc_stream_ctrl_print_summary("probe-set", ctrl_set);
    }

    ESP_LOGD(TAG, "SET_CUR Probe");
    xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
    USB_CTRL_UVC_PROBE_SET_REQ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer, uvc_vs_interface);
    _uvc_stream_ctrl_to_buf((urb_ctrl->transfer.data_buffer + sizeof(usb_setup_packet_t)), ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength, ctrl_set);
    urb_ctrl->transfer.num_bytes = sizeof(usb_setup_packet_t) + ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength;
    esp_err_t ret = _usb_ctrl_xfer(urb_ctrl, pdMS_TO_TICKS(TIMEOUT_USB_CTRL_XFER_MS));
    xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
    UVC_CHECK_GOTO(ESP_OK == ret, "SET_CUR Probe failed", free_urb_);
    ESP_LOGD(TAG, "SET_CUR Probe Done");

    ESP_LOGD(TAG, "GET_CUR Probe");
    xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
    USB_CTRL_UVC_PROBE_GET_REQ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer, uvc_vs_interface);
    urb_ctrl->transfer.num_bytes = sizeof(usb_setup_packet_t) + usb_round_up_to_mps(((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength, s_usb_dev.ep_mps); //IN should be integer multiple of MPS
    ret = _usb_ctrl_xfer(urb_ctrl, pdMS_TO_TICKS(TIMEOUT_USB_CTRL_XFER_MS));
    xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
    UVC_CHECK_GOTO(ESP_OK == ret, "GET_CUR Probe failed", free_urb_);
    if ((urb_ctrl->transfer.actual_num_bytes > sizeof(usb_setup_packet_t) + ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength)) {
        ESP_LOGW(TAG, "Probe data overflow");
    }
    _buf_to_uvc_stream_ctrl((urb_ctrl->transfer.data_buffer + sizeof(usb_setup_packet_t)), ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength, ctrl_probed);
    if (ctrl_probed->dwMaxPayloadTransferSize > ctrl_set->dwMaxPayloadTransferSize) {
        ESP_LOGW(TAG, "Clamp probed payload %"PRIu32" to endpoint payload %"PRIu32,
                 ctrl_probed->dwMaxPayloadTransferSize,
                 ctrl_set->dwMaxPayloadTransferSize);
        ctrl_probed->dwMaxPayloadTransferSize = ctrl_set->dwMaxPayloadTransferSize;
    }
    if (print_uvc_diagnostics) {
        _uvc_stream_ctrl_print_summary("probe-get", ctrl_probed);
    }
    ESP_LOGD(TAG, "GET_CUR Probe Done, actual_num_bytes:%d", urb_ctrl->transfer.actual_num_bytes);
#ifdef CONFIG_UVC_PRINT_PROBE_RESULT
    _uvc_stream_ctrl_printf(stdout, ctrl_probed);
#endif

    ESP_LOGD(TAG, "SET_CUR Commit");
    if (print_uvc_diagnostics) {
        _uvc_stream_ctrl_print_summary("commit-set", ctrl_probed);
    }
    xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
    USB_CTRL_UVC_COMMIT_REQ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer, uvc_vs_interface);
    _uvc_stream_ctrl_to_buf((urb_ctrl->transfer.data_buffer + sizeof(usb_setup_packet_t)), ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength, ctrl_probed);
    urb_ctrl->transfer.num_bytes = sizeof(usb_setup_packet_t) + ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength;
    ret = _usb_ctrl_xfer(urb_ctrl, pdMS_TO_TICKS(TIMEOUT_USB_CTRL_XFER_MS));
    xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
    UVC_CHECK_GOTO(ESP_OK == ret, "SET_CUR Commit failed", free_urb_);
    ESP_LOGD(TAG, "SET_CUR Commit Done");

free_urb_:
    if (need_free) {
        _usb_urb_free(urb_ctrl);
    }
    return ret;
}

static esp_err_t _uac_as_control_set_mute(uint16_t ac_itc, uint8_t ch, uint8_t fu_id, bool if_mute)
{
    UVC_CHECK(fu_id != 0, "invalid fu_id", ESP_ERR_INVALID_ARG);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    //check if enum done
    urb_t *urb_ctrl = s_usb_dev.ctrl_urb;
    bool need_free = false;
    if (urb_ctrl == NULL) {
        urb_ctrl = _usb_urb_alloc(0, sizeof(usb_setup_packet_t) + 64, NULL);
        UVC_CHECK(urb_ctrl != NULL, "alloc urb failed", ESP_ERR_NO_MEM);
        need_free = true;
    }
    esp_err_t ret = ESP_OK;
    for (size_t i = 0; i < 8; i++) {
        if (ch & (1 << i)) {
            ESP_LOGD(TAG, "SET_CUR mute, ac_itc = %u, ch = %u, fu_id = %u", ac_itc, i, fu_id);
            ESP_LOGD(TAG, "%s CH%u", if_mute ? "Mute" : "UnMute", i);
            xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
            USB_CTRL_UAC_SET_FU_MUTE((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer, i, fu_id, ac_itc);
            unsigned char *p_data = urb_ctrl->transfer.data_buffer + sizeof(usb_setup_packet_t);
            p_data[0] = if_mute;
            urb_ctrl->transfer.num_bytes = sizeof(usb_setup_packet_t) + ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength;
            ret = _usb_ctrl_xfer(urb_ctrl, pdMS_TO_TICKS(TIMEOUT_USB_CTRL_XFER_MS));
            xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
            UVC_CHECK_GOTO(ESP_OK == ret, "SET_CUR mute failed", free_urb_);
            ESP_LOGD(TAG, "SET_CUR mute Done");
        }
    }

free_urb_:
    if (need_free) {
        _usb_urb_free(urb_ctrl);
    }
    return ret;
}

static esp_err_t _uac_as_control_set_volume(uint16_t ac_itc, uint8_t ch, uint8_t fu_id, uint32_t volume)
{
    UVC_CHECK(fu_id != 0, "invalid fu_id", ESP_ERR_INVALID_ARG);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    urb_t *urb_ctrl = s_usb_dev.ctrl_urb;
    bool need_free = false;
    if (urb_ctrl == NULL) {
        urb_ctrl = _usb_urb_alloc(0, sizeof(usb_setup_packet_t) + 64, NULL);
        UVC_CHECK(urb_ctrl != NULL, "alloc urb failed", ESP_ERR_NO_MEM);
        need_free = true;
    }
    uint32_t volume_db = UAC_SPK_VOLUME_MIN + volume * UAC_SPK_VOLUME_STEP;
    esp_err_t ret = ESP_OK;
    for (size_t i = 0; i < 8; i++) {
        if (ch & (1 << i)) {
            ESP_LOGD(TAG, "SET_CUR volume 0x%04x (%"PRIu32") ac_itc=%u, ch=%u, fu_id=%u", (uint16_t)(volume_db & 0xffff), volume, ac_itc, i, fu_id);
            ESP_LOGD(TAG, "Set volume CH%u: 0x%04xdb (%"PRIu32")", i, (uint16_t)(volume_db & 0xffff), volume);
            xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
            USB_CTRL_UAC_SET_FU_VOLUME((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer, i, fu_id, ac_itc);
            unsigned char *p_data = urb_ctrl->transfer.data_buffer + sizeof(usb_setup_packet_t);
            urb_ctrl->transfer.num_bytes = sizeof(usb_setup_packet_t) + ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength;
            p_data[0] = volume_db & 0x00ff;
            p_data[1] = (volume_db & 0xff00) >> 8;
            ret = _usb_ctrl_xfer(urb_ctrl, pdMS_TO_TICKS(TIMEOUT_USB_CTRL_XFER_MS));
            xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
            UVC_CHECK_GOTO(ESP_OK == ret, "SET_CUR volume failed", free_urb_);
            ESP_LOGD(TAG, "SET_CUR volume Done");
        }
    }

free_urb_:
    if (need_free) {
        _usb_urb_free(urb_ctrl);
    }
    return ret;
}

static esp_err_t _uac_as_control_set_freq(uint8_t ep_addr, uint32_t freq)
{
    UVC_CHECK(ep_addr != 0, "invalid ep_addr", ESP_ERR_INVALID_ARG);
    UVC_CHECK(freq != 0, "invalid freq", ESP_ERR_INVALID_ARG)
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    if (ep_addr & USB_EP_DIR_MASK) {
        UVC_CHECK(s_usb_dev.uac->freq_ctrl_support[UAC_MIC], "Mic frequency control not support", ESP_ERR_NOT_SUPPORTED);
    } else {
        UVC_CHECK(s_usb_dev.uac->freq_ctrl_support[UAC_SPK], "Speaker frequency control not support", ESP_ERR_NOT_SUPPORTED);
    }

    urb_t *urb_ctrl = s_usb_dev.ctrl_urb;
    bool need_free = false;
    if (urb_ctrl == NULL) {
        urb_ctrl = _usb_urb_alloc(0, sizeof(usb_setup_packet_t) + 64, NULL);
        UVC_CHECK(urb_ctrl != NULL, "alloc urb failed", ESP_ERR_NO_MEM);
        need_free = true;
    }
    ESP_LOGI(TAG, "Set frequency endpoint 0x%02x: (%"PRIu32") Hz", ep_addr, freq);
    ESP_LOGD(TAG, "SET_CUR frequency %"PRIu32"", freq);
    xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
    USB_CTRL_UAC_SET_EP_FREQ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer, ep_addr);
    unsigned char *p_data = urb_ctrl->transfer.data_buffer + sizeof(usb_setup_packet_t);
    urb_ctrl->transfer.num_bytes = sizeof(usb_setup_packet_t) + ((usb_setup_packet_t *)urb_ctrl->transfer.data_buffer)->wLength;
    p_data[0] = freq & 0x0000ff;
    p_data[1] = (freq & 0x00ff00) >> 8;
    p_data[2] = (freq & 0xff0000) >> 16;
    esp_err_t ret = _usb_ctrl_xfer(urb_ctrl, pdMS_TO_TICKS(TIMEOUT_USB_CTRL_XFER_MS));
    xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
    UVC_CHECK_GOTO(ESP_OK == ret, "SET_CUR frequency failed", free_urb_);
    ESP_LOGD(TAG, "SET_CUR frequency Done");

free_urb_:
    if (need_free) {
        _usb_urb_free(urb_ctrl);
    }
    return ret;
}

/***************************************************LibUVC API Implements****************************************/
/**
 * @brief Swap the working buffer with the presented buffer and notify consumers
 */
IRAM_ATTR static void _uvc_swap_buffers(_uvc_stream_handle_t *strmh)
{
    /* to prevent the latest data from being lost
    * if take mutex timeout, we should drop the last frame */
    size_t timeout_ms = 0;
    if (s_usb_dev.uvc->vs_ifc->xfer_type == UVC_XFER_BULK) {
        // for full speed bulk mode, max 19 packet can be transmit during each millisecond
        timeout_ms = (s_usb_dev.uvc->vs_ifc->urb_num - 1) * (s_usb_dev.uvc->vs_ifc->bytes_per_packet * 0.052 / USB_EP_BULK_FS_MPS);
    } else {
        timeout_ms = (s_usb_dev.uvc->vs_ifc->urb_num - 1) * s_usb_dev.uvc->vs_ifc->packets_per_urb;
    }
    size_t timeout_tick = pdMS_TO_TICKS(timeout_ms);
    if (timeout_tick == 0) {
        timeout_tick = 1;
    }
    if (xSemaphoreTake(strmh->cb_mutex, timeout_tick) == pdTRUE) {
        /* code */
        /* swap the buffers */
        uint8_t *tmp_buf = strmh->holdbuf;
        strmh->hold_bytes = strmh->got_bytes;
        strmh->holdbuf = strmh->outbuf;
        strmh->outbuf = tmp_buf;
        strmh->hold_last_scr = strmh->last_scr;
        strmh->hold_pts = strmh->pts;
        strmh->hold_seq = strmh->seq;
        ESP_LOGV(TAG, "uvc swap buffer length = %d", strmh->hold_bytes);
        xTaskNotifyGive(strmh->taskh);
        xSemaphoreGive(strmh->cb_mutex);
    } else {
        ESP_LOGD(TAG, "timeout drop frame = %"PRIu32"", strmh->seq);
    }

    strmh->seq++;
    strmh->got_bytes = 0;
    strmh->last_scr = 0;
    strmh->pts = 0;
}

/**
 * @brief Clean buffer without swap
 */
IRAM_ATTR static void _uvc_drop_buffers(_uvc_stream_handle_t *strmh)
{
    strmh->got_bytes = 0;
    strmh->last_scr = 0;
    strmh->pts = 0;
}

/**
 * @brief Populate the fields of a frame to be handed to user code
 * must be called with stream cb lock held!
 */
void _uvc_populate_frame(_uvc_stream_handle_t *strmh)
{
    if (strmh->hold_bytes > s_usb_dev.uvc_cfg.frame_buffer_size) {
        ESP_LOGW(TAG, "Frame Buffer Overflow, framesize = %u", strmh->hold_bytes);
        return;
    }

    uvc_frame_t *frame = &strmh->frame;
    frame->frame_format = strmh->frame_format;
    frame->width = s_usb_dev.uvc->frame_width;
    frame->height = s_usb_dev.uvc->frame_height;

    frame->step = 0;
    frame->sequence = strmh->hold_seq;
    frame->capture_time_finished = strmh->capture_time_finished;
    frame->data_bytes = strmh->hold_bytes;
    memcpy(frame->data, strmh->holdbuf, frame->data_bytes);
}

/**
 * @brief Process each payload of uvc transfer
 *
 * @param strmh stream handle
 * @param payload payload buffer
 * @param payload_len payload buffer length
 */
IRAM_ATTR static void _uvc_process_payload(_uvc_stream_handle_t *strmh, size_t req_len, uint8_t *payload, size_t payload_len)
{
    size_t header_len = 0;
    size_t variable_offset = 0;
    uint8_t header_info = 0;
    size_t data_len = 0;
    bool bulk_xfer = (s_usb_dev.uvc->vs_ifc->xfer_type == UVC_XFER_BULK) ? true : false;
    bool reassemble = (strmh->reassemble_flag) ? true : false;
    uint8_t flag_lstp = 0;
    uint8_t flag_zlp = 0;
    uint8_t flag_rsb = 0;

    // analyze the payload handling logic depending on the transfer type
    // and the reassembly flag
    if (bulk_xfer && reassemble) {
        if (payload_len == req_len) {
            //payload transfer not complete
            flag_rsb = 1;
        } else if (payload_len == 0) {
            //payload transfer complete with zero length packet
            flag_zlp = 1;
            ESP_LOGV(TAG, "payload_len == 0");
        } else {
            //payload transfer complete with short packet
            flag_lstp = 1;
        }
    } else if (bulk_xfer && payload_len < req_len) {
        flag_lstp = 1;
    } else if (payload_len == 0) {
        // ignore empty payload for isoc transfer
        return;
    }

