madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
#ifdef CONFIG_UVC_PRINT_PAYLOAD_HEX
    ESP_LOG_BUFFER_HEXDUMP("UVC_HEX", payload, payload_len, ESP_LOG_VERBOSE);
#endif
    /********************* processing header *******************/
    if (!flag_zlp) {
        ESP_LOGV(TAG, "zlp=%d, lstp=%d, req_len=%d, payload_len=%d, first=0x%02x, second=0x%02x", flag_zlp, flag_lstp, req_len, payload_len, payload[0], payload_len > 1 ? payload[1] : 0);
        // make sure this is a header, judge from header length and bit field
        // For SCR, PTS, some vendors not set bit, but also offer 12 Bytes header. so we just check SET condition
        if (payload_len >= payload[0]
                && (payload[0] == 12 || (payload[0] == 2 && !(payload[1] & 0x0C)) || (payload[0] == 6 && !(payload[1] & 0x08)))
                && !(payload[1] & 0x30)
#ifdef CONFIG_UVC_CHECK_HEADER_EOH
                /* EOH bit, when set, indicates the end of the BFH fields
                 * Most camera set this bit to 1 in each header, but some vendors may not set it.
                 */
                && (payload[1] & 0x80)
#endif
#ifdef CONFIG_UVC_CHECK_BULK_JPEG_HEADER
                && (!reassemble || ((payload[payload[0]] == 0xff) && (payload[payload[0] + 1] == 0xd8)))
#endif
           ) {
            header_len = payload[0];
            data_len = payload_len - header_len;
            /* checking the end-of-header */
            variable_offset = 2;
            header_info = payload[1];

            ESP_LOGV(TAG, "header=%u info=0x%02x, payload_len = %u, last_pts = %"PRIu32" , last_scr = %"PRIu32"", header_len, header_info, payload_len, strmh->pts, strmh->last_scr);
            if (flag_rsb) {
                ESP_LOGV(TAG, "reassembling start ...");
                strmh->reassembling = 1;
            }
            /* ERR bit defined in Stream Header*/
            if (header_info & 0x40) {
                ESP_LOGW(TAG, "bad packet: error bit set");
                strmh->reassembling = 0;
                return;
            }
        } else if (strmh->reassembling) {
            ESP_LOGV(TAG, "reassembling %u + %u", strmh->got_bytes, payload_len);
            data_len = payload_len;
        } else {
            if (payload_len > 1) {
#ifdef CONFIG_UVC_CHECK_HEADER_EOH
                /* Give warning if EOH check enable, but camera not have*/
                if (!(payload[1] & 0x80)) {
                    ESP_LOGD(TAG, "bogus packet: EOH bit not set");
                }
#endif
                ESP_LOGD(TAG, "bogus packet: len = %u %02x %02x...%02x %02x\n", payload_len, payload[0], payload[1], payload[payload_len - 2], payload[payload_len - 1]);
            }
            return;
        }
    }

    if (header_len >= 2) {
        if (strmh->fid != (header_info & 1) && strmh->got_bytes != 0) {
            /* The frame ID bit was flipped, but we have image data sitting
                around from prior transfers. This means the camera didn't send
                an EOF for the last transfer of the previous frame. */
#if CONFIG_UVC_DROP_NO_EOF_FRAME
            ESP_LOGW(TAG, "DROP NO EOF, got data=%u B", strmh->got_bytes);
            _uvc_drop_buffers(strmh);
#else
            ESP_LOGD(TAG, "SWAP NO EOF %d", strmh->got_bytes);
            _uvc_swap_buffers(strmh);
#endif
        }

        strmh->fid = header_info & 1;
        if (header_info & (1 << 2)) {
            strmh->pts = DW_TO_INT(payload + variable_offset);
            variable_offset += 4;
        }

        if (header_info & (1 << 3)) {
            strmh->last_scr = DW_TO_INT(payload + variable_offset);
            variable_offset += 6;
        }
    }

    /********************* processing data *****************/
    if (data_len >= 1) {
        if (strmh->got_bytes + data_len > s_usb_dev.uvc_cfg.xfer_buffer_size) {
            /* This means transfer buffer Not enough for whole frame, just drop whole buffer here.
            Please increase buffer size to handle big frame*/
#if CONFIG_UVC_DROP_OVERFLOW_FRAME
            ESP_LOGW(TAG, "Transfer buffer overflow, got data=%u B, last=%u (%02x %02x...%02x %02x)", strmh->got_bytes + data_len, data_len
                     , payload[0], payload_len > 1 ? payload[1] : 0, payload_len > 1 ? payload[payload_len - 2] : 0, payload_len > 1 ? payload[payload_len - 1] : 0);
            _uvc_drop_buffers(strmh);
#else
            ESP_LOGD(TAG, "SWAP overflow %d", strmh->got_bytes);
            _uvc_swap_buffers(strmh);
#endif
            strmh->reassembling = 0;
            return;
        } else {
            if (payload_len > 1) {
                ESP_LOGV(TAG, "uvc payload = %02x %02x...%02x %02x\n", payload[header_len], payload[header_len + 1], payload[payload_len - 2], payload[payload_len - 1]);
            }
            memcpy(strmh->outbuf + strmh->got_bytes, payload + header_len, data_len);
        }

        strmh->got_bytes += data_len;
    }

    if (flag_lstp || flag_zlp) {
        strmh->reassembling = 0;
    }

    if (header_info & (1 << 1)) {
        /* The EOF bit is set, so publish the complete frame */
        if (strmh->got_bytes != 0) {
            _uvc_swap_buffers(strmh);
        }
        strmh->reassembling = 0;
    }
}

/**
 * @brief open a video stream (only one can be created)
 *
 * @param devh device handle
 * @param strmhp return stream handle if succeed
 * @param config ctrl configs
 * @return uvc_error_t
 */
static uvc_error_t uvc_stream_open_ctrl(uvc_device_handle_t *devh, _uvc_stream_handle_t **strmhp, uvc_stream_ctrl_t *ctrl)
{
    _uvc_stream_handle_t *strmh = NULL;
    uvc_error_t ret;
    strmh = heap_caps_calloc(1, sizeof(_uvc_stream_handle_t), MALLOC_CAP_INTERNAL);

    if (!strmh) {
        ret = UVC_ERROR_NO_MEM;
        goto fail_;
    }

    strmh->devh = devh;
    strmh->frame.library_owns_data = 1;
    strmh->cur_ctrl = *ctrl;
    strmh->running = 0;
    strmh->outbuf = s_usb_dev.uvc_cfg.xfer_buffer_a;
    strmh->holdbuf = s_usb_dev.uvc_cfg.xfer_buffer_b;
    strmh->frame.data = s_usb_dev.uvc_cfg.frame_buffer;
    strmh->frame_format = s_usb_dev.uvc->frame_format;

