madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
    if (enqueue_flag) {
        esp_err_t ret = hcd_urb_enqueue(pipe_hdl, urb_done);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "MIC urb enqueue failed %s", esp_err_to_name(ret));
        }
    }
}

IRAM_ATTR static void _processing_spk_pipe(hcd_pipe_handle_t pipe_hdl, bool if_dequeue, bool reset)
{
    static size_t pending_urb_num = 0;
    static size_t zero_counter = 0;
    static urb_t *pending_urb[NUM_ISOC_SPK_URBS] = {NULL};
    esp_err_t ret = ESP_FAIL;

    if (reset) {
        pending_urb_num = 0;
        zero_counter = 0;
        for (size_t j = 0; j < NUM_ISOC_SPK_URBS; j++) {
            pending_urb[j] = NULL;
        }
        ESP_LOGD(TAG, "spk processing reset");
        return;
    }

    if (pipe_hdl == NULL) {
        return;
    }

    if (!pending_urb_num && !if_dequeue) {
        return;
    }

    if (if_dequeue) {
        size_t xfered_size = 0;
        urb_t *urb_done = hcd_urb_dequeue(pipe_hdl);
        if (urb_done == NULL) {
            ESP_LOGD(TAG, "spk urb dequeue error");
            return;
        }
        for (size_t i = 0; i < urb_done->transfer.num_isoc_packets; i++) {
            if (urb_done->transfer.isoc_packet_desc[i].status != USB_TRANSFER_STATUS_COMPLETED) {
                ESP_LOGW(TAG, "line:%u bad iso transit status %d", __LINE__, urb_done->transfer.isoc_packet_desc[i].status);
                break;
            } else {
                xfered_size += urb_done->transfer.isoc_packet_desc[i].actual_num_bytes;
            }
        }
        ESP_LOGV(TAG, "SPK ST actual = %d", xfered_size);
        /* add done urb to pending urb list */
        for (size_t i = 0; i < NUM_ISOC_SPK_URBS; i++) {
            if (pending_urb[i] == NULL) {
                pending_urb[i] = urb_done;
                ++pending_urb_num;
                assert(pending_urb_num <= NUM_ISOC_SPK_URBS); //should never happened
                break;
            }
        }
    }
    /* check if we have buffered data need to send */
    if (_ring_buffer_get_len(s_usb_dev.uac->ringbuf_hdl[UAC_SPK]) < s_usb_dev.uac->as_ifc[UAC_SPK]->bytes_per_packet) {
#if (!UAC_SPK_PACKET_COMPENSATION)
        /* if speaker packet compensation not enable, just return here */
        return;
#endif
    } else {
        zero_counter = 0;
    }

    /* fetch a pending urb from list */
    urb_t *next_urb = NULL;
    size_t next_index = 0;
    for (; next_index < NUM_ISOC_SPK_URBS; next_index++) {
        if (pending_urb[next_index] != NULL) {
            next_urb = pending_urb[next_index];
            break;
        }
    }
    UVC_CHECK_RETURN_VOID(next_urb != NULL, "free urb not found");

    size_t num_bytes_to_send = 0;
    size_t buffer_size = s_usb_dev.uac->spk_max_xfer_size;
    uint8_t *buffer = next_urb->transfer.data_buffer;
    ret = _ring_buffer_pop(s_usb_dev.uac->ringbuf_hdl[UAC_SPK], buffer, buffer_size, &num_bytes_to_send, 0);
    if (ret != ESP_OK || num_bytes_to_send == 0) {
#if (!UAC_SPK_PACKET_COMPENSATION)
        //should never happened
        return;
#else
        if (pending_urb_num == NUM_ISOC_SPK_URBS) {
            if (++zero_counter == (UAC_SPK_PACKET_COMPENSATION_TIMEOUT_MS / portTICK_PERIOD_MS)) {
                /* if speaker packets compensation enable, we padding 0 to speaker */
                num_bytes_to_send = s_usb_dev.uac->as_ifc[UAC_SPK]->bytes_per_packet * (UAC_SPK_PACKET_COMPENSATION_SIZE_MS > UAC_SPK_ST_MAX_MS_DEFAULT ? UAC_SPK_ST_MAX_MS_DEFAULT : UAC_SPK_PACKET_COMPENSATION_SIZE_MS);
                memset(buffer, 0, num_bytes_to_send);
#if UAC_SPK_PACKET_COMPENSATION_CONTINUOUS
                zero_counter = 0;
#endif
                ESP_LOGV(TAG, "SPK: padding 0 length = %d", num_bytes_to_send);
            }
        }
#endif
    }

    if (num_bytes_to_send == 0) {
        return;
    }

    // may drop some data here?
    //size_t num_bytes_send = num_bytes_to_send - num_bytes_to_send % s_usb_dev.uac->as_ifc[UAC_SPK]->bytes_per_packet;
    size_t num_bytes_send = num_bytes_to_send;
    size_t last_packet_bytes = num_bytes_send % s_usb_dev.uac->as_ifc[UAC_SPK]->bytes_per_packet;
    next_urb->transfer.num_bytes = num_bytes_send;
    usb_transfer_dummy_t *transfer_dummy = (usb_transfer_dummy_t *)&next_urb->transfer;
    transfer_dummy->num_isoc_packets = num_bytes_send / s_usb_dev.uac->as_ifc[UAC_SPK]->bytes_per_packet + (last_packet_bytes ? 1 : 0);
    for (size_t j = 0; j < transfer_dummy->num_isoc_packets; j++) {
        //We need to initialize each individual isoc packet descriptor of the URB
        next_urb->transfer.isoc_packet_desc[j].num_bytes = s_usb_dev.uac->as_ifc[UAC_SPK]->bytes_per_packet;
    }
    if (last_packet_bytes) {
        next_urb->transfer.isoc_packet_desc[transfer_dummy->num_isoc_packets - 1].num_bytes = last_packet_bytes;
    }

    ret = hcd_urb_enqueue(pipe_hdl, next_urb);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SPK urb enqueue failed %s", esp_err_to_name(ret));
        return;
    }

    pending_urb[next_index] = NULL;
    --pending_urb_num;
    assert(pending_urb_num <= NUM_ISOC_SPK_URBS); //should never happened
    ESP_LOGV(TAG, "SPK ST %d/%d", num_bytes_send, num_bytes_to_send);
    ESP_LOGV(TAG, "spk payload = %02x %02x...%02x %02x\n", buffer[0], buffer[1], buffer[num_bytes_send - 2], buffer[num_bytes_send - 1]);
}

static esp_err_t _event_set_bits_wait_cleared(EventGroupHandle_t evt_group, EventBits_t bits, TickType_t timeout)
{
    xEventGroupSetBits(evt_group, bits);
    TickType_t counter = timeout;
    while (xEventGroupGetBits(evt_group) & bits) {
        vTaskDelay(1);
        counter -= 1;
        if (counter <= 0) {
            ESP_LOGE(TAG, "bits(0x%04X) clear timeout %"PRIu32, (unsigned int)bits, timeout);
            return ESP_ERR_TIMEOUT;
        }
    }
    xEventGroupClearBits(evt_group, bits);
    return ESP_OK;
}

static void _usb_stream_kill_cb(int time_out_ms)
{
    ESP_LOGD(TAG, "usb stream kill");
    _event_set_bits_wait_cleared(s_usb_dev.event_group_hdl, USB_STREAM_TASK_KILL_BIT, pdMS_TO_TICKS(time_out_ms));
    //wait for task resource release
    vTaskDelay(pdMS_TO_TICKS(WAITING_TASK_RESOURCE_RELEASE_MS));
    ESP_LOGD(TAG, "usb stream kill succeed");
}

static void _usb_stream_connect_cb(void)
{
    if ((s_usb_dev.enabled[STREAM_UAC_MIC] && !s_usb_dev.uac->as_ifc[UAC_MIC]->not_found)
            || (s_usb_dev.enabled[STREAM_UAC_SPK] && !s_usb_dev.uac->as_ifc[UAC_SPK]->not_found)
            || (s_usb_dev.enabled[STREAM_UVC] && !s_usb_dev.uvc->vs_ifc->not_found)) {
        if (s_usb_dev.stream_task_hdl != NULL) {
            xTaskNotifyGive(s_usb_dev.stream_task_hdl);
        }
    }
}

static void _usb_stream_recover_cb(int time_out_ms)
{
    _event_set_bits_wait_cleared(s_usb_dev.event_group_hdl, USB_STREAM_TASK_RECOVER_BIT, pdMS_TO_TICKS(time_out_ms));
}

static esp_err_t _usb_streaming_suspend(usb_stream_t stream)
{
    UVC_CHECK(stream < STREAM_MAX, "invalid stream type", ESP_ERR_INVALID_ARG);
    UVC_CHECK(_usb_device_get_state() > STATE_DEVICE_INSTALLED, "USB Device not active", ESP_ERR_INVALID_STATE);
    _stream_ifc_t *p_itf = s_usb_dev.ifc[stream];
    esp_err_t ret = ESP_OK;
    UVC_ENTER_CRITICAL();
    uint16_t interface_idx = p_itf->interface;
    UVC_EXIT_CRITICAL();
    if (_usb_device_get_state() == STATE_DEVICE_ACTIVE) {
        ret = _usb_set_device_interface(interface_idx, 0);
        if (ESP_OK != ret) {
            ESP_LOGE(TAG, "Set interface %u-%u failed", interface_idx, 0);
        }
    }
    if (stream == STREAM_UVC && s_usb_dev.uvc->uvc_stream_hdl) {
        uvc_stream_stop(s_usb_dev.uvc->uvc_stream_hdl);
        uvc_stream_close(s_usb_dev.uvc->uvc_stream_hdl);
        s_usb_dev.uvc->uvc_stream_hdl = NULL;
    }
    return ret;
}

static esp_err_t _uvc_streaming_resume(void)
{
    _uvc_device_t *uvc_dev = s_usb_dev.uvc;
    uvc_stream_ctrl_t ctrl_set = (uvc_stream_ctrl_t)DEFAULT_UVC_STREAM_CTRL();
    uvc_stream_ctrl_t ctrl_probed = {0};
    uvc_frame_size_t frame_size = {0};
    /* UVC negotiation process */
    UVC_ENTER_CRITICAL();
    ctrl_set.bFormatIndex = uvc_dev->format_index;
    ctrl_set.bFrameIndex = uvc_dev->frame_index;
    ctrl_set.dwFrameInterval = uvc_dev->frame_interval;
    ctrl_set.dwMaxVideoFrameSize = s_usb_dev.uvc_cfg.frame_buffer_size;
    /* For bulk transfer, payload size config by NUM_BULK_BYTES_PER_URB for better performance */
    ctrl_set.dwMaxPayloadTransferSize = (uvc_dev->vs_ifc->xfer_type == UVC_XFER_BULK) ? NUM_BULK_BYTES_PER_URB : (uvc_dev->vs_ifc->ep_mps);
    frame_size.width = uvc_dev->frame_width;
    frame_size.height = uvc_dev->frame_height;
    UVC_EXIT_CRITICAL();
    ESP_LOGI(TAG, "Probe Format(%u), Frame(%u) %u*%u, interval(%"PRIu32")", ctrl_set.bFormatIndex,
             ctrl_set.bFrameIndex, frame_size.width, frame_size.height, ctrl_set.dwFrameInterval);
    ESP_LOGI(TAG, "Probe payload size = %"PRIu32, ctrl_set.dwMaxPayloadTransferSize);
    esp_err_t ret = _uvc_vs_commit_control(&ctrl_set, &ctrl_probed);
    UVC_CHECK(ESP_OK == ret, "UVC negotiate failed", ESP_FAIL);
    if (ctrl_set.dwMaxPayloadTransferSize != ctrl_probed.dwMaxPayloadTransferSize) {
        ESP_LOGI(TAG, "dwMaxPayloadTransferSize set = %" PRIu32 ", probed = %" PRIu32, ctrl_set.dwMaxPayloadTransferSize, ctrl_probed.dwMaxPayloadTransferSize);
    }
    /* start uvc streaming */
    uvc_error_t uvc_ret = UVC_SUCCESS;
    uvc_ret = uvc_stream_open_ctrl(NULL, &uvc_dev->uvc_stream_hdl, &ctrl_probed);
    UVC_CHECK(uvc_ret == UVC_SUCCESS, "open uvc stream failed", ESP_FAIL);

    uvc_ret = uvc_stream_start(uvc_dev->uvc_stream_hdl, s_usb_dev.uvc_cfg.frame_cb, s_usb_dev.uvc_cfg.frame_cb_arg, 0);
    UVC_CHECK_GOTO(uvc_ret == UVC_SUCCESS, "start uvc stream failed", free_stream_);
    if (uvc_dev->vs_ifc->xfer_type == UVC_XFER_ISOC) {
        UVC_ENTER_CRITICAL();
        uint16_t interface = uvc_dev->vs_ifc->interface;
        uint16_t alt_interface = uvc_dev->vs_ifc->interface_alt;
        UVC_EXIT_CRITICAL();
        ret = _usb_set_device_interface(interface, alt_interface);
        UVC_CHECK_GOTO(ESP_OK == ret, "Resume uvc interface failed", free_stream_);
    }
    ESP_LOGD(TAG, "UVC Streaming...");
    return ESP_OK;

free_stream_:
    if (uvc_dev->uvc_stream_hdl) {
        uvc_stream_stop(uvc_dev->uvc_stream_hdl);
        uvc_stream_close(uvc_dev->uvc_stream_hdl);
    }
    uvc_dev->uvc_stream_hdl = NULL;
    return ESP_FAIL;
}

static esp_err_t _uac_streaming_resume(usb_stream_t stream)
{
    UVC_CHECK(stream == STREAM_UAC_MIC || stream == STREAM_UAC_SPK, "invalid stream type", ESP_ERR_INVALID_ARG);
    _uac_device_t *uac_dev = s_usb_dev.uac;
    esp_err_t ret = ESP_OK;
    _uac_internal_stream_t uac_stream = (stream == STREAM_UAC_MIC) ? UAC_MIC : UAC_SPK;
    UVC_ENTER_CRITICAL();
    uint16_t interface = uac_dev->as_ifc[uac_stream]->interface;
    uint16_t interface_alt = uac_dev->as_ifc[uac_stream]->interface_alt;
    UVC_EXIT_CRITICAL();
    ret = _usb_set_device_interface(interface, interface_alt);
    UVC_CHECK(ESP_OK == ret, "Set device interface failed", ESP_FAIL);

    UVC_ENTER_CRITICAL();
    bool freq_ctrl_support = uac_dev->freq_ctrl_support[uac_stream];
    uint8_t ep_addr = uac_dev->as_ifc[uac_stream]->ep_addr;
    uint32_t samples_frequence = uac_dev->samples_frequence[uac_stream];
    UVC_EXIT_CRITICAL();
    if (freq_ctrl_support) {
        ret = _uac_as_control_set_freq(ep_addr, samples_frequence);
        UVC_CHECK_CONTINUE(ESP_OK == ret, "frequency set failed");
    }
    ESP_LOGD(TAG, "%s Streaming...", (stream == STREAM_UAC_MIC) ? "MIC" : "SPK");
    return ESP_OK;
}

static esp_err_t _usb_streaming_resume(usb_stream_t stream)
{
    UVC_CHECK(stream < STREAM_MAX, "invalid stream type", ESP_ERR_INVALID_ARG);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    esp_err_t ret = ESP_OK;

    switch (stream) {
    case STREAM_UVC:
        ret = _uvc_streaming_resume();
        break;
    case STREAM_UAC_SPK:
    case STREAM_UAC_MIC:
        ret = _uac_streaming_resume(stream);
        break;
    default:
        break;
    }

    return ret;
}

static void _usb_stream_handle_task(void *arg)
{
    _uac_device_t *uac_dev = s_usb_dev.uac;
    _uvc_device_t *uvc_dev = s_usb_dev.uvc;
    _usb_device_t *usb_dev = &s_usb_dev;
    esp_err_t ret = ESP_OK;

    ESP_LOGI(TAG, "USB stream task start");
    // Waiting for usbh ready
    while (!(xEventGroupGetBits(usb_dev->event_group_hdl) & (USB_STREAM_TASK_KILL_BIT))) {
        if (ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(100)) == 0 || (_usb_device_get_state() != STATE_DEVICE_ACTIVE)) {
            //waiting for usb ready, we are in recover state
            xEventGroupClearBits(usb_dev->event_group_hdl, USB_STREAM_TASK_RECOVER_BIT);
            continue;
        }
        // Create pipe when device connect
        xQueueReset(usb_dev->stream_queue_hdl);
        // Check user flags to set initial stream state
        for (size_t i = 0; i < STREAM_MAX; i++) {
            if (usb_dev->enabled[i]) {
                uint32_t suspend_flag = i == STREAM_UVC ? FLAG_UVC_SUSPEND_AFTER_START
                                        : (i == STREAM_UAC_MIC ? FLAG_UAC_MIC_SUSPEND_AFTER_START
                                           : FLAG_UAC_SPK_SUSPEND_AFTER_START);
                if (usb_dev->flags & suspend_flag) {
                    usb_dev->ifc[i]->suspended = true;
                } else {
                    usb_dev->ifc[i]->suspended = false;
                }
                ESP_LOGD(TAG, "initial %s stream state %s", usb_dev->ifc[i]->name, usb_dev->ifc[i]->suspended ? "suspend" : "resume");
            }
        }

        for (size_t i = 0; i < STREAM_MAX; i++) {
            if (usb_dev->enabled[i] && !usb_dev->ifc[i]->not_found) {
                _apply_pipe_config(i);
                ret = _apply_stream_config(i);
                /* the not found means, not found suitable configs from device descriptor */
                UVC_CHECK_GOTO((ret == ESP_OK || ret == ESP_ERR_NOT_FOUND), "apply streaming config failed", _apply_config_failed);
            }
        }

