madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
        // We detach the user callback, users may reset the suspended flag in callback
        if (usb_dev->state_cb) {
            usb_dev->state_cb(STREAM_CONNECTED, usb_dev->state_cb_arg);
        }
        //prepare urb and data buffer for stream pipe
        for (size_t i = 0; i < STREAM_MAX; i++) {
            if (usb_dev->enabled[i] && !usb_dev->ifc[i]->not_found) {
                usb_ep_desc_t stream_ep_desc = (usb_ep_desc_t) {
                    .bLength = USB_EP_DESC_SIZE,
                    .bDescriptorType = USB_B_DESCRIPTOR_TYPE_ENDPOINT,
                    .bEndpointAddress = usb_dev->ifc[i]->ep_addr,
                    .bmAttributes = USB_BM_ATTRIBUTES_XFER_ISOC,
                    .wMaxPacketSize = usb_dev->ifc[i]->ep_mps,
                    .bInterval = 1,
                };

                if (usb_dev->ifc[i]->xfer_type == UVC_XFER_BULK) {
                    stream_ep_desc.bmAttributes = USB_BM_ATTRIBUTES_XFER_BULK;
                    stream_ep_desc.bInterval = 0;
                }
                ESP_LOGD(TAG, "Creating %s pipe: ifc=%d-%d, ep=0x%02X, mps=%"PRIu32, usb_dev->ifc[i]->name, usb_dev->ifc[i]->interface, usb_dev->ifc[i]->interface_alt,
                         usb_dev->ifc[i]->ep_addr, usb_dev->ifc[i]->ep_mps);
                usb_dev->ifc[i]->pipe_handle = _usb_pipe_init(usb_dev->port_hdl, &stream_ep_desc, usb_dev->dev_addr, usb_dev->dev_speed,
                                                              (void *)usb_dev->ifc[i]->type, &_usb_pipe_callback, (void *)usb_dev->stream_queue_hdl);
                UVC_CHECK_GOTO(usb_dev->ifc[i]->pipe_handle != NULL, "pipe init failed", _usb_stream_recover);
                /* If resume the interface, depend on whether the user flags suspend the stream
                * Please Note that, when disconnect and reconnect the device, the stream state will be reset
                */
                if (usb_dev->ifc[i]->suspended) {
                    ESP_LOGD(TAG, "Suspend %s stream. Reason: user suspend", usb_dev->ifc[i]->name);
                    continue;
                } else if (ret == ESP_ERR_NOT_FOUND) {
                    ESP_LOGW(TAG, "Suspend %s stream. Reason: user's expected not found", usb_dev->ifc[i]->name);
                    continue;
                }

                ret = _usb_streaming_resume(i);
                UVC_CHECK_GOTO(ret == ESP_OK, "streaming resume failed", _usb_stream_recover);
                _event_msg_t evt_msg = {
                    ._type = USER_EVENT,
                    ._event.user_cmd = STREAM_RESUME,
                    ._event_data = (void *)i,
                    ._handle.user_hdl = (void *)usb_dev->stream_task_hdl, //used to identify where the event come from
                };
                xQueueSend(usb_dev->stream_queue_hdl, &evt_msg, 0);
            }
        }
        xEventGroupSetBits(usb_dev->event_group_hdl, USB_STREAM_DEVICE_READY_BIT);
        while (!(xEventGroupGetBits(usb_dev->event_group_hdl) & (USB_STREAM_TASK_KILL_BIT | USB_STREAM_TASK_RECOVER_BIT))) {
            _event_msg_t evt_msg = {};
            if (xQueueReceive(usb_dev->stream_queue_hdl, &evt_msg, 1) != pdTRUE) {
                // check if ringbuffer has data and we have free urb, send out here
                if (usb_dev->enabled[STREAM_UAC_SPK] && (xEventGroupGetBits(usb_dev->event_group_hdl) & UAC_SPK_STREAM_RUNNING)) {
                    _processing_spk_pipe(uac_dev->as_ifc[UAC_SPK]->pipe_handle, false, false);
                }
                continue;
            }
            switch (evt_msg._type) {
            case USER_EVENT: {
                EventBits_t ack_bits = USB_STREAM_TASK_PROC_FAILED;
                usb_stream_t stream = (usb_stream_t)evt_msg._event_data;
                _stream_ifc_t *p_itf = usb_dev->ifc[stream];
                if (evt_msg._event.user_cmd == STREAM_SUSPEND) {
                    UVC_CHECK_GOTO((xEventGroupGetBits(usb_dev->event_group_hdl) & p_itf->evt_bit), "stream suspend: already suspend", _feedback_result);
                    ESP_LOGD(TAG, "%s stream suspend: flush transfer", p_itf->name);
                    ret = _usb_pipe_flush(p_itf->pipe_handle, p_itf->urb_num);
                    UVC_CHECK_GOTO(ret == ESP_OK, "stream suspend: flush transfer, failed", _feedback_result);
                    if (p_itf->urb_list) {
                        _usb_urb_list_free(p_itf->urb_list, p_itf->urb_num);
                        p_itf->urb_list = NULL;
                        ESP_LOGD(TAG, "%s stream suspend: free urb list succeed", p_itf->name);
                    }
                    if (stream == STREAM_UAC_SPK || stream == STREAM_UAC_MIC) {
                        _ring_buffer_flush(uac_dev->ringbuf_hdl[stream == STREAM_UAC_SPK ? UAC_SPK : UAC_MIC]);
                    }
                    ack_bits = USB_STREAM_TASK_PROC_SUCCEED;
                    xEventGroupClearBits(usb_dev->event_group_hdl, p_itf->evt_bit);
                    ESP_LOGD(TAG, "%s stream suspend, flush transfer succeed", p_itf->name);
                } else if (evt_msg._event.user_cmd == STREAM_RESUME) {
                    UVC_CHECK_GOTO(!(xEventGroupGetBits(usb_dev->event_group_hdl) & p_itf->evt_bit), "stream resume: already resume", _feedback_result);
                    ESP_LOGD(TAG, "%s stream resume: enqueue transfer", p_itf->name);
                    if (evt_msg._handle.user_hdl != usb_dev->stream_task_hdl) {
                        ret = _apply_stream_config(stream);
                        UVC_CHECK_GOTO(ret == ESP_OK, "stream resume: apply config", _feedback_result);
                    }
                    if (p_itf->type == STREAM_UVC && p_itf->xfer_type == UVC_XFER_BULK) {
                        uvc_dev->uvc_stream_hdl->reassemble_flag = 0;
                        if (uvc_dev->uvc_stream_hdl->cur_ctrl.dwMaxPayloadTransferSize < p_itf->bytes_per_packet) {
                            p_itf->bytes_per_packet = uvc_dev->uvc_stream_hdl->cur_ctrl.dwMaxPayloadTransferSize;
                        } else if (uvc_dev->uvc_stream_hdl->cur_ctrl.dwMaxPayloadTransferSize > p_itf->bytes_per_packet) {
                            // in most case, the payload size is very large in bulk transfer (one sample or part of sample),
                            // to save memory, we transfer with smaller size, and reassemble payload.
                            uvc_dev->uvc_stream_hdl->reassemble_flag = 1;
                            ESP_LOGD(TAG, "UVC Bulk Packet Reassemble Enable");
                        }
                    }
                    if (p_itf->urb_list == NULL && p_itf->xfer_type == UVC_XFER_BULK) {
                        p_itf->urb_list = _usb_urb_list_alloc(p_itf->urb_num, 0, p_itf->bytes_per_packet);
                        UVC_CHECK_ABORT(p_itf->urb_list != NULL, "p_urb alloc failed");
                        ESP_LOGD(TAG, "%s stream resume: alloc urb list succeed", p_itf->name);
                    } else if (p_itf->urb_list == NULL) {
                        ESP_LOGD(TAG, "%s stream resume: alloc/enqueue %u urbs, packets=%u, bytes_per_packet=%u",
                                 p_itf->name,
                                 (unsigned)p_itf->urb_num,
                                 (unsigned)p_itf->packets_per_urb,
                                 (unsigned)p_itf->bytes_per_packet);
                        p_itf->urb_list = _usb_urb_list_alloc(p_itf->urb_num, p_itf->packets_per_urb, p_itf->bytes_per_packet);
                        UVC_CHECK_ABORT(p_itf->urb_list != NULL, "p_urb alloc failed");
                        ESP_LOGD(TAG, "%s stream resume: alloc urb list succeed", p_itf->name);
                    }
                    if (p_itf->type == STREAM_UAC_SPK) {
                        // For out stream, we set a minimum start zero packet
                        for (int j = 0; j < p_itf->urb_num; j++) {
                            usb_transfer_dummy_t *transfer_dummy = (usb_transfer_dummy_t *)(&(p_itf->urb_list[j]->transfer));
                            transfer_dummy->num_isoc_packets = 1;
                            transfer_dummy->num_bytes = p_itf->bytes_per_packet;
                            transfer_dummy->isoc_packet_desc[0].num_bytes = p_itf->bytes_per_packet;
                        }
                        _processing_spk_pipe(NULL, false, true);
                    }
                    ret = _usb_pipe_clear(p_itf->pipe_handle, p_itf->urb_num);
                    UVC_CHECK_GOTO(ret == ESP_OK, "stream resume: clear pipe, failed", _feedback_result);
                    ret = _usb_urb_list_enqueue(p_itf->pipe_handle, p_itf->urb_list, p_itf->urb_num);
                    UVC_CHECK_GOTO(ret == ESP_OK, "stream resume: enqueue transfer, failed", _feedback_result);
                    ack_bits = USB_STREAM_TASK_PROC_SUCCEED;
                    xEventGroupSetBits(usb_dev->event_group_hdl, p_itf->evt_bit);
                    ESP_LOGD(TAG, "%s stream resume: enqueue transfer succeed", p_itf->name);
                }
_feedback_result:
                if (evt_msg._handle.user_hdl != usb_dev->stream_task_hdl) {
                    xEventGroupSetBits(usb_dev->event_group_hdl, ack_bits);
                }
                break;
            }
            case PIPE_EVENT: {
                usb_stream_t stream = (usb_stream_t)hcd_pipe_get_context(evt_msg._handle.pipe_handle);
                _pipe_event_dflt_process(evt_msg._handle.pipe_handle, usb_dev->ifc[stream]->name, evt_msg._event.pipe_event);
                switch (evt_msg._event.pipe_event) {
                case HCD_PIPE_EVENT_URB_DONE:
                    if (stream == STREAM_UAC_MIC) {
                        SYSVIEW_UAC_MIC_PIPE_HANDLE_START();
                        _processing_mic_pipe(uac_dev->as_ifc[UAC_MIC]->pipe_handle, usb_dev->uac_cfg.mic_cb, usb_dev->uac_cfg.mic_cb_arg, true);
                        SYSVIEW_UAC_MIC_PIPE_HANDLE_STOP();
                    } else if (stream == STREAM_UAC_SPK) {
                        SYSVIEW_UAC_SPK_PIPE_HANDLE_START();
                        _processing_spk_pipe(uac_dev->as_ifc[UAC_SPK]->pipe_handle, true, false);
                        SYSVIEW_UAC_SPK_PIPE_HANDLE_STOP();
                    } else if (stream == STREAM_UVC) {
                        SYSVIEW_UVC_PIPE_HANDLE_START();
                        _processing_uvc_pipe(uvc_dev->uvc_stream_hdl, uvc_dev->vs_ifc->pipe_handle, true);
                        SYSVIEW_UVC_PIPE_HANDLE_STOP();
                    }
                    break;
                case HCD_PIPE_EVENT_ERROR_OVERFLOW:
                case HCD_PIPE_EVENT_ERROR_URB_NOT_AVAIL:
                case HCD_PIPE_EVENT_ERROR_XFER:
                    goto _usb_stream_recover;
                    break;
                case HCD_PIPE_EVENT_ERROR_STALL: {
                    _event_msg_t evt_msg = {
                        ._type = USER_EVENT,
                        ._event.user_cmd = STREAM_SUSPEND,
                        ._event_data = (void *)stream,
                    };
                    //if stall, we just suspend then resume the pipe
                    xQueueSend(usb_dev->stream_queue_hdl, &evt_msg, 0);
                    evt_msg._event.user_cmd = STREAM_RESUME;
                    xQueueSend(usb_dev->stream_queue_hdl, &evt_msg, 0);
                    break;
                }
                default:
                    break;
                }
                break;
            }
            default:
                break;
            }
        }
_usb_stream_recover:
        xEventGroupClearBits(usb_dev->event_group_hdl, USB_STREAM_DEVICE_READY_BIT);
        /* check if reset trigger by disconnect */
        ESP_LOGI(TAG, "usb stream task wait reset");
        EventBits_t uxBits = xEventGroupWaitBits(usb_dev->event_group_hdl, USB_STREAM_TASK_KILL_BIT |
                                                 USB_STREAM_TASK_RECOVER_BIT, pdFALSE, pdFALSE, pdMS_TO_TICKS(1000));
        if (uxBits & (USB_STREAM_TASK_KILL_BIT | USB_STREAM_TASK_RECOVER_BIT)) {
            // if reset trigger by disconnect, we just reset to default state
            ESP_LOGI(TAG, "usb stream task reset, reason: device %s", (uxBits & USB_STREAM_TASK_KILL_BIT) ? "disconnect" : "recover");
        } else if (_usb_device_get_state() == STATE_DEVICE_ACTIVE) {
            // if reset trigger by other reason and device is active, we just recover the stream
            xTaskNotifyGive(usb_dev->stream_task_hdl);
            ESP_LOGW(TAG, "usb stream task recover, reason: stream error");
        } else {
            // if reset trigger by other reason and device is not active, we just reset to default state
            ESP_LOGW(TAG, "usb stream task reset, reason: device not active");
        }

        for (size_t i = 0; i < STREAM_MAX; i++) {
            if (usb_dev->enabled[i] && !usb_dev->ifc[i]->not_found) {
                ESP_LOGI(TAG, "Resetting %s pipe", usb_dev->ifc[i]->name);
                _usb_streaming_suspend(i);
                _usb_pipe_deinit(usb_dev->ifc[i]->pipe_handle, usb_dev->ifc[i]->urb_num);
                usb_dev->ifc[i]->pipe_handle = NULL;
                _usb_urb_list_free(usb_dev->ifc[i]->urb_list, usb_dev->ifc[i]->urb_num);
                usb_dev->ifc[i]->urb_list = NULL;
            }
        }
        if (uac_dev != NULL) {
            _ring_buffer_flush(uac_dev->ringbuf_hdl[UAC_SPK]);
            _ring_buffer_flush(uac_dev->ringbuf_hdl[UAC_MIC]);
        }
        xEventGroupClearBits(usb_dev->event_group_hdl, USB_UVC_STREAM_RUNNING | UAC_SPK_STREAM_RUNNING | UAC_MIC_STREAM_RUNNING);
        if (usb_dev->state_cb) {
            usb_dev->state_cb(STREAM_DISCONNECTED, usb_dev->state_cb_arg);
        }
        xEventGroupClearBits(usb_dev->event_group_hdl, USB_STREAM_TASK_RECOVER_BIT);
_apply_config_failed:
        continue;
    } //handle hotplug
    ESP_LOGI(TAG, "USB stream task deleted");
    ESP_LOGD(TAG, "USB stream task watermark = %d B", uxTaskGetStackHighWaterMark(NULL));
    xEventGroupClearBits(usb_dev->event_group_hdl, USB_STREAM_TASK_KILL_BIT);
    vTaskDelete(NULL);
}
static uint32_t _usb_port_actions_update(hcd_port_event_t port_evt, uint32_t action_bits)
{
    switch (port_evt) {
    case HCD_PORT_EVENT_CONNECTION:
        action_bits &= ~ACTION_DEVICE_DISCONNECT;
        action_bits = ACTION_DEVICE_CONNECT;
        break;
    case HCD_PORT_EVENT_DISCONNECTION:
        action_bits &= ~ACTION_DEVICE_CONNECT;
        action_bits = ACTION_DEVICE_DISCONNECT;
        action_bits |= ACTION_PORT_RECOVER;
        action_bits |= ACTION_PIPE_DFLT_DISABLE;
        break;
    case HCD_PORT_EVENT_ERROR:
    case HCD_PORT_EVENT_OVERCURRENT:
        action_bits = ACTION_PORT_RECOVER;
        action_bits |= ACTION_PIPE_DFLT_DISABLE;
        break;
    default:
        break;
    }
    ESP_LOGD(TAG, "port update: action_bits = 0x%04X", (unsigned int)action_bits);
    return action_bits;
}

static uint32_t _usb_pipe_actions_update(hcd_pipe_event_t pipe_evt, uint32_t action_bits)
{
    switch (pipe_evt) {
    case HCD_PIPE_EVENT_URB_DONE:
        action_bits |= ACTION_PIPE_XFER_DONE;
        break;
    case HCD_PIPE_EVENT_ERROR_XFER:
    case HCD_PIPE_EVENT_ERROR_URB_NOT_AVAIL:
    case HCD_PIPE_EVENT_ERROR_OVERFLOW:
        action_bits |= ACTION_PIPE_DFLT_RECOVER;
        action_bits |= ACTION_PIPE_DFLT_CLEAR;
        action_bits |= ACTION_PIPE_XFER_FAIL;
        break;
    case HCD_PIPE_EVENT_ERROR_STALL:
        action_bits |= ACTION_PIPE_DFLT_CLEAR;
        action_bits |= ACTION_PIPE_XFER_FAIL;
        break;
    default:
        break;
    }
    ESP_LOGD(TAG, "pipe update: action_bits = 0x%04X", (unsigned int)action_bits);
    return action_bits;
}

static uint32_t _user_actions_update(_user_cmd_t usr_cmd, uint32_t action_bits)
{
    switch (usr_cmd) {
    case USB_RECOVER:
        action_bits = ACTION_PORT_RECOVER;
        action_bits |= ACTION_PIPE_DFLT_DISABLE;
        break;
    case PIPE_RECOVER:
        action_bits |= ACTION_PIPE_DFLT_RECOVER;
        action_bits |= ACTION_PIPE_DFLT_CLEAR;
        break;
    default:
        break;
    }
    ESP_LOGD(TAG, "user update: action_bits = 0x%04X", (unsigned int)action_bits);
    return action_bits;
}

static esp_err_t _uvc_uac_device_enum(bool abort_process, bool *waiting_urb_done)
{
    UVC_CHECK_GOTO(!abort_process, "Enum abort", stage_failed_);
    _usb_device_t *usb_dev = &s_usb_dev;
    urb_t *enum_done = NULL;
    static urb_t *ctrl_urb = NULL;
    static bool urb_need_free = false;
    static uint16_t full_config_length = 0;
    bool urb_need_enqueue = false;
    esp_err_t ret = ESP_FAIL;
    usb_transfer_t *enum_transfer = NULL;
    if (waiting_urb_done) {
        *waiting_urb_done = false;
    }
    if (ctrl_urb != NULL) {
        enum_transfer = &ctrl_urb->transfer;
    }

    if (usb_dev->enum_stage == ENUM_STAGE_NONE) {
        usb_dev->enum_stage = ENUM_STAGE_START;
    } else if (usb_dev->enum_stage % 2) { // Check if we are in check stage, which is always odd number
        assert(usb_dev->dflt_pipe_hdl); //should not be NULL
        enum_done = hcd_urb_dequeue(usb_dev->dflt_pipe_hdl);
        UVC_CHECK_GOTO(enum_done == ctrl_urb, "urb cleared: enum abort", stage_failed_);

