madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
        if (enum_transfer->status != USB_TRANSFER_STATUS_COMPLETED) {
            ESP_LOGE(TAG, "Bad transfer status %d", enum_transfer->status);
            if (enum_transfer->status == USB_TRANSFER_STATUS_STALL) {
                hcd_pipe_command(usb_dev->dflt_pipe_hdl, HCD_PIPE_CMD_CLEAR);
            }
            goto stage_failed_;
        }
        UVC_CHECK_GOTO(enum_transfer->actual_num_bytes <= enum_transfer->num_bytes, "urb status: data overflow", stage_failed_);
    }
    switch (usb_dev->enum_stage) {
    case ENUM_STAGE_START: {
        if (!usb_dev->dflt_pipe_hdl) {
            ESP_ERROR_CHECK(_usb_port_get_speed(usb_dev->port_hdl, &(usb_dev->dev_speed)));
            ESP_LOGI(TAG, "USB Speed: %s-speed", usb_dev->dev_speed == USB_SPEED_FULL ? "full" : "low");
            xSemaphoreTake(usb_dev->xfer_mutex_hdl, portMAX_DELAY);
            usb_dev->dflt_pipe_hdl = _usb_pipe_init(usb_dev->port_hdl, NULL, 0, usb_dev->dev_speed,
                                                    (void *)usb_dev->queue_hdl, &_usb_pipe_callback, (void *)usb_dev->queue_hdl);
            xSemaphoreGive(usb_dev->xfer_mutex_hdl);
            UVC_CHECK_GOTO(usb_dev->dflt_pipe_hdl != NULL, "default pipe create failed", stage_failed_);
            usb_dev->ep_mps = usb_dev->dev_speed == USB_SPEED_FULL ? USB_EP0_FS_DEFAULT_MPS : USB_EP0_LS_DEFAULT_MPS;
        }
        //else malloc a new one for enum stage
        if (enum_transfer == NULL) {
            //if we already have a ctrl urb, just reuse it. else malloc a new one
            if (usb_dev->ctrl_urb != NULL) {
                ctrl_urb = usb_dev->ctrl_urb;
            } else {
                ctrl_urb = _usb_urb_alloc(0, sizeof(usb_setup_packet_t) + CTRL_TRANSFER_DATA_MAX_BYTES, NULL);
                UVC_CHECK_GOTO(ctrl_urb != NULL, "default pipe create failed", stage_failed_);
                urb_need_free = true;
            }
        }
#ifndef CONFIG_UVC_GET_DEVICE_DESC
        usb_dev->enum_stage = ENUM_STAGE_CHECK_SHORT_DEV_DESC;
        ret = hcd_pipe_update_mps(usb_dev->dflt_pipe_hdl, usb_dev->ep_mps);
        ESP_LOGI(TAG, "Default pipe endpoint MPS update to %d", usb_dev->ep_mps);
        UVC_CHECK_GOTO(ESP_OK == ret, "default pipe update MPS failed", stage_failed_);
#endif
        break;
    }
    case ENUM_STAGE_GET_SHORT_DEV_DESC: {
        USB_SETUP_PACKET_INIT_GET_DEVICE_DESC((usb_setup_packet_t *)enum_transfer->data_buffer);
        ((usb_setup_packet_t *)enum_transfer->data_buffer)->wLength = USB_SHORT_DESC_REQ_LEN;
        enum_transfer->num_bytes = sizeof(usb_setup_packet_t) + usb_round_up_to_mps(USB_SHORT_DESC_REQ_LEN, usb_dev->ep_mps);
        urb_need_enqueue = true;
        break;
    }
    case ENUM_STAGE_CHECK_SHORT_DEV_DESC: {
        usb_device_desc_t *dev_desc = (usb_device_desc_t *)(enum_done->transfer.data_buffer + sizeof(usb_setup_packet_t));
        ret = hcd_pipe_update_mps(usb_dev->dflt_pipe_hdl, dev_desc->bMaxPacketSize0);
        UVC_CHECK_GOTO(ESP_OK == ret, "default pipe update MPS failed", stage_failed_);
        ESP_LOGI(TAG, "Default pipe endpoint MPS update to %d", dev_desc->bMaxPacketSize0);
        usb_dev->ep_mps = dev_desc->bMaxPacketSize0;
        break;
    }
    case ENUM_STAGE_SET_ADDR: {
        USB_SETUP_PACKET_INIT_SET_ADDR((usb_setup_packet_t *)enum_transfer->data_buffer, usb_dev->dev_addr);
        enum_transfer->num_bytes = sizeof(usb_setup_packet_t);
        urb_need_enqueue = true;
        break;
    }
    case ENUM_STAGE_CHECK_ADDR: {
        ESP_ERROR_CHECK(hcd_pipe_update_dev_addr(usb_dev->dflt_pipe_hdl, usb_dev->dev_addr));
        vTaskDelay(pdMS_TO_TICKS(10)); //Wait SET ADDRESS recovery interval
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        usb_dev->enum_stage = ENUM_STAGE_CHECK_FULL_CONFIG_DESC;
#endif
        break;
    }
    case ENUM_STAGE_GET_FULL_DEV_DESC: {
        USB_SETUP_PACKET_INIT_GET_DEVICE_DESC((usb_setup_packet_t *)enum_transfer->data_buffer);
        enum_transfer->num_bytes = sizeof(usb_setup_packet_t) + usb_round_up_to_mps(sizeof(usb_device_desc_t), s_usb_dev.ep_mps);
        urb_need_enqueue = true;
        break;
    }
    case ENUM_STAGE_CHECK_FULL_DEV_DESC: {
        usb_device_desc_t *dev_desc = (usb_device_desc_t *)(enum_done->transfer.data_buffer + sizeof(usb_setup_packet_t));
        print_device_descriptor((const uint8_t *)dev_desc);
        break;
    }
    case ENUM_STAGE_GET_SHORT_CONFIG_DESC: {
        USB_SETUP_PACKET_INIT_GET_CONFIG_DESC((usb_setup_packet_t *)enum_transfer->data_buffer, usb_dev->configuration - 1, USB_ENUM_SHORT_DESC_REQ_LEN);
        enum_transfer->num_bytes = sizeof(usb_setup_packet_t) + usb_round_up_to_mps(USB_ENUM_SHORT_DESC_REQ_LEN, s_usb_dev.ep_mps);
        urb_need_enqueue = true;
        break;
    }
    case ENUM_STAGE_CHECK_SHORT_CONFIG_DESC: {
        usb_config_desc_t *cfg_desc = (usb_config_desc_t *)(enum_done->transfer.data_buffer + sizeof(usb_setup_packet_t));
        full_config_length = cfg_desc->wTotalLength;
        UVC_CHECK_GOTO(full_config_length <= CTRL_TRANSFER_DATA_MAX_BYTES, "Configuration descriptor larger than control transfer max length", stage_failed_);
        break;
    }
    case ENUM_STAGE_GET_FULL_CONFIG_DESC: {
        USB_SETUP_PACKET_INIT_GET_CONFIG_DESC((usb_setup_packet_t *)enum_transfer->data_buffer, usb_dev->configuration - 1, full_config_length);
        enum_transfer->num_bytes = sizeof(usb_setup_packet_t) + usb_round_up_to_mps(full_config_length, s_usb_dev.ep_mps);
        urb_need_enqueue = true;
        break;
    }
    case ENUM_STAGE_CHECK_FULL_CONFIG_DESC: {
        usb_config_desc_t *cfg_desc = (usb_config_desc_t *)(enum_done->transfer.data_buffer + sizeof(usb_setup_packet_t));
        ret = _update_config_from_descriptor(cfg_desc);
        UVC_CHECK_GOTO(ret == ESP_OK, "Descriptor Parse Result: No matching configurations", stage_failed_);
        break;
    }
    case ENUM_STAGE_SET_CONFIG: {
        USB_SETUP_PACKET_INIT_SET_CONFIG((usb_setup_packet_t *)enum_transfer->data_buffer, usb_dev->configuration);
        enum_transfer->num_bytes = sizeof(usb_setup_packet_t);
        urb_need_enqueue = true;
        break;
    }
    case ENUM_STAGE_CHECK_CONFIG: {
        // Enum process done
        break;
    }
    default:
        break;
    }
    if (urb_need_enqueue) {
        ret = hcd_urb_enqueue(usb_dev->dflt_pipe_hdl, ctrl_urb);
        UVC_CHECK_GOTO(ret == ESP_OK, "ctrl urb enqueue failed", stage_failed_);
        if (waiting_urb_done) {
            *waiting_urb_done = true;
        }
    }
    if (usb_dev->enum_stage < ENUM_STAGE_CHECK_CONFIG) {
        ESP_LOGI(TAG, "ENUM Stage %s, Succeed", STAGE_STR[usb_dev->enum_stage]);
        usb_dev->enum_stage++;
        return ESP_OK;
    } else {
        usb_dev->enum_stage = ENUM_STAGE_NONE;
    }
stage_failed_:
    if (urb_need_free) {
        _usb_urb_free(ctrl_urb);
        urb_need_free = false;
    }
    ctrl_urb = NULL;
    if (usb_dev->enum_stage == ENUM_STAGE_NONE) {
        return ESP_OK;
    }
    ESP_LOGE(TAG, "ENUM Stage %s, Failed", STAGE_STR[usb_dev->enum_stage]);
    usb_dev->enum_stage = ENUM_STAGE_FAILED;
    return ESP_FAIL;
}

static void _usb_processing_task(void *arg)
{
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    _usb_device_t *usb_dev = &s_usb_dev;
    esp_err_t ret = ESP_OK;
    _event_msg_t evt_msg = {};
    uint32_t action_bits = 0;
#ifdef CONFIG_USB_ENUM_FAILED_RETRY
    int enum_retry_delay_ms = 0;
    int enum_retry_count = 0;
#endif
    ESP_LOGD(TAG, "USB task start");
    usb_dev->port_hdl = _usb_port_init(&_usb_port_callback, (void *)usb_dev->queue_hdl);
    UVC_CHECK_GOTO(usb_dev->port_hdl != NULL, "USB Port init failed", free_task_);
    xEventGroupSetBits(usb_dev->event_group_hdl, USB_HOST_INIT_DONE);
    UVC_ENTER_CRITICAL();
    usb_dev->state = STATE_DEVICE_INSTALLED;
    UVC_EXIT_CRITICAL();
    ESP_LOGD(TAG, "USB Task: Waiting Connection");
    int debug_counter = 0;
    while (1) {
        if (xQueueReceive(usb_dev->queue_hdl, &evt_msg, 1) == pdTRUE) {
            // update action bits based on events
            if (evt_msg._type == PORT_EVENT) {
                hcd_port_event_t port_actual_evt = _usb_port_event_dflt_process(usb_dev->port_hdl, evt_msg._event.port_event);
                action_bits = _usb_port_actions_update(port_actual_evt, action_bits);
#ifdef CONFIG_USB_ENUM_FAILED_RETRY
                //enum retry count reset to default if new device is connected
                if (port_actual_evt == HCD_PORT_EVENT_CONNECTION) {
                    enum_retry_count = CONFIG_USB_ENUM_FAILED_RETRY_COUNT;
                }
#endif
            } else if (evt_msg._type == PIPE_EVENT) {
                hcd_pipe_event_t dflt_pipe_evt = _pipe_event_dflt_process(usb_dev->dflt_pipe_hdl, "default", evt_msg._event.pipe_event);
                action_bits = _usb_pipe_actions_update(dflt_pipe_evt, action_bits);
            } else if (evt_msg._type == USER_EVENT) {
                // process event from usb stream task
                action_bits = _user_actions_update(evt_msg._event.user_cmd, action_bits);
            }
        }
        if (xEventGroupGetBits(usb_dev->event_group_hdl) & USB_HOST_TASK_KILL_BIT) {
            action_bits = ACTION_PORT_DISABLE;
            action_bits |= ACTION_PIPE_DFLT_DISABLE;
        }
        // process action bits
        if (action_bits == 0) {
            // no action bits set, wait for event
            if (++debug_counter % 300 == 0) {
                ESP_LOGD(TAG, "USB task running %d", debug_counter);
            }
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        if (usb_dev->state == STATE_DEVICE_ENUM && (action_bits & ACTION_PIPE_XFER_FAIL)) {
            // transfer failed during enum process, back to enum action to judge if need retry
            action_bits |= ACTION_DEVICE_ENUM;
        }
        if (usb_dev->state == STATE_DEVICE_ENUM && (action_bits & (ACTION_PORT_RECOVER
                                                                   | ACTION_PORT_DISABLE | ACTION_PIPE_DFLT_DISABLE))) {
            // If user disable, or port error, or disconnect happened, Force end the enum process without retry
            _uvc_uac_device_enum(true, NULL);
            action_bits &= ~ACTION_DEVICE_ENUM;
            action_bits &= ~ACTION_DEVICE_ENUM_RECOVER;
        }
        if (usb_dev->state == STATE_DEVICE_ACTIVE && (action_bits & (ACTION_PIPE_XFER_FAIL
                                                                     | ACTION_PIPE_DFLT_CLEAR | ACTION_PIPE_DFLT_RECOVER | ACTION_PIPE_DFLT_DISABLE))) {
            // If transfer fail or pipe recovering, send a signal to transfer invoker
            xEventGroupSetBits(usb_dev->event_group_hdl, USB_CTRL_PROC_FAILED);
        }

