madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
#ifdef CONFIG_USB_ENUM_FAILED_RETRY
        if (action_bits & ACTION_DEVICE_ENUM_RECOVER) {
            // we only retry if port not disabled or reconnect during the retry delay
            if (enum_retry_delay_ms > 0) {
                enum_retry_delay_ms -= 10;
                ESP_LOGD(TAG, "USB enum failed, retrying in %d ms", enum_retry_delay_ms);
                vTaskDelay(pdMS_TO_TICKS(10));
            } else {
                ESP_LOGW(TAG, "USB enum failed, retry now");
                usb_dev->enum_stage = ENUM_STAGE_NONE;
                action_bits |= ACTION_DEVICE_ENUM;
                action_bits &= ~ACTION_DEVICE_ENUM_RECOVER;
            }
        }
#endif

        if (action_bits & (ACTION_PORT_RECOVER | ACTION_PORT_DISABLE)) {
            ESP_LOGI(TAG, "Recover Stream Task");
            UVC_ENTER_CRITICAL();
            usb_dev->state = STATE_DEVICE_RECOVER;
            UVC_EXIT_CRITICAL();
            if (usb_dev->stream_task_hdl != NULL) {
                _usb_stream_recover_cb(TIMEOUT_USB_STREAM_DISCONNECT_MS);
            }
        }
        if (action_bits & ACTION_PIPE_XFER_FAIL) {
            // we do nothing here, because all conditions has been handled
            ESP_LOGD(TAG, "Action: ACTION_PIPE_XFER_FAIL");
            action_bits &= ~ACTION_PIPE_XFER_FAIL;
            ESP_LOGD(TAG, "Action: ACTION_PIPE_XFER_FAIL, Done!");
        }
        if (action_bits & ACTION_PIPE_DFLT_RECOVER) {
            ESP_LOGI(TAG, "Action: ACTION_PIPE_DFLT_RECOVER");
            UVC_ENTER_CRITICAL();
            usb_dev->state = STATE_DEVICE_RECOVER;
            UVC_EXIT_CRITICAL();
            if (usb_dev->dflt_pipe_hdl) {
                ret = _usb_pipe_flush(usb_dev->dflt_pipe_hdl, 1);
                UVC_CHECK_CONTINUE(ESP_OK == ret, "Default pipe flush failed");
            }
            action_bits &= ~ACTION_PIPE_DFLT_RECOVER;
            ESP_LOGD(TAG, "Action: ACTION_PIPE_DFLT_RECOVER, Done!");
        }
        if (action_bits & ACTION_PIPE_DFLT_CLEAR) {
            ESP_LOGI(TAG, "Action: ACTION_PIPE_DFLT_CLEAR");
            hcd_urb_dequeue(usb_dev->dflt_pipe_hdl);
            ret = hcd_pipe_command(usb_dev->dflt_pipe_hdl, HCD_PIPE_CMD_CLEAR);
            UVC_CHECK_CONTINUE(ESP_OK == ret, "Default pipe clear failed");
            action_bits &= ~ACTION_PIPE_DFLT_CLEAR;
            UVC_ENTER_CRITICAL();
            usb_dev->state = STATE_DEVICE_ACTIVE;
            UVC_EXIT_CRITICAL();
            ESP_LOGD(TAG, "Action: ACTION_PIPE_DFLT_CLEAR, Done!");
        }
        if (action_bits & ACTION_PIPE_DFLT_DISABLE) {
            ESP_LOGI(TAG, "Action: ACTION_PIPE_DFLT_DISABLE");
            if (usb_dev->dflt_pipe_hdl) {
                ESP_LOGD(TAG, "Resetting default pipe");
                xSemaphoreTake(s_usb_dev.xfer_mutex_hdl, portMAX_DELAY);
                ret = _usb_pipe_deinit(usb_dev->dflt_pipe_hdl, 1);
                usb_dev->dflt_pipe_hdl = NULL;
                xSemaphoreGive(s_usb_dev.xfer_mutex_hdl);
                UVC_CHECK_CONTINUE(ESP_OK == ret, "Default pipe disable failed");
            }
            action_bits &= ~ACTION_PIPE_DFLT_DISABLE;
            ESP_LOGD(TAG, "Action: ACTION_PIPE_DFLT_DISABLE, Done!");
        }
        if (action_bits & ACTION_PORT_RECOVER) {
            ESP_LOGI(TAG, "Action: ACTION_PORT_RECOVER");
            ESP_LOGD(TAG, "USB port recovering from state(%d)", hcd_port_get_state(usb_dev->port_hdl));
            ret = hcd_port_recover(usb_dev->port_hdl);
            UVC_CHECK_CONTINUE(ESP_OK == ret, "PORT Recover failed");
            ESP_LOGD(TAG, "USB port after recover, state(%d)", hcd_port_get_state(usb_dev->port_hdl));
            ret = hcd_port_command(usb_dev->port_hdl, HCD_PORT_CMD_POWER_ON);
            UVC_CHECK_CONTINUE(ESP_OK == ret, "PORT Power failed");
            action_bits &= ~ACTION_PORT_RECOVER;
            ESP_LOGD(TAG, "Action: ACTION_PORT_RECOVER, Done!");
            xQueueReset(usb_dev->queue_hdl);
        }
        if (action_bits & ACTION_PORT_DISABLE) {
            ESP_LOGI(TAG, "Action: ACTION_PORT_DISABLE");
            if (usb_dev->stream_task_hdl != NULL) {
                _usb_stream_kill_cb(TIMEOUT_USB_STREAM_DEINIT_MS);
            }
            action_bits &= ~ACTION_PORT_DISABLE;
            ESP_LOGD(TAG, "Action: ACTION_PORT_DISABLE, Done!");
            break;
        }
        if (action_bits & ACTION_DEVICE_DISCONNECT) {
            ESP_LOGI(TAG, "Action: ACTION_DEVICE_DISCONN");
            action_bits &= ~ACTION_DEVICE_DISCONNECT;
            ESP_LOGD(TAG, "Action: ACTION_DEVICE_DISCONN, Done!");
            ESP_LOGI(TAG, "Waiting USB Connection");
        }
        if (action_bits & ACTION_DEVICE_CONNECT) {
            ESP_LOGI(TAG, "Action: ACTION_DEVICE_CONNECT");
            vTaskDelay(pdMS_TO_TICKS(WAITING_USB_AFTER_CONNECTION_MS));
            ESP_LOGI(TAG, "Resetting Port");
            static int reset_retry = 3;
            ret = hcd_port_command(usb_dev->port_hdl, HCD_PORT_CMD_RESET);
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "Port Reset failed, retry = %d", reset_retry--);
                vTaskDelay(pdMS_TO_TICKS(100));
                if (reset_retry == 0) {
                    reset_retry = 3;
                    action_bits &= ~ACTION_DEVICE_CONNECT;
                    UVC_ENTER_CRITICAL();
                    usb_dev->state = STATE_DEVICE_RECOVER;
                    UVC_EXIT_CRITICAL();
                    ESP_LOGE(TAG, "Port Reset failed, retry failed");
                }
                continue;
            }
            reset_retry = 3;
            ESP_LOGI(TAG, "Setting Port FIFO, %d", usb_dev->fifo_bias);
            /*
             * Arduino-ESP32 3.3.8 exposes the HCD type declarations used by
             * this vendored usb_stream release, but does not export
             * hcd_port_set_fifo_bias(). The port is already created with a
             * FIFO bias, so keep enumeration moving without this optional
             * post-reset retune.
             */
            action_bits &= ~ACTION_DEVICE_CONNECT;
            action_bits |= ACTION_DEVICE_ENUM;
            usb_dev->enum_stage = ENUM_STAGE_NONE;
            UVC_ENTER_CRITICAL();
            usb_dev->state = STATE_DEVICE_CONNECTED;
            UVC_EXIT_CRITICAL();
            ESP_LOGD(TAG, "Action: ACTION_DEVICE_CONNECT, Done!");
        }
        if (action_bits & ACTION_DEVICE_ENUM) {
            UVC_ENTER_CRITICAL();
            usb_dev->state = STATE_DEVICE_ENUM;
            UVC_EXIT_CRITICAL();
            _enum_stage_t enum_stage = usb_dev->enum_stage;
            ESP_LOGD(TAG, "Action: ACTION_DEVICE_ENUM Stage %s (%d)", STAGE_STR[enum_stage], enum_stage);
            bool if_waiting = false;
            ret = _uvc_uac_device_enum(false, &if_waiting);
            if (if_waiting) {
                action_bits &= ~ACTION_DEVICE_ENUM;
                ESP_LOGD(TAG, "Action: ACTION_DEVICE_ENUM, Waiting URB Done");
            }
            if (ret != ESP_OK) {
                action_bits &= ~ACTION_DEVICE_ENUM;
#ifdef CONFIG_USB_ENUM_FAILED_RETRY
                // if enum failed, we only retry if port not disabled or recovered
                if (--enum_retry_count > 0) {
                    enum_retry_delay_ms = CONFIG_USB_ENUM_FAILED_RETRY_DELAY_MS;
                    action_bits |= ACTION_DEVICE_ENUM_RECOVER;
                    ESP_LOGW(TAG, "USB enum failed, retrying in %d ms...", enum_retry_delay_ms);
                } else {
                    ESP_LOGE(TAG, "USB enum failed, no more retry");
                }
                UVC_ENTER_CRITICAL();
                usb_dev->state = (action_bits & ACTION_DEVICE_ENUM_RECOVER) ? STATE_DEVICE_RECOVER : STATE_DEVICE_ENUM_FAILED;
                UVC_EXIT_CRITICAL();
#else
                // encounter failed, block in enum failed state
                UVC_ENTER_CRITICAL();
                usb_dev->state = STATE_DEVICE_ENUM_FAILED;
                UVC_EXIT_CRITICAL();
#endif
            } else if (usb_dev->enum_stage == ENUM_STAGE_NONE) {
                UVC_ENTER_CRITICAL();
                usb_dev->state = STATE_DEVICE_ACTIVE;
                UVC_EXIT_CRITICAL();
                action_bits &= ~ACTION_DEVICE_ENUM;
                _usb_stream_connect_cb();
            }
            ESP_LOGD(TAG, "Action: ACTION_DEVICE_ENUM, Done (%d)", enum_stage);
        }
        if (action_bits & ACTION_PIPE_XFER_DONE) {
            ESP_LOGD(TAG, "Action: ACTION_PIPE_XFER_DONE");
            if (usb_dev->state == STATE_DEVICE_ENUM) {
                action_bits |= ACTION_DEVICE_ENUM;
            } else {
                xEventGroupSetBits(usb_dev->event_group_hdl, USB_CTRL_PROC_SUCCEED);
            }
            action_bits &= ~ACTION_PIPE_XFER_DONE;
            ESP_LOGD(TAG, "Action: ACTION_PIPE_XFER_DONE, Done!");
        }
    }
    if (usb_dev->port_hdl) {
        _usb_port_deinit(usb_dev->port_hdl);
        usb_dev->port_hdl = NULL;
    }
free_task_:
    UVC_ENTER_CRITICAL();
    usb_dev->state = STATE_NONE;
    UVC_EXIT_CRITICAL();
    ESP_LOGI(TAG, "_usb_processing_task deleted");
    ESP_LOGD(TAG, "_usb_processing_task watermark = %d B", uxTaskGetStackHighWaterMark(NULL));
    xEventGroupClearBits(usb_dev->event_group_hdl, (USB_HOST_INIT_DONE | USB_HOST_TASK_KILL_BIT));
    vTaskDelete(NULL);
}

/*populate frame then call user callback*/
static void _sample_processing_task(void *arg)
{
    UVC_CHECK_RETURN_VOID(arg != NULL, "sample task arg should be _uvc_stream_handle_t *");
    _uvc_stream_handle_t *strmh = (_uvc_stream_handle_t *)(arg);
    uint32_t last_seq = 0;
    ESP_LOGI(TAG, "Sample processing task start");

    xEventGroupClearBits(s_usb_dev.event_group_hdl, UVC_SAMPLE_PROC_STOP_DONE);
    do {
        xSemaphoreTake(strmh->cb_mutex, portMAX_DELAY);

        while (strmh->running && last_seq == strmh->hold_seq) {
            xSemaphoreGive(strmh->cb_mutex);
            ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
            ESP_LOGV(TAG, "GOT LENGTH %d", strmh->hold_bytes);
            xSemaphoreTake(strmh->cb_mutex, portMAX_DELAY);
        }

        if (!strmh->running) {
            xSemaphoreGive(strmh->cb_mutex);
            ESP_LOGI(TAG, "sample processing stop");
            break;
        }

        last_seq = strmh->hold_seq;
        _uvc_populate_frame(strmh);
        xSemaphoreGive(strmh->cb_mutex);
        //user callback for decode and display,
        strmh->user_cb(&strmh->frame, strmh->user_ptr);
        /* code */
    } while (1);

    ESP_LOGI(TAG, "Sample processing task deleted");
    ESP_LOGD(TAG, "Sample processing task watermark = %d B", uxTaskGetStackHighWaterMark(NULL));
    xEventGroupSetBits(s_usb_dev.event_group_hdl, UVC_SAMPLE_PROC_STOP_DONE);
    vTaskDelete(NULL);
}

static esp_err_t usb_stream_control(usb_stream_t stream, stream_ctrl_t ctrl_type)
{
    UVC_CHECK(ctrl_type == CTRL_SUSPEND || ctrl_type == CTRL_RESUME, "USB Device not active", ESP_ERR_INVALID_ARG);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    TaskHandle_t task_handle = xTaskGetCurrentTaskHandle();
    if (task_handle == s_usb_dev.stream_task_hdl) {
        //If resume/suspend is called in stream task, we just set flag and return
        if (ctrl_type == CTRL_SUSPEND) {
            s_usb_dev.ifc[stream]->suspended = true;
        } else {
            s_usb_dev.ifc[stream]->suspended = false;
        }
        ESP_LOGD(TAG, "%s %s in state callback", ctrl_type == CTRL_SUSPEND ? "Suspend" : "Resume", s_usb_dev.ifc[stream]->name);
        return ESP_OK;
    }
    esp_err_t ret = ESP_OK;
    _stream_ifc_t *p_itf = s_usb_dev.ifc[stream];
    _event_msg_t event_msg = {
        ._type = USER_EVENT,
        ._event_data = (void *)stream,
        ._event.user_cmd = STREAM_SUSPEND,
    };

    if (ctrl_type == CTRL_RESUME) {
        //check if streaming is not running
        UVC_CHECK(!(xEventGroupGetBits(s_usb_dev.event_group_hdl) & p_itf->evt_bit), "Streaming is running", ESP_ERR_INVALID_STATE);
        ESP_LOGI(TAG, "Resume %s streaming", p_itf->name);
        //resume streaming interface first
        ret = _usb_streaming_resume(stream);
        UVC_CHECK(ret == ESP_OK, "Resume interface Failed", ESP_FAIL);
        //send resume command to resume transfer
        event_msg._event.user_cmd = STREAM_RESUME;
        xEventGroupClearBits(s_usb_dev.event_group_hdl, USB_STREAM_TASK_PROC_SUCCEED | USB_STREAM_TASK_PROC_FAILED);
        xQueueSend(s_usb_dev.stream_queue_hdl, &event_msg, portMAX_DELAY);
        EventBits_t uxBits = xEventGroupWaitBits(s_usb_dev.event_group_hdl, (USB_STREAM_TASK_PROC_SUCCEED | USB_STREAM_TASK_PROC_FAILED), pdTRUE, pdFALSE, pdMS_TO_TICKS(TIMEOUT_USER_COMMAND_MS));
        UVC_CHECK(uxBits & (USB_STREAM_TASK_PROC_SUCCEED), "Reset transfer failed/timeout", ESP_FAIL);
        ESP_LOGD(TAG, "Resume %s streaming Done", p_itf->name);
    } else if (ctrl_type == CTRL_SUSPEND) {
        //check if streaming is running
        UVC_CHECK((xEventGroupGetBits(s_usb_dev.event_group_hdl) & p_itf->evt_bit), "Streaming not running", ESP_ERR_INVALID_STATE);
        ESP_LOGI(TAG, "Suspend %s streaming", p_itf->name);
        //send suspend command to stop transfer first
        event_msg._event.user_cmd = STREAM_SUSPEND;
        xEventGroupClearBits(s_usb_dev.event_group_hdl, USB_STREAM_TASK_PROC_SUCCEED | USB_STREAM_TASK_PROC_FAILED);
        xQueueSend(s_usb_dev.stream_queue_hdl, &event_msg, portMAX_DELAY);
        EventBits_t uxBits = xEventGroupWaitBits(s_usb_dev.event_group_hdl, (USB_STREAM_TASK_PROC_SUCCEED | USB_STREAM_TASK_PROC_FAILED), pdTRUE, pdFALSE, pdMS_TO_TICKS(TIMEOUT_USER_COMMAND_MS));
        UVC_CHECK(uxBits & (USB_STREAM_TASK_PROC_SUCCEED), "Reset transfer failed/timeout", ESP_FAIL);
        //suspend streaming interface
        ret = _usb_streaming_suspend(stream);
        UVC_CHECK(ret == ESP_OK, "Resume interface Failed", ESP_FAIL);
        ESP_LOGD(TAG, "Suspend %s streaming Done", p_itf->name);
    }
    return ESP_OK;
}

static esp_err_t uac_feature_control(usb_stream_t stream, stream_ctrl_t ctrl_type, void *ctrl_value)
{
    _stream_ifc_t *p_itf = s_usb_dev.ifc[stream];
    esp_err_t ret = ESP_OK;
    bool submit_ctrl = true;
    if (_usb_device_get_state() != STATE_DEVICE_ACTIVE) {
        submit_ctrl = false;
    }

    _uac_internal_stream_t uac_stream = (stream == STREAM_UAC_SPK ? UAC_SPK : UAC_MIC);
    UVC_ENTER_CRITICAL();
    uint16_t ac_interface = s_usb_dev.uac->ac_interface;
    uint8_t mute_ch = s_usb_dev.uac->mute_ch[uac_stream];
    uint8_t fu_id = s_usb_dev.uac->fu_id[uac_stream];
    uint8_t volume_ch = s_usb_dev.uac->volume_ch[uac_stream];
    UVC_EXIT_CRITICAL();

    switch (ctrl_type) {
    case CTRL_UAC_MUTE:
        UVC_ENTER_CRITICAL();
        s_usb_dev.uac->mute[uac_stream] = (uint32_t)ctrl_value;
        UVC_EXIT_CRITICAL();
        if (submit_ctrl && fu_id != 0) {
            ret = _uac_as_control_set_mute(ac_interface, mute_ch, fu_id, (uint32_t)ctrl_value);
            ESP_LOGI(TAG, "Set %s %s", stream == STREAM_UAC_SPK ? "SPK" : "MIC", (uint32_t)ctrl_value ? "Mute" : "UnMute");
        } else if (fu_id != 0) {
            ret = ESP_ERR_INVALID_SIZE;
        }
        break;
    case CTRL_UAC_VOLUME:
        UVC_ENTER_CRITICAL();
        s_usb_dev.uac->volume[uac_stream] = (uint32_t)ctrl_value;
        UVC_EXIT_CRITICAL();
        if (submit_ctrl && fu_id != 0) {
            ret = _uac_as_control_set_volume(ac_interface, volume_ch, fu_id, (uint32_t)ctrl_value);
            ESP_LOGI(TAG, "Set %s volume = %" PRIu32, stream == STREAM_UAC_SPK ? "SPK" : "MIC", (uint32_t)ctrl_value);
        } else if (fu_id != 0) {
            ret = ESP_ERR_INVALID_SIZE;
        }
        break;
    default:
        break;
    }

    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "%s Feature Control: type = %d value = %p, Done", p_itf->name, ctrl_type, ctrl_value);
    } else {
        ESP_LOGW(TAG, "%s Feature Control: type = %d value = %p, Failed", p_itf->name, ctrl_type, ctrl_value);
    }
    return ret;
}

/***************************************************** Public API *********************************************************************/
esp_err_t uac_streaming_config(const uac_config_t *config)
{
    UVC_CHECK(s_usb_dev.event_group_hdl == NULL, "usb streaming is running", ESP_ERR_INVALID_STATE);
    //We do not prevent re-config, but the configs will take effect after re-connect/recover/re-enumeration/
    UVC_CHECK(config != NULL, "config can't NULL", ESP_ERR_INVALID_ARG);
    if (config->mic_samples_frequence && config->mic_bit_resolution) {
        //using samples_frequence and bit_resolution as enable condition
        UVC_CHECK(config->mic_samples_frequence == UAC_FREQUENCY_ANY || (config->mic_samples_frequence >= 1000 && config->mic_samples_frequence <= 48000),
                  "mic samples frequency must <= 48000Hz and >= 1000 Hz ", ESP_ERR_INVALID_ARG);
        UVC_CHECK(config->mic_bit_resolution == UAC_BITS_ANY || (config->mic_bit_resolution >= 8 && config->mic_bit_resolution <= 24),
                  "mic bit resolution must >= 8 bit and <=24 bit", ESP_ERR_INVALID_ARG);
        UVC_CHECK(config->mic_ch_num == UAC_CH_ANY || (config->mic_ch_num >= 1 && config->mic_ch_num <= 2),
                  "mic channel number must >= 1 and <=2", ESP_ERR_INVALID_ARG);
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        UVC_CHECK(config->mic_interface, "mic interface can not be 0", ESP_ERR_INVALID_ARG);
        if (config->ac_interface) {
            UVC_CHECK(config->mic_fu_id, "mic feature unit id can not be 0", ESP_ERR_INVALID_ARG);
        }
#endif
        //below params act as backup configs, if suitable config not found from device descriptors
        if (config->mic_interface) {
            UVC_CHECK(config->mic_ep_addr & 0x80, "mic endpoint direction must IN", ESP_ERR_INVALID_ARG);
            UVC_CHECK(config->mic_ep_mps, "mic endpoint mps must > 0", ESP_ERR_INVALID_ARG);
            UVC_CHECK(config->mic_samples_frequence * config->mic_bit_resolution / 8000 <= config->mic_ep_mps, "mic packet size must <= endpoint mps", ESP_ERR_INVALID_ARG);
        }
    }
    if (config->spk_samples_frequence && config->spk_bit_resolution) {
        //using samples_frequence and bit_resolution as enable condition
        UVC_CHECK(config->spk_samples_frequence == UAC_FREQUENCY_ANY || (config->spk_samples_frequence >= 1000 && config->spk_samples_frequence <= 48000),
                  "speaker samples frequency must <= 48000Hz and >= 1000 Hz ", ESP_ERR_INVALID_ARG);
        UVC_CHECK(config->spk_bit_resolution == UAC_BITS_ANY || (config->spk_bit_resolution >= 8 && config->spk_bit_resolution <= 24),
                  "speaker bit resolution must >= 8 bit and <=24 bit", ESP_ERR_INVALID_ARG);
        UVC_CHECK(config->spk_ch_num == UAC_CH_ANY || (config->spk_ch_num >= 1 && config->spk_ch_num <= 2),
                  "speaker channel number must >= 1 and <=2", ESP_ERR_INVALID_ARG);
        UVC_CHECK(config->spk_buf_size, "spk buffer size can not be 0", ESP_ERR_INVALID_ARG);
#ifndef CONFIG_UVC_GET_CONFIG_DESC
        UVC_CHECK(config->spk_interface, "spk interface can not be 0", ESP_ERR_INVALID_ARG);
        if (config->ac_interface) {
            UVC_CHECK(config->spk_fu_id, "spk feature unit id can not be 0", ESP_ERR_INVALID_ARG);
        }
#endif
        if (config->spk_interface) {
            //if user set this interface manually, below param should also be set
            UVC_CHECK(!(config->spk_ep_addr & 0x80), "spk endpoint direction must OUT", ESP_ERR_INVALID_ARG);
            UVC_CHECK(config->spk_buf_size > config->spk_ep_mps, "spk buffer size should larger than endpoint size", ESP_ERR_INVALID_ARG);
            UVC_CHECK(config->spk_ep_mps, "speaker endpoint mps must > 0", ESP_ERR_INVALID_ARG);
            UVC_CHECK(config->spk_samples_frequence * config->spk_bit_resolution / 8000 <= config->spk_ep_mps, "spk packet size must <= endpoint mps", ESP_ERR_INVALID_ARG);
        }
    }
    s_usb_dev.uac_cfg = *config;
    s_usb_dev.flags |= config->flags;
    if (s_usb_dev.flags & FLAG_UAC_SPK_SUSPEND_AFTER_START) {
        ESP_LOGI(TAG, "SPK Streaming Suspend After Start");
    } else if (s_usb_dev.flags & FLAG_UAC_MIC_SUSPEND_AFTER_START) {
        ESP_LOGI(TAG, "MIC Streaming Suspend After Start");
    }
    ESP_LOGI(TAG, "UAC Streaming Config Succeed, Version: %d.%d.%d", USB_STREAM_VER_MAJOR, USB_STREAM_VER_MINOR, USB_STREAM_VER_PATCH);
    return ESP_OK;
}

esp_err_t uvc_streaming_config(const uvc_config_t *config)
{
    UVC_CHECK(s_usb_dev.event_group_hdl == NULL, "usb streaming is running", ESP_ERR_INVALID_STATE);
    //We do not prevent re-config, but the configs will take effect after re-connect/recover/re-enumeration/
    UVC_CHECK(config != NULL, "config can't NULL", ESP_ERR_INVALID_ARG);
    UVC_CHECK((config->frame_interval >= FRAME_MIN_INTERVAL && config->frame_interval <= FRAME_MAX_INTERVAL),
              "frame_interval Support 333333~2000000", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->format < UVC_FORMAT_MAX, "format can't larger than UVC_FORMAT_MAX", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->frame_height != 0, "frame_height can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->frame_width != 0, "frame_width can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->frame_buffer_size != 0, "frame_buffer_size can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->xfer_buffer_size != 0, "xfer_buffer_size can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->xfer_buffer_a != NULL, "xfer_buffer_a can't NULL", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->xfer_buffer_b != NULL, "xfer_buffer_b can't NULL", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->frame_buffer != NULL, "frame_buffer can't NULL", ESP_ERR_INVALID_ARG);
#ifndef CONFIG_UVC_GET_CONFIG_DESC
    //Additional check for quick start mode
    UVC_CHECK(config->interface, "interface can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->xfer_type == UVC_XFER_ISOC || config->xfer_type == UVC_XFER_BULK, "xfer_type must be UVC_XFER_ISOC or UVC_XFER_BULK", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->format_index != 0, "format_index can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->frame_index != 0, "frame_index can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->frame_width != FRAME_RESOLUTION_ANY, "frame_width can't FRAME_RESOLUTION_ANY", ESP_ERR_INVALID_ARG);
    UVC_CHECK(config->frame_height != FRAME_RESOLUTION_ANY, "frame_height can't FRAME_RESOLUTION_ANY", ESP_ERR_INVALID_ARG);
#endif
    //below params act as backup configs, if suitable config not found from device descriptors
    if (config->interface) {
        UVC_CHECK(config->ep_addr & 0x80, "Endpoint direction must IN", ESP_ERR_INVALID_ARG);
        if (config->xfer_type == UVC_XFER_ISOC) {
            UVC_CHECK(config->ep_mps <= USB_EP_ISOC_IN_MAX_MPS, "Isoc total MPS must < USB_EP_ISOC_IN_MAX_MPS", ESP_ERR_INVALID_ARG);
            UVC_CHECK(config->interface_alt != 0, "Isoc interface alt num must > 0", ESP_ERR_INVALID_ARG);
        } else {
            UVC_CHECK(config->interface_alt == 0, "Bulk interface alt num must == 0", ESP_ERR_INVALID_ARG);
            UVC_CHECK(config->ep_mps == USB_EP_BULK_FS_MPS || config->ep_mps == USB_EP_BULK_HS_MPS, "Bulk MPS must == 64 or 512", ESP_ERR_INVALID_ARG);
        }
    }
    s_usb_dev.uvc_cfg = *config;
    s_usb_dev.flags |= config->flags;
    if (s_usb_dev.flags & FLAG_UVC_SUSPEND_AFTER_START) {
        ESP_LOGI(TAG, "UVC Streaming Suspend After Start");
    }
    ESP_LOGI(TAG, "UVC Streaming Config Succeed, Version: %d.%d.%d", USB_STREAM_VER_MAJOR, USB_STREAM_VER_MINOR, USB_STREAM_VER_PATCH);
#ifdef CONFIG_USB_STREAM_QUICK_START
    // Please make sure your camera can skip the enumeration stage and start streaming directly
    ESP_LOGI(TAG, "Quick Start Mode Enabled");
#endif
    return ESP_OK;
}

