madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
esp_err_t usb_streaming_start()
{
    UVC_CHECK(s_usb_dev.event_group_hdl == NULL, "usb streaming is running", ESP_ERR_INVALID_STATE);
    s_usb_dev.event_group_hdl = xEventGroupCreate();
    UVC_CHECK(s_usb_dev.event_group_hdl  != NULL, "Create event group failed", ESP_FAIL);
    s_usb_dev.queue_hdl = xQueueCreate(USB_EVENT_QUEUE_LEN, sizeof(_event_msg_t));
    UVC_CHECK_GOTO(s_usb_dev.queue_hdl != NULL, "Create event queue failed", free_resource_);
    s_usb_dev.stream_queue_hdl = xQueueCreate(USB_STREAM_EVENT_QUEUE_LEN, sizeof(_event_msg_t));
    UVC_CHECK_GOTO(s_usb_dev.stream_queue_hdl != NULL, "Create event queue failed", free_resource_);
    s_usb_dev.xfer_mutex_hdl = xSemaphoreCreateMutex();
    UVC_CHECK_GOTO(s_usb_dev.xfer_mutex_hdl != NULL, "Create transfer mutex failed", free_resource_);
    s_usb_dev.ctrl_smp_hdl = xSemaphoreCreateBinary();
    UVC_CHECK_GOTO(s_usb_dev.ctrl_smp_hdl != NULL, "Create ctrl mutex failed", free_resource_);
    xSemaphoreGive(s_usb_dev.ctrl_smp_hdl);
#if USB_PRE_ALLOC_CTRL_TRANSFER_URB
    s_usb_dev.ctrl_urb = _usb_urb_alloc(0, sizeof(usb_setup_packet_t) + CTRL_TRANSFER_DATA_MAX_BYTES, NULL);
    UVC_CHECK_GOTO(s_usb_dev.ctrl_urb != NULL, "malloc ctrl urb failed", free_resource_);
    ESP_LOGI(TAG, "Pre-alloc ctrl urb succeed, size = %d", CTRL_TRANSFER_DATA_MAX_BYTES);
#endif
    s_usb_dev.dev_speed = USB_SPEED_FULL;
    s_usb_dev.dev_addr = USB_DEVICE_ADDR;
    s_usb_dev.configuration = USB_CONFIG_NUM;
    s_usb_dev.fifo_bias = HCD_PORT_FIFO_BIAS_BALANCED;
    s_usb_dev.mps_limits = &s_mps_limits_default;

    if (s_usb_dev.uac_cfg.spk_samples_frequence && s_usb_dev.uac_cfg.spk_bit_resolution) {
        //using samples_frequence and bit_resolution as enable condition
        s_usb_dev.uac = heap_caps_calloc(1, sizeof(_uac_device_t), MALLOC_CAP_INTERNAL);
        UVC_CHECK_GOTO(s_usb_dev.uac != NULL, "malloc failed", free_resource_);
        s_usb_dev.uac->as_ifc[UAC_SPK] = heap_caps_calloc(1, sizeof(_stream_ifc_t), MALLOC_CAP_INTERNAL);
        UVC_CHECK_GOTO(s_usb_dev.uac->as_ifc[UAC_SPK] != NULL, "malloc failed", free_resource_);
        s_usb_dev.ifc[STREAM_UAC_SPK] = s_usb_dev.uac->as_ifc[UAC_SPK];
        s_usb_dev.ifc[STREAM_UAC_SPK]->type = STREAM_UAC_SPK;
        s_usb_dev.ifc[STREAM_UAC_SPK]->name = "SPK";
        s_usb_dev.ifc[STREAM_UAC_SPK]->evt_bit = UAC_SPK_STREAM_RUNNING;
        if (s_usb_dev.uac_cfg.spk_buf_size) {
            s_usb_dev.uac->ringbuf_hdl[UAC_SPK] = xRingbufferCreate(s_usb_dev.uac_cfg.spk_buf_size, RINGBUF_TYPE_BYTEBUF);
            ESP_LOGD(TAG, "Speaker ringbuf create succeed, size = %"PRIu32, s_usb_dev.uac_cfg.spk_buf_size);
            UVC_CHECK_GOTO(s_usb_dev.uac->ringbuf_hdl[UAC_SPK] != NULL, "Create speak buffer failed", free_resource_);
        }
        ESP_LOGD(TAG, "Speaker instance created");
        s_usb_dev.enabled[STREAM_UAC_SPK] = true;
    }
    if (s_usb_dev.uac_cfg.mic_samples_frequence && s_usb_dev.uac_cfg.mic_bit_resolution) {
        //using samples_frequence and bit_resolution as enable condition
        if (s_usb_dev.uac == NULL) {
            s_usb_dev.uac = heap_caps_calloc(1, sizeof(_uac_device_t), MALLOC_CAP_INTERNAL);
            UVC_CHECK_GOTO(s_usb_dev.uac != NULL, "malloc failed", free_resource_);
        }
        s_usb_dev.uac->as_ifc[UAC_MIC] = heap_caps_calloc(1, sizeof(_stream_ifc_t), MALLOC_CAP_INTERNAL);
        UVC_CHECK_GOTO(s_usb_dev.uac->as_ifc[UAC_MIC] != NULL, "malloc failed", free_resource_);
        s_usb_dev.ifc[STREAM_UAC_MIC] = s_usb_dev.uac->as_ifc[UAC_MIC];
        s_usb_dev.ifc[STREAM_UAC_MIC]->type = STREAM_UAC_MIC;
        s_usb_dev.ifc[STREAM_UAC_MIC]->name = "MIC";
        s_usb_dev.ifc[STREAM_UAC_MIC]->evt_bit = UAC_MIC_STREAM_RUNNING;
        if (s_usb_dev.uac_cfg.mic_buf_size) {
            s_usb_dev.uac->ringbuf_hdl[UAC_MIC] = xRingbufferCreate(s_usb_dev.uac_cfg.mic_buf_size, RINGBUF_TYPE_BYTEBUF);
            ESP_LOGD(TAG, "MIC ringbuf create succeed, size = %"PRIu32, s_usb_dev.uac_cfg.mic_buf_size);
            UVC_CHECK_GOTO(s_usb_dev.uac->ringbuf_hdl[UAC_MIC] != NULL, "Create speak buffer failed", free_resource_);
        }
        ESP_LOGD(TAG, "Speaker instance created");
        s_usb_dev.enabled[STREAM_UAC_MIC] = true;
    }
    if (s_usb_dev.uvc_cfg.frame_width && s_usb_dev.uvc_cfg.frame_height) {
        //using frame_width and frame_height as enable condition
        s_usb_dev.uvc = heap_caps_calloc(1, sizeof(_uvc_device_t), MALLOC_CAP_INTERNAL);
        UVC_CHECK_GOTO(s_usb_dev.uvc != NULL, "malloc failed", free_resource_);
        s_usb_dev.uvc->vs_ifc = heap_caps_calloc(1, sizeof(_stream_ifc_t), MALLOC_CAP_INTERNAL);
        UVC_CHECK_GOTO(s_usb_dev.uvc->vs_ifc != NULL, "malloc failed", free_resource_);
        s_usb_dev.ifc[STREAM_UVC] = s_usb_dev.uvc->vs_ifc;
        s_usb_dev.ifc[STREAM_UVC]->type = STREAM_UVC;
        s_usb_dev.ifc[STREAM_UVC]->name = "UVC";
        s_usb_dev.ifc[STREAM_UVC]->evt_bit = USB_UVC_STREAM_RUNNING;
        ESP_LOGD(TAG, "Camera instance created");
        s_usb_dev.enabled[STREAM_UVC] = true;
        //if enable uvc, we should set fifo bias to RX
        s_usb_dev.fifo_bias = HCD_PORT_FIFO_BIAS_RX;
        s_usb_dev.mps_limits = &s_mps_limits_bias_rx;
    }
    UVC_CHECK_GOTO(s_usb_dev.enabled[STREAM_UAC_MIC] == true || s_usb_dev.enabled[STREAM_UAC_SPK] == true || s_usb_dev.enabled[STREAM_UVC] == true, "uac/uvc streaming not configured", free_resource_);

    TaskHandle_t usbh_taskh = NULL;
    xTaskCreatePinnedToCore(_usb_processing_task, USB_PROC_TASK_NAME, USB_PROC_TASK_STACK_SIZE, NULL,
                            USB_PROC_TASK_PRIORITY, &usbh_taskh, USB_PROC_TASK_CORE);
    UVC_CHECK_GOTO(usbh_taskh != NULL, "Create usb processing task failed", free_resource_);
    xTaskCreatePinnedToCore(_usb_stream_handle_task, USB_STREAM_NAME, USB_STREAM_STACK_SIZE, NULL,
                            USB_STREAM_PRIORITY, &s_usb_dev.stream_task_hdl, USB_STREAM_CORE);
    assert(s_usb_dev.stream_task_hdl != NULL); //can not handle this error, just assert
    xTaskNotifyGive(usbh_taskh);
    xEventGroupWaitBits(s_usb_dev.event_group_hdl, USB_HOST_INIT_DONE, pdFALSE, pdFALSE, portMAX_DELAY);
    ESP_LOGI(TAG, "USB Streaming Start Succeed");
    return ESP_OK;

free_resource_:
    if (s_usb_dev.event_group_hdl) {
        vEventGroupDelete(s_usb_dev.event_group_hdl);
        s_usb_dev.event_group_hdl = NULL;
    }
    if (s_usb_dev.queue_hdl) {
        vQueueDelete(s_usb_dev.queue_hdl);
        s_usb_dev.queue_hdl = NULL;
    }
    if (s_usb_dev.stream_queue_hdl) {
        vQueueDelete(s_usb_dev.stream_queue_hdl);
        s_usb_dev.stream_queue_hdl = NULL;
    }
    if (s_usb_dev.xfer_mutex_hdl) {
        vSemaphoreDelete(s_usb_dev.xfer_mutex_hdl);
        s_usb_dev.xfer_mutex_hdl = NULL;
    }
    if (s_usb_dev.ctrl_smp_hdl) {
        vSemaphoreDelete(s_usb_dev.ctrl_smp_hdl);
        s_usb_dev.ctrl_smp_hdl = NULL;
    }
    if (s_usb_dev.ctrl_urb) {
        _usb_urb_free(s_usb_dev.ctrl_urb);
        s_usb_dev.ctrl_urb = NULL;
    }
    if (s_usb_dev.uvc) {
        if (s_usb_dev.uvc->vs_ifc) {
            free(s_usb_dev.uvc->vs_ifc);
        }
        s_usb_dev.ifc[STREAM_UVC] = NULL;
        free(s_usb_dev.uvc);
    }
    if (s_usb_dev.uac) {
        if (s_usb_dev.uac->ringbuf_hdl[UAC_SPK]) {
            vRingbufferDelete(s_usb_dev.uac->ringbuf_hdl[UAC_SPK]);
        }
        if (s_usb_dev.uac->ringbuf_hdl[UAC_MIC]) {
            vRingbufferDelete(s_usb_dev.uac->ringbuf_hdl[UAC_MIC]);
        }
        if (s_usb_dev.uac->as_ifc[UAC_SPK]) {
            free(s_usb_dev.uac->as_ifc[UAC_SPK]);
        }
        if (s_usb_dev.uac->as_ifc[UAC_MIC]) {
            free(s_usb_dev.uac->as_ifc[UAC_MIC]);
        }
        s_usb_dev.ifc[STREAM_UAC_SPK] = NULL;
        s_usb_dev.ifc[STREAM_UAC_MIC] = NULL;
        free(s_usb_dev.uac);
    }
    return ESP_FAIL;
}

