madshobye/Portal/arduinolibs/ESP32_USB_STREAM/src/original/usb_stream.c
esp_err_t usb_streaming_connect_wait(size_t timeout_ms)
{
    if (!s_usb_dev.event_group_hdl || !(xEventGroupGetBits(s_usb_dev.event_group_hdl) & USB_HOST_INIT_DONE)) {
        ESP_LOGW(TAG, "USB Streaming not started");
        return ESP_ERR_INVALID_STATE;
    }
    ESP_LOGI(TAG, "Waiting USB Device Connection");
    EventBits_t bits = xEventGroupWaitBits(s_usb_dev.event_group_hdl, USB_STREAM_DEVICE_READY_BIT, false, false, pdMS_TO_TICKS(timeout_ms));
    if (!(bits & USB_STREAM_DEVICE_READY_BIT)) {
        ESP_LOGW(TAG, "Waiting Device Connection, timeout");
        return ESP_ERR_TIMEOUT;
    }
    //lets wait a little more time for stream be handled
    vTaskDelay(pdMS_TO_TICKS(20));
    ESP_LOGI(TAG, "USB Device Connected");
    return ESP_OK;
}

esp_err_t usb_streaming_state_register(state_callback_t cb, void *user_ptr)
{
    if (s_usb_dev.event_group_hdl) {
        ESP_LOGW(TAG, "USB streaming is running, callback need register before start");
        return ESP_ERR_INVALID_STATE;
    }
    if (s_usb_dev.state_cb) {
        ESP_LOGW(TAG, "Overwrite registered callback");
    }
    if (cb) {
        s_usb_dev.state_cb = cb;
        s_usb_dev.state_cb_arg = user_ptr;
    }
    ESP_LOGI(TAG, "USB streaming callback register succeed");
    return ESP_OK;
}

esp_err_t usb_streaming_stop(void)
{
    if (!s_usb_dev.event_group_hdl || !(xEventGroupGetBits(s_usb_dev.event_group_hdl) & USB_HOST_INIT_DONE)) {
        ESP_LOGW(TAG, "USB Streaming not started");
        return ESP_ERR_INVALID_STATE;
    }
    ESP_LOGI(TAG, "USB Streaming Stop");
    esp_err_t ret = _event_set_bits_wait_cleared(s_usb_dev.event_group_hdl, USB_HOST_TASK_KILL_BIT, pdMS_TO_TICKS(TIMEOUT_USER_COMMAND_MS));
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "USB Streaming Stop Failed");
        return ESP_ERR_TIMEOUT;
    }
    if (s_usb_dev.ctrl_urb) {
        _usb_urb_free(s_usb_dev.ctrl_urb);
    }
    if (s_usb_dev.uvc) {
        if (s_usb_dev.uvc->frame_size) {
#ifdef CONFIG_UVC_GET_CONFIG_DESC
            free(s_usb_dev.uvc->frame_size);
#endif
        }
        if (s_usb_dev.uvc->vs_ifc) {
            free(s_usb_dev.uvc->vs_ifc);
        }
        free(s_usb_dev.uvc);
    }
    if (s_usb_dev.uac) {
        for (size_t i = 0; i < UAC_MAX; i++) {
            if (s_usb_dev.uac->ringbuf_hdl[i]) {
                vRingbufferDelete(s_usb_dev.uac->ringbuf_hdl[i]);
            }
            if (s_usb_dev.uac->as_ifc[i]) {
                free(s_usb_dev.uac->as_ifc[i]);
            }
            if (s_usb_dev.uac->frame_size[i]) {
#ifdef CONFIG_UVC_GET_CONFIG_DESC
                free(s_usb_dev.uac->frame_size[i]);
#endif
            }
        }
        if (s_usb_dev.uac->mic_frame_buf) {
            free(s_usb_dev.uac->mic_frame_buf);
        }
        free(s_usb_dev.uac);
    }
    vQueueDelete(s_usb_dev.queue_hdl);
    vQueueDelete(s_usb_dev.stream_queue_hdl);
    vEventGroupDelete(s_usb_dev.event_group_hdl);
    vSemaphoreDelete(s_usb_dev.xfer_mutex_hdl);
    vSemaphoreDelete(s_usb_dev.ctrl_smp_hdl);
    memset(&s_usb_dev, 0, sizeof(_usb_device_t));
    //wait more time for task resources recovery
    vTaskDelay(pdMS_TO_TICKS(WAITING_TASK_RESOURCE_RELEASE_MS));
    ESP_LOGI(TAG, "USB Streaming Stop Done");
    return ESP_OK;
}

esp_err_t usb_streaming_control(usb_stream_t stream, stream_ctrl_t ctrl_type, void *ctrl_value)
{
    UVC_CHECK(stream < STREAM_MAX, "Invalid stream", ESP_ERR_INVALID_ARG);
    UVC_CHECK(ctrl_type < CTRL_MAX, "Invalid control type", ESP_ERR_INVALID_ARG);
    if (!s_usb_dev.event_group_hdl || !(xEventGroupGetBits(s_usb_dev.event_group_hdl) & USB_HOST_INIT_DONE)) {
        ESP_LOGW(TAG, "USB stream not started");
        return ESP_ERR_INVALID_STATE;
    }
    UVC_CHECK(s_usb_dev.enabled[stream], "stream not configured/enabled", ESP_ERR_INVALID_STATE);
    xSemaphoreTake(s_usb_dev.ctrl_smp_hdl, portMAX_DELAY);
    esp_err_t ret = ESP_OK;
    switch (ctrl_type) {
    case CTRL_SUSPEND:
    case CTRL_RESUME:
        ret = usb_stream_control(stream, ctrl_type);
        break;
    case CTRL_UAC_MUTE:
    case CTRL_UAC_VOLUME:
        ret = uac_feature_control(stream, ctrl_type, ctrl_value);
        break;
    default:
        break;
    }
    xSemaphoreGive(s_usb_dev.ctrl_smp_hdl);
    //Add delay to avoid too frequent control
    vTaskDelay(pdMS_TO_TICKS(WAITING_DEVICE_CONTROL_APPLY_MS));
    return ret;
}

esp_err_t uac_spk_streaming_write(void *data, size_t data_bytes, size_t timeout_ms)
{
    UVC_CHECK(data, "data is NULL", ESP_ERR_INVALID_ARG);
    UVC_CHECK(data_bytes, "data_bytes is 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(s_usb_dev.enabled[STREAM_UAC_SPK], "spk stream not config", ESP_ERR_INVALID_STATE);
    UVC_CHECK(s_usb_dev.uac->ringbuf_hdl[UAC_SPK] != NULL, "spk ringbuf not created", ESP_ERR_INVALID_STATE);
    UVC_CHECK(s_usb_dev.uac->as_ifc[UAC_SPK] && !s_usb_dev.uac->as_ifc[UAC_SPK]->not_found, "spk interface not found", ESP_ERR_NOT_FOUND);

    size_t remind_timeout = timeout_ms;
    bool check_valid = false;
    esp_err_t ret = ESP_OK;
    do {
        if (xEventGroupGetBits(s_usb_dev.event_group_hdl) & UAC_SPK_STREAM_RUNNING) {
            check_valid = true;
            break;
        } else {
            if (remind_timeout >= portTICK_PERIOD_MS) {
                remind_timeout -= portTICK_PERIOD_MS;
                vTaskDelay(1);
            } else {
                remind_timeout = 0;
                break;
            }
        }
    } while (remind_timeout > 0 && !check_valid);
    if (!check_valid) {
        ESP_LOGD(TAG, "write timeout: spk stream not ready");
        return ESP_ERR_TIMEOUT;
    }
    ret = _ring_buffer_push(s_usb_dev.uac->ringbuf_hdl[UAC_SPK], data, data_bytes, remind_timeout);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "write timeout: spk ringbuf full");
        return ESP_ERR_TIMEOUT;
    }
    return ESP_OK;
}

esp_err_t uac_mic_streaming_read(void *buf, size_t buf_size, size_t *data_bytes, size_t timeout_ms)
{
    UVC_CHECK(buf, "buf is NULL", ESP_ERR_INVALID_ARG);
    UVC_CHECK(buf_size, "buf_size is 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(data_bytes, "data_bytes is NULL", ESP_ERR_INVALID_ARG);
    UVC_CHECK(s_usb_dev.enabled[STREAM_UAC_MIC], "mic stream not config", ESP_ERR_INVALID_STATE);
    UVC_CHECK(s_usb_dev.uac->ringbuf_hdl[UAC_MIC] != NULL, "mic ringbuf not created", ESP_ERR_INVALID_STATE);
    UVC_CHECK(s_usb_dev.uac->as_ifc[UAC_MIC] && !s_usb_dev.uac->as_ifc[UAC_MIC]->not_found, "mic interface not found", ESP_ERR_NOT_FOUND);

    size_t remind_timeout = timeout_ms;
    bool check_valid = false;
    esp_err_t ret = ESP_OK;
    do {
        if (xEventGroupGetBits(s_usb_dev.event_group_hdl) & UAC_MIC_STREAM_RUNNING) {
            check_valid = true;
            break;
        } else {
            if (remind_timeout >= portTICK_PERIOD_MS) {
                remind_timeout -= portTICK_PERIOD_MS;
                vTaskDelay(1);
            } else {
                remind_timeout = 0;
                break;
            }
        }
    } while (remind_timeout > 0 && !check_valid);
    if (!check_valid) {
        ESP_LOGD(TAG, "spk stream not ready");
        return ESP_ERR_TIMEOUT;
    }
    ret = _ring_buffer_pop(s_usb_dev.uac->ringbuf_hdl[UAC_MIC], buf, buf_size, data_bytes, remind_timeout);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "read timeout: mic ringbuf empty");
        return ESP_ERR_TIMEOUT;
    }
    return ESP_OK;
}

esp_err_t uac_frame_size_list_get(usb_stream_t stream, uac_frame_size_t *frame_list, size_t *list_size, size_t *cur_index)
{
    UVC_CHECK(stream == STREAM_UAC_SPK || stream == STREAM_UAC_MIC, "Invalid stream", ESP_ERR_INVALID_ARG);
    UVC_CHECK(s_usb_dev.enabled[stream], "uac stream not config", ESP_ERR_INVALID_STATE);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    if (!(s_usb_dev.ifc[stream] && !s_usb_dev.ifc[stream]->not_found)) {
        if (list_size) {
            *list_size = 0;
        }
        return ESP_ERR_INVALID_STATE;
    }
    _uac_internal_stream_t uac_stream = (stream == STREAM_UAC_SPK) ? UAC_SPK : UAC_MIC;
    UVC_ENTER_CRITICAL();
    uint8_t frame_num = s_usb_dev.uac->frame_num[uac_stream];
    if (list_size) {
        *list_size = frame_num;
    }
    if (frame_list && frame_num) {
        memcpy(&frame_list[0], s_usb_dev.uac->frame_size[uac_stream], sizeof(uac_frame_size_t) * frame_num);
    }
    if (cur_index) {
        *cur_index = s_usb_dev.uac->frame_index[uac_stream] - 1;
    }
    UVC_EXIT_CRITICAL();
    return ESP_OK;
}

esp_err_t uac_frame_size_reset(usb_stream_t stream, uint8_t ch_num, uint16_t bit_resolution, uint32_t samples_frequence)
{
    UVC_CHECK(stream == STREAM_UAC_SPK || stream == STREAM_UAC_MIC, "Invalid stream", ESP_ERR_INVALID_ARG);
    UVC_CHECK(ch_num != 0, "ch_num can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(bit_resolution != 0, "bit_resolution can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(samples_frequence != 0, "samples_frequence can't 0", ESP_ERR_INVALID_ARG);
    UVC_CHECK(s_usb_dev.enabled[stream], "uac stream not config", ESP_ERR_INVALID_STATE);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    UVC_CHECK(s_usb_dev.ifc[stream] && !s_usb_dev.ifc[stream]->not_found, "uac interface not found", ESP_ERR_INVALID_STATE);
    if ((xEventGroupGetBits(s_usb_dev.event_group_hdl) & s_usb_dev.ifc[stream]->evt_bit)) {
        ESP_LOGE(TAG, "%s stream running, please suspend before frame_size_reset", s_usb_dev.ifc[stream]->name);
        return ESP_ERR_INVALID_STATE;
    }
    _uac_internal_stream_t uac_stream = (stream == STREAM_UAC_SPK) ? UAC_SPK : UAC_MIC;
    bool frame_found = false;
    uint8_t frame_index = 0;
    UVC_ENTER_CRITICAL();
    size_t frame_num = s_usb_dev.uac->frame_num[uac_stream];
    uac_frame_size_t *frame_size = s_usb_dev.uac->frame_size[uac_stream];
    for (size_t i = 0; i < frame_num; i++) {
        if (frame_size[i].ch_num == ch_num && frame_size[i].bit_resolution == bit_resolution
                && (frame_size[i].samples_frequence == samples_frequence || (samples_frequence >= frame_size[i].samples_frequence_min
                                                                             && samples_frequence <= frame_size[i].samples_frequence_max))) {
            frame_index = i + 1;
            frame_found = true;
            break;
        }
    }
    if (frame_found && s_usb_dev.uac->ch_num[uac_stream] == ch_num
            && s_usb_dev.uac->bit_resolution[uac_stream] == bit_resolution
            && s_usb_dev.uac->samples_frequence[uac_stream] == samples_frequence) {
        UVC_EXIT_CRITICAL();
        ESP_LOGW(TAG, "audio frame size not changed");
        return ESP_OK;
    }
    UVC_EXIT_CRITICAL();

    if (frame_found) {
        //Add a delay to avoid the situation that the device is not ready
        vTaskDelay(pdMS_TO_TICKS(ACTIVE_DEBOUNCE_TIME_MS));
        UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
        if (uac_stream == UAC_MIC) {
            UVC_ENTER_CRITICAL();
            s_usb_dev.uac->frame_index[UAC_MIC] = frame_index;
            //for mic support a range of samples_frequence
            s_usb_dev.uac->frame_size[UAC_MIC][frame_index - 1].samples_frequence = samples_frequence;
            s_usb_dev.uac->samples_frequence[UAC_MIC] = samples_frequence;
            UVC_EXIT_CRITICAL();
            //change users configuration
            s_usb_dev.uac_cfg.mic_ch_num = ch_num;
            s_usb_dev.uac_cfg.mic_bit_resolution = bit_resolution;
            s_usb_dev.uac_cfg.mic_samples_frequence = samples_frequence;
        } else {
            UVC_ENTER_CRITICAL();
            s_usb_dev.uac->frame_index[UAC_SPK] = frame_index;
            //for spk support a range of samples_frequence
            s_usb_dev.uac->frame_size[UAC_SPK][frame_index - 1].samples_frequence = samples_frequence;
            s_usb_dev.uac->samples_frequence[UAC_SPK] = samples_frequence;
            UVC_EXIT_CRITICAL();
            //change users configuration
            s_usb_dev.uac_cfg.spk_ch_num = ch_num;
            s_usb_dev.uac_cfg.spk_bit_resolution = bit_resolution;
            s_usb_dev.uac_cfg.spk_samples_frequence = samples_frequence;
        }
    } else {
        ESP_LOGE(TAG, "%s frame size not found, ch_num = %u, bit_resolution = %u, samples_frequence = %"PRIu32, s_usb_dev.ifc[stream]->name, ch_num, bit_resolution, samples_frequence);
        return ESP_ERR_NOT_FOUND;
    }

    ESP_LOGI(TAG, "%s frame size change, ch_num = %u, bit_resolution = %u, samples_frequence = %"PRIu32, s_usb_dev.ifc[stream]->name, ch_num, bit_resolution, samples_frequence);
    return ESP_OK;
}

esp_err_t uvc_frame_size_list_get(uvc_frame_size_t *frame_list, size_t *list_size, size_t *cur_index)
{
    UVC_CHECK(s_usb_dev.enabled[STREAM_UVC], "uvc stream not config", ESP_ERR_INVALID_STATE);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    if (!(s_usb_dev.uvc->vs_ifc && !s_usb_dev.uvc->vs_ifc->not_found)) {
        if (list_size) {
            *list_size = 0;
        }
        return ESP_ERR_INVALID_STATE;
    }
    UVC_ENTER_CRITICAL();
    uint8_t frame_num = s_usb_dev.uvc->frame_num;
    if (list_size) {
        *list_size = frame_num;
    }
    if (frame_list && frame_num) {
        memcpy(&frame_list[0], s_usb_dev.uvc->frame_size, sizeof(uvc_frame_size_t) * frame_num);
    }
    if (cur_index) {
        *cur_index = frame_num == 1 ? 0 : (s_usb_dev.uvc->frame_index - 1);
    }
    UVC_EXIT_CRITICAL();
    return ESP_OK;
}

esp_err_t uvc_frame_size_reset(uint16_t frame_width, uint16_t frame_height, uint32_t frame_interval)
{
    UVC_CHECK(s_usb_dev.enabled[STREAM_UVC], "uvc stream not config", ESP_ERR_INVALID_STATE);
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    UVC_CHECK(s_usb_dev.uvc->vs_ifc && !s_usb_dev.uvc->vs_ifc->not_found, "uvc interface not found", ESP_ERR_INVALID_STATE);
    UVC_CHECK(s_usb_dev.uvc->frame_size != NULL, "uvc frame size list not found", ESP_ERR_INVALID_STATE);
    //Add a delay to avoid the situation that the device is not ready
    vTaskDelay(pdMS_TO_TICKS(ACTIVE_DEBOUNCE_TIME_MS));
    UVC_CHECK(_usb_device_get_state() == STATE_DEVICE_ACTIVE, "USB Device not active", ESP_ERR_INVALID_STATE);
    if ((xEventGroupGetBits(s_usb_dev.event_group_hdl) & s_usb_dev.ifc[STREAM_UVC]->evt_bit)) {
        ESP_LOGE(TAG, "%s stream running, please suspend before frame_size_reset", s_usb_dev.ifc[STREAM_UVC]->name);
        return ESP_ERR_INVALID_STATE;
    }
    int frame_found = -1;
    if (frame_width && frame_height) {
        bool frame_reset = false;
        UVC_ENTER_CRITICAL();
        size_t frame_num = s_usb_dev.uvc->frame_num;
        uvc_frame_size_t *frame_size = s_usb_dev.uvc->frame_size;
        for (int i = 0; i < frame_num; i++) {
            if ((frame_width == FRAME_RESOLUTION_ANY || frame_width == frame_size[i].width)
                    && (frame_height == FRAME_RESOLUTION_ANY || frame_height == frame_size[i].height)) {
                if (i + 1 != s_usb_dev.uvc->frame_index) {
                    //change current configuration
                    s_usb_dev.uvc->frame_index = i + 1;
                    s_usb_dev.uvc->frame_height = frame_size[i].height;
                    s_usb_dev.uvc->frame_width = frame_size[i].width;
                    //change user configuration
                    s_usb_dev.uvc_cfg.frame_height = frame_size[i].height;
                    s_usb_dev.uvc_cfg.frame_width = frame_size[i].width;
                    frame_reset = true;
                }
                frame_found = i;
                break;
            }
        }
        UVC_EXIT_CRITICAL();
        if (frame_found == -1) {
            ESP_LOGE(TAG, "frame size not found, width = %d, height = %d", frame_width, frame_height);
            return ESP_ERR_NOT_FOUND;
        } else if (frame_reset == false) {
            ESP_LOGW(TAG, "frame size not changed, width = %d, height = %d", frame_width, frame_height);
            return ESP_OK;
        }
    }
    uint32_t final_interval = frame_interval;
    if (frame_interval) {
        if (frame_found != -1) {
            final_interval = 0;
            UVC_ENTER_CRITICAL();
            uvc_frame_size_t *frame_size = s_usb_dev.uvc->frame_size;
            if (frame_size[frame_found].interval_step) {
                // continues interval
                if (frame_interval >= frame_size[frame_found].interval_min && frame_interval <= frame_size[frame_found].interval_max) {
                    for (uint32_t i = frame_size[frame_found].interval_min; i < frame_size[frame_found].interval_max; i += frame_size[frame_found].interval_step) {
                        if (frame_interval >= i && frame_interval < (i + frame_size[frame_found].interval_step)) {
                            final_interval = i;
                        }
                    }
                }
            } else {
                // fixed interval
                if (frame_interval == frame_size[frame_found].interval_min) {
                    final_interval = frame_size[frame_found].interval_min;
                } else if (frame_interval == frame_size[frame_found].interval_max) {
                    final_interval = frame_size[frame_found].interval_max;
                } else if (frame_interval == frame_size[frame_found].interval) {
                    final_interval = frame_size[frame_found].interval;
                }
            }
            UVC_EXIT_CRITICAL();
            if (final_interval == 0) {
                UVC_ENTER_CRITICAL();
                final_interval = frame_size[frame_found].interval;
                UVC_EXIT_CRITICAL();
                ESP_LOGW(TAG, "frame interval %" PRIu32 " not support, using = %" PRIu32, frame_interval, final_interval);
            }
        } else {
            ESP_LOGW(TAG, "frame interval force to %" PRIu32, final_interval);
        }
        // else User should make sure the frame_interval is between frame_interval_min and frame_interval_max
        UVC_ENTER_CRITICAL();
        s_usb_dev.uvc->frame_interval = final_interval;
        UVC_EXIT_CRITICAL();
        //change user configuration
        s_usb_dev.uvc_cfg.frame_interval = final_interval;
    }
    ESP_LOGI(TAG, "UVC frame size reset, width = %d, height = %d, interval = %"PRIu32, frame_width, frame_height, final_interval);
    return ESP_OK;
}
